{
  "domain_code": "BPSY",
  "domain_name": "Biopsychology",
  "total_passages": 333,
  "passages": [
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "brain-structure-lateralization.html",
      "chapter_title": "Brain Structure & Lateralization",
      "section": "Frontal Lobe",
      "passage_type": "definition",
      "passage": "Broca's Area (Brodmann areas 44 & 45): Located in the left inferior frontal gyrus, Broca's area is critical for speech production and language expression. Damage produces Broca's aphasia (expressive/nonfluent aphasia), characterized by effortful, telegraphic speech with preserved comprehension. Patients can understand language but struggle to produce it fluently",
      "id": "BPSY-0001"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "brain-structure-lateralization.html",
      "chapter_title": "Brain Structure & Lateralization",
      "section": "Temporal Lobe",
      "passage_type": "definition",
      "passage": "Wernicke's Area (Brodmann area 22): Located in the posterior superior temporal gyrus of the dominant hemisphere, Wernicke's area is responsible for language comprehension. Damage produces Wernicke's aphasia (receptive/fluent aphasia), characterized by fluent but meaningless speech (word salad) with severely impaired comprehension",
      "id": "BPSY-0002"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "brain-structure-lateralization.html",
      "chapter_title": "Brain Structure & Lateralization",
      "section": "The Arcuate Fasciculus & Language Circuits",
      "passage_type": "definition",
      "passage": "Conduction Aphasia: Damage to the arcuate fasciculus produces conduction aphasia , characterized by fluent speech, intact comprehension, but severely impaired repetition. Patients can understand what is said and can produce spontaneous speech, but they cannot repeat words or phrases accurately. This is a high-yield distinction for the EPPP",
      "id": "BPSY-0003"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "brain-structure-lateralization.html",
      "chapter_title": "Brain Structure & Lateralization",
      "section": "Apraxia, Agnosia & Other Higher Cortical Deficits",
      "passage_type": "definition",
      "passage": "Apraxia: Apraxia is the inability to perform skilled, purposeful movements despite intact motor function, sensation, and comprehension. Ideomotor apraxia involves the inability to pantomime gestures on command (e.g., \"Show me how you brush your teeth\"), while ideational apraxia involves the inability to sequence complex motor acts. Apraxia typically results from left hemisphere damage, particularly the parietal lobe or supplementary motor area",
      "id": "BPSY-0004"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "brain-structure-lateralization.html",
      "chapter_title": "Brain Structure & Lateralization",
      "section": "Apraxia, Agnosia & Other Higher Cortical Deficits",
      "passage_type": "definition",
      "passage": "Agnosia: Agnosia is the failure to recognize objects, persons, sounds, or stimuli despite intact sensory function. Visual agnosia (inability to recognize objects by sight) is associated with occipitotemporal damage. Prosopagnosia (inability to recognize familiar faces) involves the fusiform face area. Anosognosia (unawareness of deficit) is commonly seen after right parietal damage",
      "id": "BPSY-0005"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "brain-structure-lateralization.html",
      "chapter_title": "Brain Structure & Lateralization",
      "section": "Amygdala",
      "passage_type": "definition",
      "passage": "Klüver-Bucy Syndrome: Bilateral lesioning of the amygdala, hippocampus, and temporal lobes (Klüver & Bucy, 1938) produces \"psychic blindness\" — visual agnosia, reduced fear and aggression, increased docility, dietary changes (hyperorality), and hypersexuality. This syndrome demonstrates the amygdala's critical role in recognizing the emotional significance of stimuli",
      "id": "BPSY-0006"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "brain-structure-lateralization.html",
      "chapter_title": "Brain Structure & Lateralization",
      "section": "The Cerebellum",
      "passage_type": "definition",
      "passage": "Cerebellar Damage: Ataxia is the most common outcome of damage to the cerebellum — a loss of coordination that can also be caused by abnormalities in the sensory or vestibular system. Other symptoms include dysarthria (slurred speech), intention tremor (worsens as the hand approaches a target, in contrast to Parkinson's resting tremor), nystagmus (involuntary eye movements), and gait instability. Importantly, cerebellar damage does NOT cause paralysis",
      "id": "BPSY-0007"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "brain-structure-lateralization.html",
      "chapter_title": "Brain Structure & Lateralization",
      "section": "Right Hemisphere Specialization",
      "passage_type": "clinical_note",
      "passage": "Split-Brain Studies (Sperry & Gazzaniga): Roger Sperry's Nobel Prize-winning research on split-brain patients (who had undergone corpus callosotomy for epilepsy treatment) demonstrated that the two hemispheres can operate independently. When visual information was presented exclusively to the left visual field (right hemisphere), patients could not verbally name the object but could select it with their left hand. This confirmed that the left hemisphere is dominant for language, while the right hemisphere processes visuospatial information and can recognize objects non-verbally",
      "id": "BPSY-0008"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "brain-structure-lateralization.html",
      "chapter_title": "Brain Structure & Lateralization",
      "section": "Key Thalamic Nuclei",
      "passage_type": "clinical_note",
      "passage": "High-Yield Fact: Olfaction (smell) is the only sensory modality that does not relay through the thalamus. Olfactory information travels directly from the olfactory bulb to the piriform cortex and amygdala. This is a frequently tested fact on the EPPP",
      "id": "BPSY-0009"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "brain-structure-lateralization.html",
      "chapter_title": "Brain Structure & Lateralization",
      "section": "Components",
      "passage_type": "clinical_note",
      "passage": "Direct vs. Indirect Pathways: The direct pathway through the basal ganglia facilitates movement (excitatory net effect), while the indirect pathway inhibits movement (inhibitory net effect). Parkinson's disease (too little dopamine) → difficulty initiating movement (hypokinetic). Huntington's disease (loss of GABAergic inhibitory neurons in the caudate and putamen) → excessive, uncontrolled chorea (hyperkinetic)",
      "id": "BPSY-0010"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "brain-structure-lateralization.html",
      "chapter_title": "Brain Structure & Lateralization",
      "section": "Medulla Oblongata",
      "passage_type": "clinical_note",
      "passage": "High-Yield Fact: Opioid-induced respiratory depression is due to the effects of opiates on receptors in the medulla. This is the mechanism by which opioid overdose kills — by suppressing the brainstem's respiratory drive. This is a frequently tested concept linking pharmacology to neuroanatomy",
      "id": "BPSY-0011"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "brain-structure-lateralization.html",
      "chapter_title": "Brain Structure & Lateralization",
      "section": "Reticular Activating System (RAS)",
      "passage_type": "clinical_note",
      "passage": "Clinical Significance: The RAS is clinically important for understanding disorders of consciousness. Coma results from bilateral cortical damage or damage to the RAS. Damage to specific brainstem regions can produce \"locked-in syndrome,\" where patients are conscious but unable to move or communicate except through eye movements",
      "id": "BPSY-0012"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "brain-structure-lateralization.html",
      "chapter_title": "Brain Structure & Lateralization",
      "section": "Cortical Organization: Motor & Sensory Maps",
      "passage_type": "example",
      "passage": "Clinical Example: On the motor homunculus, the hands, lips, and tongue occupy disproportionately large cortical territories compared to the trunk and legs. This reflects the fine motor control required for speech, facial expression, and manual dexterity. The EPPP may ask which body part has the largest cortical representation — the answer is the hands or face",
      "id": "BPSY-0013"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "brain-structure-lateralization.html",
      "chapter_title": "Brain Structure & Lateralization",
      "section": "Contralateral Control & Cerebral Dominance",
      "passage_type": "example",
      "passage": "EPPP Application: A stroke affecting the right motor cortex will produce left-sided hemiparesis. A lesion in the left somatosensory cortex will impair sensation on the right side of the body. The EPPP frequently tests this principle by presenting lateralized symptoms and asking examinees to identify the hemisphere involved",
      "id": "BPSY-0014"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "brain-structure-lateralization.html",
      "chapter_title": "Brain Structure & Lateralization",
      "section": "Key Thalamic Nuclei",
      "passage_type": "example",
      "passage": "EPPP Application: The amnesia associated with Wernicke-Korsakoff syndrome (caused by chronic thiamine/vitamin B1 deficiency, typically from chronic alcoholism) is due to damage to the thalamus (specifically the dorsomedial nucleus) and the mammillary bodies. Intravenous administration of thiamine is the primary treatment for Wernicke's encephalopathy",
      "id": "BPSY-0015"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "brain-structure-lateralization.html",
      "chapter_title": "Brain Structure & Lateralization",
      "section": "The \"Four F's\" of the Hypothalamus",
      "passage_type": "example",
      "passage": "EPPP Mnemonic: Lateral hypothalamus lesions → \"Lateral Leanness\" (aphagia/weight loss). Ventromedial hypothalamus lesions → \"Ventromedial Voluminosity\" (hyperphagia/obesity). These mnemonics appear frequently on EPPP study resources and the exam itself",
      "id": "BPSY-0016"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "brain-structure-lateralization.html",
      "chapter_title": "Brain Structure & Lateralization",
      "section": "Components",
      "passage_type": "example",
      "passage": "EPPP Application: Research has found that people with OCD have increased activity in the basal ganglia. High scores on the Intolerance of Uncertainty Scale have been associated with increased volume of the striatum. These findings highlight the basal ganglia's role beyond motor function — in cognitive and emotional regulation",
      "id": "BPSY-0017"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "brain-structure-lateralization.html",
      "chapter_title": "Brain Structure & Lateralization",
      "section": "The Cerebellum",
      "passage_type": "example",
      "passage": "EPPP Application: A 17-year-old who exhibits clumsiness, slurred speech, and symptoms resembling alcohol intoxication after a skateboarding accident most likely has damage to the cerebellum. Note that Gerstmann's syndrome (finger agnosia, left-right confusion, agraphia, acalculia) is caused by damage to the dominant parietal lobe , not the cerebellum — ataxia is the hallmark of cerebellar damage",
      "id": "BPSY-0018"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "brain-structure-lateralization.html",
      "chapter_title": "Brain Structure & Lateralization",
      "section": "The Four Lobes of the Cerebral Cortex",
      "passage_type": "paragraph",
      "passage": "The cerebral cortex is the outermost layer of the brain, responsible for higher cognitive functions including reasoning, language, and voluntary movement. It is organized into four major lobes, each with distinct functional specializations that are heavily tested on the EPPP",
      "id": "BPSY-0019"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "brain-structure-lateralization.html",
      "chapter_title": "Brain Structure & Lateralization",
      "section": "Frontal Lobe",
      "passage_type": "paragraph",
      "passage": "The frontal lobe occupies the anterior portion of each hemisphere, extending from the central sulcus posteriorly to the frontal pole anteriorly. It contains the primary motor cortex (precentral gyrus), which controls voluntary movement on the contralateral side of the body. The prefrontal cortex is responsible for executive functions including planning, working memory, impulse control, cognitive flexibility, and social judgment",
      "id": "BPSY-0020"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "brain-structure-lateralization.html",
      "chapter_title": "Brain Structure & Lateralization",
      "section": "Parietal Lobe",
      "passage_type": "paragraph",
      "passage": "The parietal lobe lies posterior to the central sulcus and is bounded inferiorly by the lateral sulcus. It contains the primary somatosensory cortex (postcentral gyrus), which processes touch, pressure, temperature, and proprioception from the contralateral body. The angular gyrus (Brodmann area 39) plays a key role in reading and arithmetic; damage can produce alexia and anomia",
      "id": "BPSY-0021"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "brain-structure-lateralization.html",
      "chapter_title": "Brain Structure & Lateralization",
      "section": "Temporal Lobe",
      "passage_type": "paragraph",
      "passage": "The temporal lobe is located beneath the lateral sulcus and contains the primary auditory cortex (Heschl's gyrus). It is essential for auditory processing, language comprehension, and memory formation (via the hippocampus)",
      "id": "BPSY-0022"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "brain-structure-lateralization.html",
      "chapter_title": "Brain Structure & Lateralization",
      "section": "Occipital Lobe",
      "passage_type": "paragraph",
      "passage": "The occipital lobe occupies the posterior pole of the brain and contains the primary visual cortex (V1, Brodmann area 17). It processes visual information from the contralateral visual field. Damage to V1 can produce cortical blindness, while damage to association areas can cause visual agnosia",
      "id": "BPSY-0023"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "brain-structure-lateralization.html",
      "chapter_title": "Brain Structure & Lateralization",
      "section": "Cortical Organization: Motor & Sensory Maps",
      "passage_type": "paragraph",
      "passage": "The motor and somatosensory cortices are organized somatotopically , meaning that adjacent body regions are represented in adjacent cortical regions. These representations are depicted by the cortical homunculus , a distorted figure in which body parts are sized in proportion to their cortical representation rather than their actual physical size",
      "id": "BPSY-0024"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "brain-structure-lateralization.html",
      "chapter_title": "Brain Structure & Lateralization",
      "section": "Cortical Organization: Motor & Sensory Maps",
      "passage_type": "paragraph",
      "passage": "The association areas constitute the majority of the cortex and integrate information across sensory modalities. The prefrontal association cortex is involved in executive functioning, the parietal-temporal-occipital association area integrates multisensory information, and the limbic association cortex is involved in emotion and memory",
      "id": "BPSY-0025"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "brain-structure-lateralization.html",
      "chapter_title": "Brain Structure & Lateralization",
      "section": "The Arcuate Fasciculus & Language Circuits",
      "passage_type": "paragraph",
      "passage": "The arcuate fasciculus is a white matter tract that connects Broca's area in the frontal lobe with Wernicke's area in the temporal lobe. This fiber bundle is essential for the repetition of spoken language and the transfer of linguistic information between comprehension and production centers",
      "id": "BPSY-0026"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "brain-structure-lateralization.html",
      "chapter_title": "Brain Structure & Lateralization",
      "section": "Hemispheric Lateralization & Split-Brain Research",
      "passage_type": "paragraph",
      "passage": "Hemispheric lateralization refers to the functional specialization of the two cerebral hemispheres. While both hemispheres contribute to most cognitive functions, certain abilities are predominantly associated with one hemisphere",
      "id": "BPSY-0027"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "brain-structure-lateralization.html",
      "chapter_title": "Brain Structure & Lateralization",
      "section": "Right Hemisphere Specialization",
      "passage_type": "paragraph",
      "passage": "The corpus callosum is the largest white matter commissure in the brain, containing approximately 200 million axons. It connects homologous regions of the left and right hemispheres, enabling interhemispheric communication and the integration of information processed in each hemisphere",
      "id": "BPSY-0028"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "brain-structure-lateralization.html",
      "chapter_title": "Brain Structure & Lateralization",
      "section": "Contralateral Control & Cerebral Dominance",
      "passage_type": "paragraph",
      "passage": "A fundamental principle of brain organization is contralateral control : each hemisphere primarily controls and receives sensory input from the opposite side of the body. Motor fibers cross at the medullary pyramids (pyramidal decussation), and most sensory pathways cross either at the brainstem or spinal cord level",
      "id": "BPSY-0029"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "brain-structure-lateralization.html",
      "chapter_title": "Brain Structure & Lateralization",
      "section": "Contralateral Control & Cerebral Dominance",
      "passage_type": "paragraph",
      "passage": "Cerebral dominance for language is overwhelmingly left-lateralized. Approximately 95% of right-handed individuals and 70% of left-handed individuals have left-hemisphere language dominance. The Wada test (intracarotid sodium amobarbital procedure) has historically been used to determine language lateralization prior to neurosurgery",
      "id": "BPSY-0030"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "brain-structure-lateralization.html",
      "chapter_title": "Brain Structure & Lateralization",
      "section": "Apraxia, Agnosia & Other Higher Cortical Deficits",
      "passage_type": "paragraph",
      "passage": "Damage to association cortices and their connections produces characteristic neuropsychological syndromes that are frequently tested on the EPPP",
      "id": "BPSY-0031"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "brain-structure-lateralization.html",
      "chapter_title": "Brain Structure & Lateralization",
      "section": "The Thalamus",
      "passage_type": "paragraph",
      "passage": "The thalamus is a large, egg-shaped structure sitting atop the brainstem at the center of the brain. It serves as the brain's primary sensory relay station, routing incoming sensory information to the appropriate cortical areas for processing",
      "id": "BPSY-0032"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "brain-structure-lateralization.html",
      "chapter_title": "Brain Structure & Lateralization",
      "section": "The Hypothalamus",
      "passage_type": "paragraph",
      "passage": "The hypothalamus is a small structure (approximately the size of an almond) located below the thalamus. Despite its small size, it is critical for maintaining homeostasis and regulating the endocrine system through its connection with the pituitary gland",
      "id": "BPSY-0033"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "brain-structure-lateralization.html",
      "chapter_title": "Brain Structure & Lateralization",
      "section": "The Limbic System",
      "passage_type": "paragraph",
      "passage": "The limbic system is a collection of interconnected structures surrounding the thalamus that mediate emotion, motivation, learning, and memory. While the exact boundaries are debated, the following structures are consistently included:",
      "id": "BPSY-0034"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "brain-structure-lateralization.html",
      "chapter_title": "Brain Structure & Lateralization",
      "section": "Hippocampus",
      "passage_type": "paragraph",
      "passage": "A seahorse-shaped structure in the medial temporal lobe that is essential for the consolidation of new declarative (explicit) memories — the transfer of information from short-term to long-term storage",
      "id": "BPSY-0035"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "brain-structure-lateralization.html",
      "chapter_title": "Brain Structure & Lateralization",
      "section": "Amygdala",
      "passage_type": "paragraph",
      "passage": "An almond-shaped structure anterior to the hippocampus, the amygdala is the brain's \"fear center\" and is critical for emotional processing, particularly fear conditioning and threat detection",
      "id": "BPSY-0036"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "brain-structure-lateralization.html",
      "chapter_title": "Brain Structure & Lateralization",
      "section": "Basal Ganglia",
      "passage_type": "paragraph",
      "passage": "The basal ganglia are a group of subcortical nuclei involved in the initiation, execution, and modulation of voluntary movement, as well as procedural learning and habit formation. A number of disorders have been linked to abnormalities in these structures, including Tourette's disorder, ADHD, and obsessive-compulsive disorder (OCD)",
      "id": "BPSY-0037"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "brain-structure-lateralization.html",
      "chapter_title": "Brain Structure & Lateralization",
      "section": "The Brainstem",
      "passage_type": "paragraph",
      "passage": "The brainstem connects the cerebral hemispheres to the spinal cord and controls vital autonomic functions. It consists of three major divisions, arranged from superior to inferior:",
      "id": "BPSY-0038"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "brain-structure-lateralization.html",
      "chapter_title": "Brain Structure & Lateralization",
      "section": "Medulla Oblongata",
      "passage_type": "paragraph",
      "passage": "The medulla oblongata is part of the hindbrain and controls vital autonomic functions. Damage to the medulla can result in death because it regulates breathing, heart rate, blood pressure, and digestive reflexes",
      "id": "BPSY-0039"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "brain-structure-lateralization.html",
      "chapter_title": "Brain Structure & Lateralization",
      "section": "The Cerebellum",
      "passage_type": "paragraph",
      "passage": "The cerebellum (\"little brain\") is located posterior to the brainstem and contains more neurons than the rest of the brain combined. Although comprising only 10% of brain volume, it contains approximately 50% of the brain's neurons",
      "id": "BPSY-0040"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "brain-structure-lateralization.html",
      "chapter_title": "Brain Structure & Lateralization",
      "section": "Reticular Activating System (RAS)",
      "passage_type": "paragraph",
      "passage": "The reticular activating system is a network of neurons extending through the brainstem core from the medulla to the midbrain. It plays a critical role in regulating consciousness, arousal, and the sleep-wake cycle",
      "id": "BPSY-0041"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "cerebral-cortex.html",
      "chapter_title": "Cerebral Cortex",
      "section": "Overview of the Cerebral Cortex",
      "passage_type": "definition",
      "passage": "Cerebral Cortex: The outermost layer of neural tissue of the cerebrum, composed primarily of gray matter (neuronal cell bodies). Its extensive folding (gyri = ridges; sulci = grooves; fissures = deep grooves) dramatically increases surface area, allowing greater computational capacity within the skull",
      "id": "BPSY-0042"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "cerebral-cortex.html",
      "chapter_title": "Cerebral Cortex",
      "section": "Prefrontal Cortex (PFC)",
      "passage_type": "definition",
      "passage": "Case of Phineas Gage (1848): A railroad worker who survived a tamping iron through his left frontal lobe. Although his intellect and language remained intact, his personality changed dramatically -- he became impulsive, irreverent, and unable to plan for the future. This case was pivotal in establishing the frontal lobe's role in personality and executive function",
      "id": "BPSY-0043"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "cerebral-cortex.html",
      "chapter_title": "Cerebral Cortex",
      "section": "Parietal Lobe Damage Syndromes",
      "passage_type": "clinical_note",
      "passage": "Clinical Significance: Hemispatial neglect is more common and severe after right hemisphere damage because the right parietal lobe attends to both sides of space, while the left parietal lobe primarily attends to the right side. When the right hemisphere is damaged, the left hemisphere cannot compensate for attention to the left side of space",
      "id": "BPSY-0044"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "cerebral-cortex.html",
      "chapter_title": "Cerebral Cortex",
      "section": "Two Visual Processing Streams",
      "passage_type": "example",
      "passage": "EPPP Application: Patient D.F. (Goodale & Milner, 1992) with ventral stream damage could not visually identify objects or describe their orientation but could accurately reach for and grasp them. This double dissociation between the two streams provided strong evidence for their functional independence",
      "id": "BPSY-0045"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "cerebral-cortex.html",
      "chapter_title": "Cerebral Cortex",
      "section": "Overview of the Cerebral Cortex",
      "passage_type": "paragraph",
      "passage": "The cerebral cortex is the thin, wrinkled outer layer of the cerebral hemispheres, approximately 2-4 mm thick, containing roughly 20 billion neurons. It is responsible for the highest-order cognitive functions including perception, voluntary movement, language, reasoning, and consciousness. The cortex is divided into four lobes in each hemisphere, each with specialized functions, as well as extensive association areas that integrate information across domains",
      "id": "BPSY-0046"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "cerebral-cortex.html",
      "chapter_title": "Cerebral Cortex",
      "section": "Frontal Lobe",
      "passage_type": "paragraph",
      "passage": "The frontal lobe is the largest cortical lobe, located anterior to the central sulcus and superior to the lateral (Sylvian) fissure. It is involved in motor control, executive functions, personality, and expressive language",
      "id": "BPSY-0047"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "cerebral-cortex.html",
      "chapter_title": "Cerebral Cortex",
      "section": "Primary Motor Cortex (Precentral Gyrus)",
      "passage_type": "paragraph",
      "passage": "Located immediately anterior to the central sulcus, the primary motor cortex controls voluntary movements of the contralateral (opposite) side of the body. The body is represented topographically in a pattern known as the motor homunculus , with disproportionately large areas devoted to the hands, fingers, and face, reflecting the fine motor control required for these regions",
      "id": "BPSY-0048"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "cerebral-cortex.html",
      "chapter_title": "Cerebral Cortex",
      "section": "Prefrontal Cortex (PFC)",
      "passage_type": "paragraph",
      "passage": "The anterior portion of the frontal lobe, the prefrontal cortex , is the seat of executive functions and is the last cortical region to fully myelinate (not until the mid-20s):",
      "id": "BPSY-0049"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "cerebral-cortex.html",
      "chapter_title": "Cerebral Cortex",
      "section": "Broca's Area (Inferior Frontal Gyrus, Typically Left Hemisphere)",
      "passage_type": "paragraph",
      "passage": "Broca's area (Brodmann areas 44 and 45) is essential for speech production and language expression. Damage results in Broca's aphasia (expressive/nonfluent aphasia) :",
      "id": "BPSY-0050"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "cerebral-cortex.html",
      "chapter_title": "Cerebral Cortex",
      "section": "Premotor and Supplementary Motor Areas",
      "passage_type": "paragraph",
      "passage": "Located anterior to the primary motor cortex, these regions are involved in planning and coordinating complex movements, motor sequencing, and motor learning. The supplementary motor area (SMA) is particularly active during internally generated (self-initiated) movements",
      "id": "BPSY-0051"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "cerebral-cortex.html",
      "chapter_title": "Cerebral Cortex",
      "section": "Parietal Lobe",
      "passage_type": "paragraph",
      "passage": "The parietal lobe is located posterior to the central sulcus and superior to the temporal lobe. It processes somatosensory information and integrates sensory data for spatial awareness and attention",
      "id": "BPSY-0052"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "cerebral-cortex.html",
      "chapter_title": "Cerebral Cortex",
      "section": "Primary Somatosensory Cortex (Postcentral Gyrus)",
      "passage_type": "paragraph",
      "passage": "Located immediately posterior to the central sulcus, the primary somatosensory cortex receives and processes tactile information (touch, pressure, temperature, pain) from the contralateral side of the body. Like the motor cortex, it is organized as a sensory homunculus , with the largest representations for highly sensitive regions such as the lips, tongue, and fingertips",
      "id": "BPSY-0053"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "cerebral-cortex.html",
      "chapter_title": "Cerebral Cortex",
      "section": "Posterior Parietal Cortex",
      "passage_type": "paragraph",
      "passage": "The posterior parietal cortex integrates sensory information to create spatial maps of the body and the environment. It is crucial for:",
      "id": "BPSY-0054"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "cerebral-cortex.html",
      "chapter_title": "Cerebral Cortex",
      "section": "Temporal Lobe",
      "passage_type": "paragraph",
      "passage": "The temporal lobe is located below the lateral fissure and is involved in auditory processing, language comprehension, memory, and object recognition",
      "id": "BPSY-0055"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "cerebral-cortex.html",
      "chapter_title": "Cerebral Cortex",
      "section": "Primary Auditory Cortex (Heschl's Gyrus)",
      "passage_type": "paragraph",
      "passage": "Located on the superior temporal gyrus, the primary auditory cortex receives and processes auditory information. It is organized tonotopically, meaning different frequencies are processed in different locations",
      "id": "BPSY-0056"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "cerebral-cortex.html",
      "chapter_title": "Cerebral Cortex",
      "section": "Wernicke's Area (Posterior Superior Temporal Gyrus, Typically Left Hemisphere)",
      "passage_type": "paragraph",
      "passage": "Wernicke's area (Brodmann area 22) is critical for language comprehension. Damage results in Wernicke's aphasia (receptive/fluent aphasia) :",
      "id": "BPSY-0057"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "cerebral-cortex.html",
      "chapter_title": "Cerebral Cortex",
      "section": "Medial Temporal Lobe",
      "passage_type": "paragraph",
      "passage": "The medial temporal lobe, including the hippocampus, parahippocampal gyrus, and entorhinal cortex, is essential for the formation of new declarative (explicit) memories. Bilateral damage produces severe anterograde amnesia (see Memory & Forgetting chapter)",
      "id": "BPSY-0058"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "cerebral-cortex.html",
      "chapter_title": "Cerebral Cortex",
      "section": "Inferotemporal Cortex",
      "passage_type": "paragraph",
      "passage": "The ventral surface of the temporal lobe is critical for visual object recognition (the \"what\" pathway). The fusiform face area (FFA) within this region is specialized for face recognition. Damage can produce prosopagnosia (inability to recognize faces)",
      "id": "BPSY-0059"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "cerebral-cortex.html",
      "chapter_title": "Cerebral Cortex",
      "section": "Primary Visual Cortex (V1, Striate Cortex)",
      "passage_type": "paragraph",
      "passage": "Located along the calcarine fissure, V1 receives direct input from the lateral geniculate nucleus (LGN) of the thalamus. It is organized retinotopically, meaning adjacent areas of the visual field are processed in adjacent cortical areas. The fovea (center of gaze) has a disproportionately large cortical representation",
      "id": "BPSY-0060"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "cerebral-cortex.html",
      "chapter_title": "Cerebral Cortex",
      "section": "Lateralization and Hemispheric Specialization",
      "passage_type": "paragraph",
      "passage": "Lateralization refers to the functional specialization of the two cerebral hemispheres. While both hemispheres contribute to most tasks, certain functions are preferentially processed by one hemisphere",
      "id": "BPSY-0061"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "cerebral-cortex.html",
      "chapter_title": "Cerebral Cortex",
      "section": "Split-Brain Research (Sperry & Gazzaniga)",
      "passage_type": "paragraph",
      "passage": "Roger Sperry (Nobel Prize, 1981) and Michael Gazzaniga studied patients who had undergone corpus callosotomy (severing of the corpus callosum) for intractable epilepsy. Their experiments with lateralized visual presentations revealed:",
      "id": "BPSY-0062"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "cerebral-cortex.html",
      "chapter_title": "Cerebral Cortex",
      "section": "The Corpus Callosum",
      "passage_type": "paragraph",
      "passage": "The corpus callosum is the largest commissure (white matter tract) connecting the two hemispheres, containing approximately 200 million axons. It enables interhemispheric communication and coordinated bilateral activity. Complete agenesis (absence) of the corpus callosum can occur congenitally but often produces surprisingly mild deficits due to compensatory development of alternative pathways",
      "id": "BPSY-0063"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "cerebral-cortex.html",
      "chapter_title": "Cerebral Cortex",
      "section": "Association Areas",
      "passage_type": "paragraph",
      "passage": "Association areas comprise the majority of the cortical surface and integrate information from multiple sensory modalities and motor systems. They are responsible for higher-order cognitive functions:",
      "id": "BPSY-0064"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "cerebral-cortex.html",
      "chapter_title": "Cerebral Cortex",
      "section": "Arcuate Fasciculus",
      "passage_type": "paragraph",
      "passage": "The arcuate fasciculus is a white matter tract connecting Broca's area and Wernicke's area. Damage to this tract produces conduction aphasia , characterized by fluent speech, intact comprehension, but severely impaired repetition along with frequent phonemic paraphasias",
      "id": "BPSY-0065"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "cerebrovascular-injury.html",
      "chapter_title": "Cerebrovascular Disease, Brain Injury & Seizures",
      "section": "Stroke: Ischemic vs. Hemorrhagic",
      "passage_type": "definition",
      "passage": "Middle Cerebral Artery (MCA) Syndrome: The MCA is the most commonly affected artery in ischemic stroke. Left MCA stroke produces: contralateral (right-sided) hemiparesis and sensory loss (face and arm > leg), Broca's or Wernicke's aphasia (depending on branch affected), and potentially global aphasia. Right MCA stroke produces: contralateral hemiparesis, left hemispatial neglect, anosognosia (unawareness of deficit), and constructional apraxia. The EPPP frequently tests the lateralized deficits associated with MCA stroke",
      "id": "BPSY-0066"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "cerebrovascular-injury.html",
      "chapter_title": "Cerebrovascular Disease, Brain Injury & Seizures",
      "section": "Traumatic Brain Injury (TBI)",
      "passage_type": "definition",
      "passage": "Coup-Contrecoup Injury: A coup injury occurs at the site of impact, while a contrecoup injury occurs at the opposite side of the brain (due to the brain rebounding against the skull). In falls, the frontal and temporal lobes are particularly vulnerable because they contact the rough bony surfaces of the anterior and middle cranial fossae. This explains why personality changes and memory impairment are common after TBI even when the primary impact is elsewhere",
      "id": "BPSY-0067"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "cerebrovascular-injury.html",
      "chapter_title": "Cerebrovascular Disease, Brain Injury & Seizures",
      "section": "Aphasia Syndromes & Neglect",
      "passage_type": "definition",
      "passage": "Hemispatial Neglect: Hemispatial neglect (typically left-sided) results from right parietal lobe damage and involves a failure to attend to, report, or orient toward stimuli in the contralesional (left) space. Patients may eat food from only the right side of their plate, dress only the right side of their body, or draw only the right half of a clock. This is not a sensory deficit but an attentional one — the visual system can detect the stimuli, but the attentional system fails to process them",
      "id": "BPSY-0068"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "cerebrovascular-injury.html",
      "chapter_title": "Cerebrovascular Disease, Brain Injury & Seizures",
      "section": "Stroke: Ischemic vs. Hemorrhagic",
      "passage_type": "paragraph",
      "passage": "A stroke (cerebrovascular accident, CVA) occurs when blood flow to the brain is disrupted, causing neuronal death. Stroke is a leading cause of long-term disability and the fifth leading cause of death in the United States",
      "id": "BPSY-0069"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "cerebrovascular-injury.html",
      "chapter_title": "Cerebrovascular Disease, Brain Injury & Seizures",
      "section": "Stroke: Ischemic vs. Hemorrhagic",
      "passage_type": "paragraph",
      "passage": "A transient ischemic attack (TIA) produces temporary stroke-like symptoms that resolve completely within 24 hours (typically within minutes). TIAs are a major warning sign — they significantly increase the risk of subsequent stroke and require urgent evaluation",
      "id": "BPSY-0070"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "cerebrovascular-injury.html",
      "chapter_title": "Cerebrovascular Disease, Brain Injury & Seizures",
      "section": "Traumatic Brain Injury (TBI)",
      "passage_type": "paragraph",
      "passage": "Traumatic brain injury results from an external mechanical force applied to the head. TBIs are classified as mild (concussion), moderate, or severe, based on the Glasgow Coma Scale (GCS) score, duration of loss of consciousness, and duration of post-traumatic amnesia",
      "id": "BPSY-0071"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "cerebrovascular-injury.html",
      "chapter_title": "Cerebrovascular Disease, Brain Injury & Seizures",
      "section": "Traumatic Brain Injury (TBI)",
      "passage_type": "paragraph",
      "passage": "Diffuse axonal injury (DAI) results from rotational acceleration-deceleration forces that shear axons throughout the brain. DAI is the most common cause of prolonged coma and persistent vegetative state following TBI. The Glasgow Coma Scale (GCS) assesses eye opening (1-4), verbal response (1-5), and motor response (1-6), yielding scores from 3 (deep coma) to 15 (fully alert). GCS scores classify TBI as mild (13-15), moderate (9-12), or severe (3-8)",
      "id": "BPSY-0072"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "cerebrovascular-injury.html",
      "chapter_title": "Cerebrovascular Disease, Brain Injury & Seizures",
      "section": "Epilepsy & Seizure Disorders",
      "passage_type": "paragraph",
      "passage": "Epilepsy is a neurological disorder characterized by recurrent, unprovoked seizures resulting from abnormal, excessive, or synchronous neuronal activity. Seizures are classified as generalized (involving both hemispheres from onset) or focal/partial (beginning in a specific brain region)",
      "id": "BPSY-0073"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "emotion-arousal.html",
      "chapter_title": "Emotion Theories, Arousal & the ANS",
      "section": "The Six Universal Emotions",
      "passage_type": "definition",
      "passage": "Cross-Cultural Evidence: Ekman and Friesen (1971) studied the Fore people of Papua New Guinea , a preliterate culture with minimal exposure to Western media. Participants were able to correctly match facial expressions to emotion-provoking stories at rates significantly above chance, providing strong evidence that basic emotional expressions are not culturally learned but are innate, universal products of human evolution. These findings have been replicated across dozens of cultures worldwide",
      "id": "BPSY-0074"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "emotion-arousal.html",
      "chapter_title": "Emotion Theories, Arousal & the ANS",
      "section": "The HPA Axis & the General Adaptation Syndrome",
      "passage_type": "clinical_note",
      "passage": "Cortisol & Cognition: Chronic elevation of cortisol has deleterious effects on the brain, particularly the hippocampus (which has a high density of glucocorticoid receptors). Chronic stress-related cortisol elevation is associated with hippocampal volume reduction, impaired declarative memory, and increased risk for depression. This is clinically relevant in Cushing's syndrome (cortisol excess) and is one mechanism linking chronic stress to cognitive decline in older adults",
      "id": "BPSY-0075"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "emotion-arousal.html",
      "chapter_title": "Emotion Theories, Arousal & the ANS",
      "section": "Yerkes-Dodson Law",
      "passage_type": "example",
      "passage": "EPPP Application: A professional basketball player may perform free throws better under moderate game-day arousal than during a calm practice session (simple, well-practiced task benefits from moderate-to-high arousal). However, a student learning a new, complex statistical technique would perform best under conditions of low-to-moderate arousal. High test anxiety (excessive arousal) would impair performance on the complex task. This distinction is frequently tested",
      "id": "BPSY-0076"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "emotion-arousal.html",
      "chapter_title": "Emotion Theories, Arousal & the ANS",
      "section": "Expanded List & Dimensional Models",
      "passage_type": "example",
      "passage": "EPPP Application: An exam question might describe a researcher studying emotional recognition across cultures and ask which theory is supported. If the question emphasizes that people from isolated cultures recognize the same facial expressions, the answer is Ekman's basic emotion theory. If the question describes emotions mapped along axes of pleasantness and intensity, the answer involves the dimensional/circumplex model. Note also that bilateral amygdala damage impairs recognition of fear expressions specifically (as in Patient S.M.), connecting Ekman's work to neuroanatomy",
      "id": "BPSY-0077"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "emotion-arousal.html",
      "chapter_title": "Emotion Theories, Arousal & the ANS",
      "section": "Classic Theories of Emotion",
      "passage_type": "paragraph",
      "passage": "The relationship between physiological arousal, cognitive appraisal, and subjective emotional experience has been debated for over a century. Four major theories of emotion are heavily tested on the EPPP, and understanding their differences is essential",
      "id": "BPSY-0078"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "emotion-arousal.html",
      "chapter_title": "Emotion Theories, Arousal & the ANS",
      "section": "Facial Feedback Hypothesis",
      "passage_type": "paragraph",
      "passage": "The facial feedback hypothesis  proposes that facial expressions are not merely the result of emotions but can actually influence emotional experience. When individuals are asked to hold a pen between their teeth (which mimics a smile), they rate cartoons as funnier compared to when the pen is held between their lips (which inhibits smiling). This provides partial support for the James-Lange theory — bodily states (including facial expressions) can modulate subjective emotional experience",
      "id": "BPSY-0079"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "emotion-arousal.html",
      "chapter_title": "Emotion Theories, Arousal & the ANS",
      "section": "Yerkes-Dodson Law",
      "passage_type": "paragraph",
      "passage": "The Yerkes-Dodson law describes the relationship between arousal and performance as an inverted-U function. Performance on any task improves with increasing arousal up to an optimal point, after which further increases in arousal lead to performance deterioration. The critical nuance for the EPPP is that the optimal arousal level depends on task complexity:",
      "id": "BPSY-0080"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "emotion-arousal.html",
      "chapter_title": "Emotion Theories, Arousal & the ANS",
      "section": "Ekman's Basic Emotions & Universal Facial Expressions",
      "passage_type": "paragraph",
      "passage": "While the theories above address the mechanism of emotional experience, Paul Ekman's research focused on the question: what emotions exist and how universal are they? Ekman's program of cross-cultural research, spanning decades, established that certain emotions are biologically based and universally recognized — a finding with major implications for both clinical assessment and forensic psychology",
      "id": "BPSY-0081"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "emotion-arousal.html",
      "chapter_title": "Emotion Theories, Arousal & the ANS",
      "section": "The Six Universal Emotions",
      "passage_type": "paragraph",
      "passage": "Ekman (1972, 1992) identified six basic emotions that are universally produced and recognized across cultures through facial expressions:",
      "id": "BPSY-0082"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "emotion-arousal.html",
      "chapter_title": "Emotion Theories, Arousal & the ANS",
      "section": "The Facial Action Coding System (FACS)",
      "passage_type": "paragraph",
      "passage": "Ekman and Friesen (1978) developed the Facial Action Coding System (FACS) , an anatomically based system that identifies and codes every visually distinguishable facial movement in terms of action units (AUs) — individual muscle movements. FACS allows researchers and clinicians to objectively measure facial expressions without relying on subjective judgment. For example, a genuine (Duchenne) smile involves AU 6 (cheek raiser) + AU 12 (lip corner puller), while a social smile involves only AU 12",
      "id": "BPSY-0083"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "emotion-arousal.html",
      "chapter_title": "Emotion Theories, Arousal & the ANS",
      "section": "Expanded List & Dimensional Models",
      "passage_type": "paragraph",
      "passage": "Ekman later expanded his list of basic emotions to include contempt (the only additional emotion with a universally recognized facial expression), as well as self-conscious emotions such as embarrassment , shame , guilt , and pride , and other states like amusement , awe , and excitement . However, these expanded emotions lack the same degree of cross-cultural evidence for unique, universally recognized facial expressions",
      "id": "BPSY-0084"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "emotion-arousal.html",
      "chapter_title": "Emotion Theories, Arousal & the ANS",
      "section": "The Autonomic Nervous System",
      "passage_type": "paragraph",
      "passage": "The autonomic nervous system (ANS) regulates involuntary bodily functions and is divided into two complementary branches that work in dynamic balance",
      "id": "BPSY-0085"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "emotion-arousal.html",
      "chapter_title": "Emotion Theories, Arousal & the ANS",
      "section": "The Limbic System & Emotional Brain",
      "passage_type": "paragraph",
      "passage": "The limbic system is a collection of interconnected structures involved in emotion, motivation, memory, and olfaction. Key structures for the EPPP include:",
      "id": "BPSY-0086"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "emotion-arousal.html",
      "chapter_title": "Emotion Theories, Arousal & the ANS",
      "section": "The HPA Axis & the General Adaptation Syndrome",
      "passage_type": "paragraph",
      "passage": "The hypothalamic-pituitary-adrenal (HPA) axis is the primary neuroendocrine stress response system. When a stressor is perceived, the hypothalamus releases corticotropin-releasing hormone (CRH) , which stimulates the anterior pituitary to release adrenocorticotropic hormone (ACTH) , which in turn stimulates the adrenal cortex to release cortisol . Cortisol mobilizes energy, suppresses inflammation, and inhibits non-essential functions. Negative feedback from cortisol normally shuts down the axis, but chronic stress can dysregulate this feedback loop",
      "id": "BPSY-0087"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "emotion-stress.html",
      "chapter_title": "Emotion & Stress",
      "section": "Overview of Emotion and Stress",
      "passage_type": "definition",
      "passage": "Emotion: A complex psychological state involving three distinct components: a subjective experience (feeling), a physiological response (autonomic arousal), and a behavioral or expressive response (facial expression, action tendency). Theories differ on the causal ordering of these components",
      "id": "BPSY-0088"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "emotion-stress.html",
      "chapter_title": "Emotion & Stress",
      "section": "James-Lange Theory (1884/1885)",
      "passage_type": "definition",
      "passage": "Sequence: Stimulus --> Physiological arousal/bodily response --> Perception of arousal --> Emotional experience. \"We feel sorry because we cry, angry because we strike, afraid because we tremble\"",
      "id": "BPSY-0089"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "emotion-stress.html",
      "chapter_title": "Emotion & Stress",
      "section": "Cannon-Bard Theory (1927)",
      "passage_type": "definition",
      "passage": "Sequence: Stimulus --> Thalamus sends signals simultaneously to the cortex (emotional experience) and the body (physiological arousal). The two processes are parallel and independent",
      "id": "BPSY-0090"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "emotion-stress.html",
      "chapter_title": "Emotion & Stress",
      "section": "Schachter-Singer Two-Factor Theory (1962)",
      "passage_type": "definition",
      "passage": "Sequence: Stimulus --> Physiological arousal --> Cognitive interpretation of the arousal based on context --> Emotional experience",
      "id": "BPSY-0091"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "emotion-stress.html",
      "chapter_title": "Emotion & Stress",
      "section": "Effects of Cortisol",
      "passage_type": "definition",
      "passage": "Cortisol: The primary glucocorticoid hormone released by the adrenal cortex in response to ACTH. It follows a diurnal rhythm (highest in the morning, lowest at night) and is a key biomarker of HPA axis function. Chronically elevated cortisol is associated with depression, PTSD, metabolic syndrome, and hippocampal damage",
      "id": "BPSY-0092"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "emotion-stress.html",
      "chapter_title": "Emotion & Stress",
      "section": "Parasympathetic Nervous System (PNS)",
      "passage_type": "clinical_note",
      "passage": "Clinical Significance: Polyvagal theory  proposes that the vagus nerve has two branches: the ventral vagal complex (promotes social engagement and calm states) and the dorsal vagal complex (triggers immobilization/shutdown during overwhelming threat). This framework is increasingly used in trauma therapy",
      "id": "BPSY-0093"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "emotion-stress.html",
      "chapter_title": "Emotion & Stress",
      "section": "Allostatic Load",
      "passage_type": "clinical_note",
      "passage": "Clinical Significance: Allostatic load provides a framework for understanding health disparities. Chronic exposure to discrimination, poverty, and adversity produces elevated allostatic load, contributing to poorer health outcomes among marginalized populations. This concept bridges biological psychology and health psychology on the EPPP",
      "id": "BPSY-0094"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "emotion-stress.html",
      "chapter_title": "Emotion & Stress",
      "section": "Stage 3: Exhaustion",
      "passage_type": "example",
      "passage": "EPPP Application: Selye distinguished between eustress (positive, motivating stress) and distress (negative, harmful stress). He also noted that the GAS response is nonspecific -- the body responds similarly regardless of the type of stressor",
      "id": "BPSY-0095"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "emotion-stress.html",
      "chapter_title": "Emotion & Stress",
      "section": "Overview of Emotion and Stress",
      "passage_type": "paragraph",
      "passage": "Emotion and stress are among the most clinically relevant topics in biological psychology. Understanding the biological mechanisms underlying emotional experience and the stress response is essential for EPPP preparation, as these processes are implicated in numerous psychological disorders, health conditions, and therapeutic interventions",
      "id": "BPSY-0096"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "emotion-stress.html",
      "chapter_title": "Emotion & Stress",
      "section": "Theories of Emotion",
      "passage_type": "paragraph",
      "passage": "Several major theories attempt to explain the relationship between physiological arousal, cognitive appraisal, and subjective emotional experience. These theories are frequently tested on the EPPP",
      "id": "BPSY-0097"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "emotion-stress.html",
      "chapter_title": "Emotion & Stress",
      "section": "James-Lange Theory (1884/1885)",
      "passage_type": "paragraph",
      "passage": "William James and Carl Lange independently proposed that emotions result from the perception of bodily changes . According to this theory, a stimulus triggers a physiological response, and the conscious experience of emotion follows from the perception of that response",
      "id": "BPSY-0098"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "emotion-stress.html",
      "chapter_title": "Emotion & Stress",
      "section": "Cannon-Bard Theory (1927)",
      "passage_type": "paragraph",
      "passage": "Walter Cannon and Philip Bard proposed that emotional experience and physiological arousal occur simultaneously and independently , both triggered by the thalamus in response to an emotion-provoking stimulus",
      "id": "BPSY-0099"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "emotion-stress.html",
      "chapter_title": "Emotion & Stress",
      "section": "Schachter-Singer Two-Factor Theory (1962)",
      "passage_type": "paragraph",
      "passage": "Stanley Schachter and Jerome Singer proposed that emotion requires both physiological arousal AND cognitive interpretation (labeling) of that arousal . Arousal provides the intensity of the emotion, while cognition determines which emotion is experienced",
      "id": "BPSY-0100"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "emotion-stress.html",
      "chapter_title": "Emotion & Stress",
      "section": "Other Important Emotion Theories",
      "passage_type": "paragraph",
      "passage": "Richard Lazarus argued that cognitive appraisal is a necessary precondition for emotion . We first evaluate whether a stimulus is relevant and whether we have the resources to cope, and this appraisal determines both the emotion and the physiological response",
      "id": "BPSY-0101"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "emotion-stress.html",
      "chapter_title": "Emotion & Stress",
      "section": "Other Important Emotion Theories",
      "passage_type": "paragraph",
      "passage": "Robert Zajonc countered Lazarus by arguing that emotional reactions can occur before and independent of cognition . Simple emotional preferences (e.g., the mere exposure effect) can occur without conscious cognitive processing",
      "id": "BPSY-0102"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "emotion-stress.html",
      "chapter_title": "Emotion & Stress",
      "section": "The Autonomic Nervous System and Emotion",
      "passage_type": "paragraph",
      "passage": "The autonomic nervous system (ANS) is the division of the peripheral nervous system that controls involuntary bodily functions and mediates the physiological component of emotional responses",
      "id": "BPSY-0103"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "emotion-stress.html",
      "chapter_title": "Emotion & Stress",
      "section": "The Stress Response: HPA Axis",
      "passage_type": "paragraph",
      "passage": "The hypothalamic-pituitary-adrenal (HPA) axis is the primary neuroendocrine system that mediates the body's response to stress",
      "id": "BPSY-0104"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "emotion-stress.html",
      "chapter_title": "Emotion & Stress",
      "section": "Selye's General Adaptation Syndrome (GAS)",
      "passage_type": "paragraph",
      "passage": "Hans Selye (1936, 1956) described the General Adaptation Syndrome , a three-stage model of the body's response to prolonged stress:",
      "id": "BPSY-0105"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "emotion-stress.html",
      "chapter_title": "Emotion & Stress",
      "section": "Stage 1: Alarm Reaction",
      "passage_type": "paragraph",
      "passage": "The body's initial fight-or-flight response to a stressor. The sympathetic nervous system is activated, releasing catecholamines (epinephrine, norepinephrine). Cortisol levels begin to rise. Resistance to stress temporarily drops below normal",
      "id": "BPSY-0106"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "emotion-stress.html",
      "chapter_title": "Emotion & Stress",
      "section": "Stage 2: Resistance (Adaptation)",
      "passage_type": "paragraph",
      "passage": "The body attempts to adapt to the continued presence of the stressor. Cortisol levels remain elevated but the body achieves a new homeostatic balance. Parasympathetic activity partially counterbalances sympathetic arousal. The individual appears to be coping but physiological resources are being depleted",
      "id": "BPSY-0107"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "emotion-stress.html",
      "chapter_title": "Emotion & Stress",
      "section": "Stage 3: Exhaustion",
      "passage_type": "paragraph",
      "passage": "Prolonged stress depletes the body's adaptive resources. The immune system becomes compromised, vulnerability to illness increases dramatically, and organ systems may begin to fail. This stage can lead to \"diseases of adaptation\" including cardiovascular disease, gastrointestinal disorders, and immune dysfunction",
      "id": "BPSY-0108"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "emotion-stress.html",
      "chapter_title": "Emotion & Stress",
      "section": "Allostatic Load",
      "passage_type": "paragraph",
      "passage": "Allostatic load (McEwen, 1998) refers to the cumulative physiological wear and tear on the body resulting from chronic exposure to stress hormones and repeated activation of the stress response. Unlike acute stress (which is adaptive), chronic stress overloads the system",
      "id": "BPSY-0109"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "emotion-stress.html",
      "chapter_title": "Emotion & Stress",
      "section": "Psychoneuroimmunology (PNI)",
      "passage_type": "paragraph",
      "passage": "Psychoneuroimmunology is the interdisciplinary field studying the interactions among psychological processes, the nervous system, and the immune system",
      "id": "BPSY-0110"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "emotion-stress.html",
      "chapter_title": "Emotion & Stress",
      "section": "Fear",
      "passage_type": "paragraph",
      "passage": "The amygdala is the central structure for fear processing. Fear conditioning involves pairing a neutral stimulus (CS) with an aversive stimulus (US), resulting in the CS eliciting a fear response. The amygdala mediates both the acquisition and expression of conditioned fear, while the prefrontal cortex (particularly the ventromedial PFC) is involved in fear extinction",
      "id": "BPSY-0111"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "emotion-stress.html",
      "chapter_title": "Emotion & Stress",
      "section": "Anger and Aggression",
      "passage_type": "paragraph",
      "passage": "The neural circuitry of aggression involves the amygdala, hypothalamus (particularly the ventromedial hypothalamus), and the orbitofrontal cortex (which provides top-down inhibitory control). Low serotonin levels are consistently associated with increased impulsive aggression",
      "id": "BPSY-0112"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "emotion-stress.html",
      "chapter_title": "Emotion & Stress",
      "section": "Reward and Pleasure",
      "passage_type": "paragraph",
      "passage": "The mesolimbic dopamine pathway (VTA to nucleus accumbens) is the brain's primary reward circuit. Dopamine release in the nucleus accumbens is associated with reward anticipation and motivation rather than pleasure itself. The opioid system is more directly linked to hedonic \"liking.\"",
      "id": "BPSY-0113"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "endocrine-neuroimaging.html",
      "chapter_title": "Endocrine Conditions, Neuroimaging & Diagnostics",
      "section": "Structural Neuroimaging: CT & MRI",
      "passage_type": "definition",
      "passage": "Key MRI Variants: Diffusion-weighted imaging (DWI) detects early ischemic stroke within minutes (before CT shows changes), making it the gold standard for acute stroke diagnosis. Diffusion tensor imaging (DTI) maps white matter tracts by tracking water molecule diffusion along axon bundles (tractography), used to assess traumatic axonal injury and white matter connectivity. FLAIR (Fluid-Attenuated Inversion Recovery) suppresses cerebrospinal fluid signal, making periventricular white matter lesions (as in MS) more visible",
      "id": "BPSY-0114"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "endocrine-neuroimaging.html",
      "chapter_title": "Endocrine Conditions, Neuroimaging & Diagnostics",
      "section": "The Wada Test (Intracarotid Amobarbital Procedure)",
      "passage_type": "definition",
      "passage": "Wada Test: The Wada test involves injecting a barbiturate (sodium amobarbital) into one internal carotid artery at a time, temporarily anesthetizing one hemisphere. While one hemisphere is \"offline,\" the patient is tested for language and memory functions to determine hemispheric dominance. Historically used before epilepsy surgery to identify the language-dominant hemisphere and assess whether the contralateral hemisphere can support memory after temporal lobectomy. Increasingly being replaced by fMRI for language lateralization, though Wada remains important for memory adequacy testing",
      "id": "BPSY-0115"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "endocrine-neuroimaging.html",
      "chapter_title": "Endocrine Conditions, Neuroimaging & Diagnostics",
      "section": "Thyroid Disorders & Psychiatric Manifestations",
      "passage_type": "clinical_note",
      "passage": "Clinical Pearl — Thyroid Screening: Thyroid dysfunction is one of the most common medical mimics of psychiatric disorders. The EPPP tests knowledge that thyroid function should be evaluated (via TSH and free T4 levels) whenever a patient presents with new-onset depression, anxiety, or cognitive complaints, particularly in women over 40, postpartum women, and elderly patients. Congenital hypothyroidism (cretinism), if untreated, causes severe intellectual disability, emphasizing the critical role of thyroid hormone in brain development",
      "id": "BPSY-0116"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "endocrine-neuroimaging.html",
      "chapter_title": "Endocrine Conditions, Neuroimaging & Diagnostics",
      "section": "The Endocrine System: Overview & the Hypothalamic-Pituitary Axis",
      "passage_type": "paragraph",
      "passage": "The endocrine system communicates via hormones secreted into the bloodstream by glands. Unlike the rapid electrochemical signaling of the nervous system, endocrine signaling is slower but produces longer-lasting and more widespread effects. For the EPPP, the critical concept is the tight integration between the nervous and endocrine systems, particularly through the hypothalamic-pituitary axis",
      "id": "BPSY-0117"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "endocrine-neuroimaging.html",
      "chapter_title": "Endocrine Conditions, Neuroimaging & Diagnostics",
      "section": "The Endocrine System: Overview & the Hypothalamic-Pituitary Axis",
      "passage_type": "paragraph",
      "passage": "Endocrine regulation relies on negative feedback loops : when circulating hormone levels rise above a set point, the hypothalamus and pituitary reduce stimulatory signals. This is analogous to a thermostat. Disruptions to feedback loops produce the clinical conditions frequently tested on the EPPP",
      "id": "BPSY-0118"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "endocrine-neuroimaging.html",
      "chapter_title": "Endocrine Conditions, Neuroimaging & Diagnostics",
      "section": "Thyroid Disorders & Psychiatric Manifestations",
      "passage_type": "paragraph",
      "passage": "The thyroid gland produces thyroxine (T4) and triiodothyronine (T3), hormones that regulate metabolism, energy, and brain development. The hypothalamic-pituitary-thyroid (HPT) axis controls thyroid function: the hypothalamus releases TRH, which stimulates TSH from the anterior pituitary, which stimulates T3/T4 release from the thyroid",
      "id": "BPSY-0119"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "endocrine-neuroimaging.html",
      "chapter_title": "Endocrine Conditions, Neuroimaging & Diagnostics",
      "section": "Thyroid Disorders & Psychiatric Manifestations",
      "passage_type": "paragraph",
      "passage": "Hashimoto's thyroiditis is the most common cause of hypothyroidism in iodine-sufficient areas and is an autoimmune condition. Graves' disease is the most common cause of hyperthyroidism and is also autoimmune, caused by thyroid-stimulating antibodies that mimic TSH. Lithium, a first-line mood stabilizer for bipolar disorder, can cause hypothyroidism in 20-30% of patients, requiring regular thyroid monitoring",
      "id": "BPSY-0120"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "endocrine-neuroimaging.html",
      "chapter_title": "Endocrine Conditions, Neuroimaging & Diagnostics",
      "section": "Adrenal Gland Disorders",
      "passage_type": "paragraph",
      "passage": "The adrenal glands sit atop each kidney and contain two functionally distinct regions. The adrenal medulla (inner portion) is part of the sympathetic nervous system and releases epinephrine and norepinephrine during the fight-or-flight response. The adrenal cortex (outer portion) produces corticosteroids: glucocorticoids (cortisol), mineralocorticoids (aldosterone), and androgens",
      "id": "BPSY-0121"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "endocrine-neuroimaging.html",
      "chapter_title": "Endocrine Conditions, Neuroimaging & Diagnostics",
      "section": "Sex Hormones & Behavioral Effects",
      "passage_type": "paragraph",
      "passage": "Sex hormones (estrogen, progesterone, testosterone) are produced primarily by the gonads and also by the adrenal cortex. These hormones have significant effects on brain function and behavior throughout the lifespan",
      "id": "BPSY-0122"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "endocrine-neuroimaging.html",
      "chapter_title": "Endocrine Conditions, Neuroimaging & Diagnostics",
      "section": "Structural Neuroimaging: CT & MRI",
      "passage_type": "paragraph",
      "passage": "Neuroimaging techniques are categorized as structural (visualizing brain anatomy) or functional (measuring brain activity). The EPPP tests knowledge of when each modality is indicated and what it reveals",
      "id": "BPSY-0123"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "endocrine-neuroimaging.html",
      "chapter_title": "Endocrine Conditions, Neuroimaging & Diagnostics",
      "section": "Functional Neuroimaging: fMRI, PET & SPECT",
      "passage_type": "paragraph",
      "passage": "Functional neuroimaging captures brain activity in real time (or near-real time), measuring metabolic or hemodynamic changes associated with neural activity",
      "id": "BPSY-0124"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "endocrine-neuroimaging.html",
      "chapter_title": "Endocrine Conditions, Neuroimaging & Diagnostics",
      "section": "Electrophysiological Methods: EEG & Evoked Potentials",
      "passage_type": "paragraph",
      "passage": "The electroencephalogram (EEG) records electrical activity from the scalp using surface electrodes. It has excellent temporal resolution (milliseconds) but poor spatial resolution compared to neuroimaging. EEG is the primary diagnostic tool for epilepsy and is essential for sleep staging",
      "id": "BPSY-0125"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "endocrine-neuroimaging.html",
      "chapter_title": "Endocrine Conditions, Neuroimaging & Diagnostics",
      "section": "Lumbar Puncture (Spinal Tap)",
      "passage_type": "paragraph",
      "passage": "A lumbar puncture involves inserting a needle into the subarachnoid space (typically L3-L4 or L4-L5 level) to collect cerebrospinal fluid (CSF) for analysis. Indications include suspected meningitis or encephalitis, subarachnoid hemorrhage (when CT is negative), normal pressure hydrocephalus (therapeutic and diagnostic), and certain dementia evaluations (CSF biomarkers for Alzheimer's: decreased amyloid-beta-42, increased tau and phospho-tau)",
      "id": "BPSY-0126"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "endocrine-neuroimaging.html",
      "chapter_title": "Endocrine Conditions, Neuroimaging & Diagnostics",
      "section": "Neuropsychological Assessment in Diagnostic Context",
      "passage_type": "paragraph",
      "passage": "Neuropsychological testing complements neuroimaging by providing sensitive measures of cognitive function. Key assessment batteries and their applications include:",
      "id": "BPSY-0127"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "learning-encoding.html",
      "chapter_title": "Learning Processes & Encoding Strategies",
      "section": "Levels of Processing Framework",
      "passage_type": "definition",
      "passage": "Depth of Processing: Shallow processing involves attending to surface-level features of stimuli, such as the physical appearance of a word (structural encoding) or its sound (phonemic encoding). Deep processing involves attending to meaning and making semantic connections (semantic encoding). Deep processing produces significantly stronger and more durable memory traces than shallow processing",
      "id": "BPSY-0128"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "learning-encoding.html",
      "chapter_title": "Learning Processes & Encoding Strategies",
      "section": "Self-Reference & Generation Effects",
      "passage_type": "definition",
      "passage": "Generation Effect: The generation effect demonstrates that information that is actively generated by the learner is better remembered than information that is passively read. For example, completing \"Proactive inter_____\" produces better memory than simply reading \"Proactive interference.\" This effect supports active learning strategies and the testing effect",
      "id": "BPSY-0129"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "learning-encoding.html",
      "chapter_title": "Learning Processes & Encoding Strategies",
      "section": "Mnemonic Strategies",
      "passage_type": "definition",
      "passage": "Transfer-Appropriate Processing: The transfer-appropriate processing principle (Morris, Bransford, & Franks, 1977) states that memory performance depends on the match between the type of processing at encoding and the type of processing required at retrieval. Semantic encoding produces superior performance on meaning-based tests, while phonemic encoding may actually produce better performance on rhyme-recognition tests. This principle refines the levels of processing framework by emphasizing that \"deeper\" is not always \"better\" — what matters is the match between encoding and retrieval demands",
      "id": "BPSY-0130"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "learning-encoding.html",
      "chapter_title": "Learning Processes & Encoding Strategies",
      "section": "State-Dependent Memory",
      "passage_type": "clinical_note",
      "passage": "Clinical Relevance: State-dependent memory has important implications for psychotherapy. Traumatic memories encoded during high-arousal states may be difficult to access during the calm conditions of a therapy session. Conversely, therapeutic insights gained in session may be harder to retrieve when the patient is in a distressed state outside of therapy. This principle also explains why substance-related memories may be more accessible under the influence of the same substance",
      "id": "BPSY-0131"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "learning-encoding.html",
      "chapter_title": "Learning Processes & Encoding Strategies",
      "section": "Encoding Failure as a Cause of Forgetting",
      "passage_type": "clinical_note",
      "passage": "Clinical Application: Encoding failure is particularly relevant to understanding memory complaints in older adults and individuals with attentional disorders. Many reported \"memory problems\" actually reflect attentional or encoding deficits rather than retrieval failures. For example, an individual with ADHD who reports being unable to remember where they placed their keys may never have encoded the location in the first place due to divided attention at the time of placement. Distinguishing encoding failures from retrieval failures has important diagnostic implications",
      "id": "BPSY-0132"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "learning-encoding.html",
      "chapter_title": "Learning Processes & Encoding Strategies",
      "section": "Elaborative vs. Maintenance Rehearsal",
      "passage_type": "example",
      "passage": "EPPP Example: A student who reads the definition of \"proactive interference\" and then generates her own example of how previously learned Spanish vocabulary interferes with learning French vocabulary is engaging in elaborative rehearsal. A student who simply rereads the definition ten times is engaging in maintenance rehearsal. The first strategy produces far superior retention",
      "id": "BPSY-0133"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "learning-encoding.html",
      "chapter_title": "Learning Processes & Encoding Strategies",
      "section": "The Testing Effect (Retrieval Practice)",
      "passage_type": "example",
      "passage": "Study Strategy Application: For EPPP preparation, the testing effect implies that repeatedly taking practice tests is more effective for long-term learning than repeatedly rereading study materials. Each act of retrieval strengthens the memory trace and makes the information more accessible for future recall, including on exam day",
      "id": "BPSY-0134"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "learning-encoding.html",
      "chapter_title": "Learning Processes & Encoding Strategies",
      "section": "Levels of Processing Framework",
      "passage_type": "paragraph",
      "passage": "The levels of processing framework, proposed by Craik and Lockhart (1972), challenged the prevailing multi-store model of memory by arguing that memory durability depends not on which \"store\" information enters, but on the depth at which it is processed during encoding",
      "id": "BPSY-0135"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "learning-encoding.html",
      "chapter_title": "Learning Processes & Encoding Strategies",
      "section": "Elaborative vs. Maintenance Rehearsal",
      "passage_type": "paragraph",
      "passage": "Maintenance rehearsal involves simple repetition of information without engaging with its meaning, as when repeating a phone number to keep it in short-term memory. This form of rehearsal produces minimal long-term retention. In contrast, elaborative rehearsal involves connecting new information to existing knowledge, generating examples, and thinking about meaning. Elaborative rehearsal promotes deep processing and robust long-term encoding",
      "id": "BPSY-0136"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "learning-encoding.html",
      "chapter_title": "Learning Processes & Encoding Strategies",
      "section": "Encoding Specificity & Context Effects",
      "passage_type": "paragraph",
      "passage": "The encoding specificity principle , articulated by Tulving and Thomson (1973), states that memory is most effective when the conditions at retrieval match the conditions present during encoding. This principle has two major applications tested on the EPPP",
      "id": "BPSY-0137"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "learning-encoding.html",
      "chapter_title": "Learning Processes & Encoding Strategies",
      "section": "Context-Dependent Memory",
      "passage_type": "paragraph",
      "passage": "Context-dependent memory refers to the finding that recall is improved when the external environment at retrieval matches the environment present during encoding. Godden and Baddeley (1975) famously demonstrated this with scuba divers who learned word lists either underwater or on land — recall was significantly better when the learning and testing environments matched",
      "id": "BPSY-0138"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "learning-encoding.html",
      "chapter_title": "Learning Processes & Encoding Strategies",
      "section": "State-Dependent Memory",
      "passage_type": "paragraph",
      "passage": "State-dependent memory refers to the finding that recall is enhanced when an individual's internal physiological or psychological state at retrieval matches the state during encoding. This has been demonstrated with mood states (mood-dependent memory), pharmacological states, and arousal levels",
      "id": "BPSY-0139"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "learning-encoding.html",
      "chapter_title": "Learning Processes & Encoding Strategies",
      "section": "Self-Reference & Generation Effects",
      "passage_type": "paragraph",
      "passage": "The self-reference effect is the finding that information encoded in relation to the self is remembered better than information encoded in other ways, including semantic processing. When individuals are asked \"Does this word describe you?\" they show superior recall compared to when asked \"Does this word mean the same as [synonym]?\"",
      "id": "BPSY-0140"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "learning-encoding.html",
      "chapter_title": "Learning Processes & Encoding Strategies",
      "section": "The Testing Effect (Retrieval Practice)",
      "passage_type": "paragraph",
      "passage": "The testing effect (also called retrieval practice) is one of the most robust findings in the learning sciences. Practicing retrieval of information — through self-testing, flashcards, or practice questions — produces substantially better long-term retention than restudying the same material for an equivalent amount of time. Roediger and Karpicke (2006) demonstrated that students who were tested on material retained it significantly better one week later than students who spent the same time restudying",
      "id": "BPSY-0141"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "learning-encoding.html",
      "chapter_title": "Learning Processes & Encoding Strategies",
      "section": "Spacing Effect & Distributed Practice",
      "passage_type": "paragraph",
      "passage": "The spacing effect  is the finding that distributing study sessions over time produces superior long-term retention compared to massing the same amount of study into a single session (cramming). The spacing effect is one of the most replicable findings in all of experimental psychology",
      "id": "BPSY-0142"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "learning-encoding.html",
      "chapter_title": "Learning Processes & Encoding Strategies",
      "section": "Spacing Effect & Distributed Practice",
      "passage_type": "paragraph",
      "passage": "The optimal inter-study interval depends on the retention interval: for a test one week away, spacing sessions 1-2 days apart is optimal; for a test one month away, spacing sessions one week apart is more effective. This principle interacts with the testing effect — spaced retrieval practice produces the strongest retention of all",
      "id": "BPSY-0143"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "learning-encoding.html",
      "chapter_title": "Learning Processes & Encoding Strategies",
      "section": "Dual Coding Theory & Mnemonic Strategies",
      "passage_type": "paragraph",
      "passage": "Dual coding theory  proposes that information is stored in two distinct but interconnected coding systems: a verbal system (for linguistic information) and an imaginal system (for visual-spatial information). Information encoded in both systems — such as a word paired with a vivid mental image — creates two retrieval routes and is therefore more memorable than information encoded in only one system",
      "id": "BPSY-0144"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "learning-encoding.html",
      "chapter_title": "Learning Processes & Encoding Strategies",
      "section": "Mnemonic Strategies",
      "passage_type": "paragraph",
      "passage": "Mnemonic devices leverage dual coding and elaborative processing to enhance memory. Key techniques tested on the EPPP include:",
      "id": "BPSY-0145"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "learning-encoding.html",
      "chapter_title": "Learning Processes & Encoding Strategies",
      "section": "Encoding Failure as a Cause of Forgetting",
      "passage_type": "paragraph",
      "passage": "Not all forgetting reflects the loss of stored information. Encoding failure occurs when information never enters long-term memory in the first place, typically because it was not attended to or processed at a sufficient depth. The classic demonstration involves the penny experiment: most people cannot accurately draw the features of a penny despite having seen thousands of them, because they never encoded the details deeply",
      "id": "BPSY-0146"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "learning-encoding.html",
      "chapter_title": "Learning Processes & Encoding Strategies",
      "section": "Encoding Failure as a Cause of Forgetting",
      "passage_type": "paragraph",
      "passage": "Understanding encoding processes is essential for the EPPP not only as direct test content, but also for optimizing your own study strategies. The research consistently supports the superiority of active, elaborative, spaced, and retrieval-based approaches over passive rereading and massed practice",
      "id": "BPSY-0147"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-architecture.html",
      "chapter_title": "Memory Architecture & Working Memory",
      "section": "Short-Term Memory (STM)",
      "passage_type": "definition",
      "passage": "Chunking: Chunking is the process of grouping individual items into larger meaningful units, effectively increasing the amount of information that can be held in short-term memory. For example, the sequence 1-9-4-1-1-7-7-6 contains 8 digits, but chunking it as 1941-1776 (two historical dates) reduces the memory load to 2 chunks. Expertise in a domain facilitates chunking — chess masters perceive meaningful board configurations as single chunks rather than individual piece positions",
      "id": "BPSY-0148"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-architecture.html",
      "chapter_title": "Memory Architecture & Working Memory",
      "section": "Priming",
      "passage_type": "clinical_note",
      "passage": "Clinical Significance: The explicit/implicit distinction has profound clinical implications. Amnesic patients who cannot consciously remember learning a new skill (explicit deficit) may nonetheless show normal skill improvement across practice sessions (intact implicit memory). Patient H.M. could learn new motor skills (mirror drawing) despite having no explicit memory of ever having practiced the task. This dissociation demonstrates that explicit and implicit memory rely on different neural systems",
      "id": "BPSY-0149"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-architecture.html",
      "chapter_title": "Memory Architecture & Working Memory",
      "section": "The Visuospatial Sketchpad",
      "passage_type": "example",
      "passage": "EPPP Application: The working memory model predicts that two tasks using the same subsystem will interfere with each other more than two tasks using different subsystems. A patient asked to remember a phone number (phonological loop) while counting backward (also phonological loop) will show greater interference than if asked to remember the phone number while tracking a moving object (visuospatial sketchpad). This principle of selective interference is a key prediction tested on the EPPP",
      "id": "BPSY-0150"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-architecture.html",
      "chapter_title": "Memory Architecture & Working Memory",
      "section": "Connectionist and Parallel Distributed Processing Models",
      "passage_type": "example",
      "passage": "Exam Tip: The EPPP may contrast the Atkinson-Shiffrin model (serial, stage-based) with the working memory model (parallel subsystems) and connectionist models (distributed representations). Know the key features and limitations of each: Atkinson-Shiffrin oversimplifies the flow of information; the working memory model better explains active processing but may overemphasize modularity; connectionist models capture neural plausibility but can be difficult to test empirically",
      "id": "BPSY-0151"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-architecture.html",
      "chapter_title": "Memory Architecture & Working Memory",
      "section": "The Atkinson-Shiffrin Multi-Store Model",
      "passage_type": "paragraph",
      "passage": "The Atkinson-Shiffrin model (1968) remains the foundational framework for understanding memory architecture. It proposes three distinct memory stores that differ in capacity, duration, and encoding format. Information flows sequentially from sensory memory to short-term memory and, with rehearsal, to long-term memory",
      "id": "BPSY-0152"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-architecture.html",
      "chapter_title": "Memory Architecture & Working Memory",
      "section": "Short-Term Memory (STM)",
      "passage_type": "paragraph",
      "passage": "Short-term memory holds a limited amount of information in an active, accessible state for approximately 15-30 seconds without rehearsal. George Miller's (1956) classic paper established that STM capacity is approximately 7 plus or minus 2 items (the \"magical number seven\")",
      "id": "BPSY-0153"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-architecture.html",
      "chapter_title": "Memory Architecture & Working Memory",
      "section": "Baddeley's Working Memory Model",
      "passage_type": "paragraph",
      "passage": "Alan Baddeley and Graham Hitch (1974) proposed the working memory model as a replacement for the unitary short-term store in the Atkinson-Shiffrin model. Working memory is not merely a passive holding area but an active system that both maintains and manipulates information during cognitive tasks",
      "id": "BPSY-0154"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-architecture.html",
      "chapter_title": "Memory Architecture & Working Memory",
      "section": "The Phonological Loop",
      "passage_type": "paragraph",
      "passage": "The phonological loop consists of a phonological store (which holds speech-based information for 1-2 seconds) and an articulatory rehearsal process (which refreshes the contents through subvocal repetition). Two key phenomena demonstrate the phonological loop's operation:",
      "id": "BPSY-0155"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-architecture.html",
      "chapter_title": "Memory Architecture & Working Memory",
      "section": "The Visuospatial Sketchpad",
      "passage_type": "paragraph",
      "passage": "The visuospatial sketchpad maintains and manipulates visual and spatial information. It can be subdivided into a visual cache (which stores visual patterns and colors) and an inner scribe (which processes spatial and movement information). Tasks such as mental rotation, navigating a familiar environment from memory, and solving jigsaw puzzles rely on this component",
      "id": "BPSY-0156"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-architecture.html",
      "chapter_title": "Memory Architecture & Working Memory",
      "section": "Long-Term Memory Taxonomies",
      "passage_type": "paragraph",
      "passage": "Long-term memory is not a unitary system but comprises multiple distinct systems that differ in their neural substrates, the type of information they store, and whether they require conscious awareness for retrieval",
      "id": "BPSY-0157"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-architecture.html",
      "chapter_title": "Memory Architecture & Working Memory",
      "section": "Declarative vs. Procedural Memory",
      "passage_type": "paragraph",
      "passage": "Declarative (explicit) memory refers to memories that can be consciously recalled and verbally declared. It is further divided into episodic memory (autobiographical events situated in time and place) and semantic memory (general world knowledge and facts). Declarative memory depends critically on the hippocampus and medial temporal lobe structures",
      "id": "BPSY-0158"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-architecture.html",
      "chapter_title": "Memory Architecture & Working Memory",
      "section": "Declarative vs. Procedural Memory",
      "passage_type": "paragraph",
      "passage": "Procedural (implicit) memory refers to knowledge of how to perform skills and procedures (e.g., riding a bicycle, typing). Procedural memories are acquired gradually through practice and are expressed through performance rather than conscious recollection. This system depends on the basal ganglia, cerebellum, and motor cortex rather than the hippocampus",
      "id": "BPSY-0159"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-architecture.html",
      "chapter_title": "Memory Architecture & Working Memory",
      "section": "Explicit vs. Implicit Memory",
      "passage_type": "paragraph",
      "passage": "The distinction between explicit memory (conscious, intentional recollection) and implicit memory (unconscious influence of past experience on current behavior) is one of the most important in memory research and is heavily tested on the EPPP",
      "id": "BPSY-0160"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-architecture.html",
      "chapter_title": "Memory Architecture & Working Memory",
      "section": "Priming",
      "passage_type": "paragraph",
      "passage": "Priming is a form of implicit memory in which exposure to a stimulus influences the processing of a subsequent stimulus, without conscious awareness. After seeing the word \"DOCTOR,\" a person is faster to recognize \"NURSE\" because the semantic network has been pre-activated. Priming can be perceptual (based on physical features) or conceptual (based on meaning)",
      "id": "BPSY-0161"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-architecture.html",
      "chapter_title": "Memory Architecture & Working Memory",
      "section": "Connectionist and Parallel Distributed Processing Models",
      "passage_type": "paragraph",
      "passage": "In contrast to the discrete-store approach of Atkinson-Shiffrin, connectionist models (also called parallel distributed processing or PDP models) propose that memories are represented as patterns of activation across networks of interconnected processing units. Rather than being stored in a specific location, a memory emerges from the pattern of connection strengths across the network",
      "id": "BPSY-0162"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-architecture.html",
      "chapter_title": "Memory Architecture & Working Memory",
      "section": "Connectionist and Parallel Distributed Processing Models",
      "passage_type": "paragraph",
      "passage": "These models capture several important properties of human memory, including content-addressable retrieval (partial cues can activate complete memories), graceful degradation (the system continues to function despite partial damage), and the ability to generalize from specific experiences to novel situations. Connectionist models also provide a framework for understanding how memories can be distorted — if the network has encoded similar patterns, retrieval of one pattern may be contaminated by elements of another",
      "id": "BPSY-0163"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-forgetting.html",
      "chapter_title": "Memory & Forgetting",
      "section": "Overview of Memory",
      "passage_type": "definition",
      "passage": "Memory: The persistence of learning over time through the encoding, storage, and retrieval of information. Memory is not a unitary system but rather a collection of interrelated processes supported by distinct neural substrates",
      "id": "BPSY-0164"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-forgetting.html",
      "chapter_title": "Memory & Forgetting",
      "section": "Anterograde Amnesia",
      "passage_type": "definition",
      "passage": "Case of H.M. (Henry Molaison): Following bilateral medial temporal lobe resection (including the hippocampus) for epilepsy treatment, H.M. developed profound anterograde amnesia. He could not form new declarative memories but retained procedural learning ability, demonstrating the dissociation between explicit and implicit memory systems (Scoville & Milner, 1957)",
      "id": "BPSY-0165"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-forgetting.html",
      "chapter_title": "Memory & Forgetting",
      "section": "Working Memory (Baddeley & Hitch, 1974)",
      "passage_type": "clinical_note",
      "passage": "Clinical Significance: Working memory deficits are observed in ADHD, schizophrenia, traumatic brain injury, and age-related cognitive decline. Neuroimaging consistently implicates the dorsolateral prefrontal cortex in working memory tasks",
      "id": "BPSY-0166"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-forgetting.html",
      "chapter_title": "Memory & Forgetting",
      "section": "Other Amnesia Types",
      "passage_type": "clinical_note",
      "passage": "Clinical Significance: Korsakoff's syndrome patients produce confabulations -- fabricated memories that fill gaps in recall -- without intent to deceive. This distinguishes the condition from malingering and factitious disorders",
      "id": "BPSY-0167"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-forgetting.html",
      "chapter_title": "Memory & Forgetting",
      "section": "Memory Distortions and Constructive Memory",
      "passage_type": "clinical_note",
      "passage": "Clinical Significance: Understanding memory distortion is essential for evaluating the reliability of eyewitness testimony, recovered memories, and children's testimony in forensic contexts. Clinicians must be aware that therapeutic techniques (e.g., guided imagery, hypnosis) can inadvertently create false memories",
      "id": "BPSY-0168"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-forgetting.html",
      "chapter_title": "Memory & Forgetting",
      "section": "Other Encoding Phenomena",
      "passage_type": "example",
      "passage": "EPPP Application: A student who studies in a quiet room will recall material better when tested in a similar quiet environment. Similarly, material learned while in a particular mood is best recalled in that same mood",
      "id": "BPSY-0169"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-forgetting.html",
      "chapter_title": "Memory & Forgetting",
      "section": "Retrieval Cues and Context",
      "passage_type": "example",
      "passage": "Example: Godden and Baddeley (1975) demonstrated context-dependent memory by having divers learn words either underwater or on land. Recall was significantly better when the retrieval environment matched the learning environment",
      "id": "BPSY-0170"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-forgetting.html",
      "chapter_title": "Memory & Forgetting",
      "section": "Interference Theory",
      "passage_type": "example",
      "passage": "EPPP Example: A student studies Domain 6 material, then studies Domain 7. If the Domain 7 material makes it harder to recall Domain 6 content, that is retroactive interference. If the previously studied Domain 6 content makes Domain 7 harder to learn, that is proactive interference",
      "id": "BPSY-0171"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-forgetting.html",
      "chapter_title": "Memory & Forgetting",
      "section": "Overview of Memory",
      "passage_type": "paragraph",
      "passage": "Memory is the cognitive process by which information is encoded, stored, and retrieved. Understanding memory is essential for the EPPP because memory processes underlie learning, clinical assessment, neuropsychological evaluation, and therapeutic interventions. Disruptions to memory systems are hallmark features of numerous neurological and psychological disorders",
      "id": "BPSY-0172"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-forgetting.html",
      "chapter_title": "Memory & Forgetting",
      "section": "Encoding: Getting Information In",
      "passage_type": "paragraph",
      "passage": "Encoding is the initial processing of information that leads to a mental representation in memory. Not all information that enters the sensory system is encoded into long-term storage; the manner and depth with which we process information significantly determines what is remembered",
      "id": "BPSY-0173"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-forgetting.html",
      "chapter_title": "Memory & Forgetting",
      "section": "Levels of Processing (Craik & Lockhart, 1972)",
      "passage_type": "paragraph",
      "passage": "The levels-of-processing framework proposes that the depth at which information is processed during encoding determines its durability in memory. Deeper processing leads to more elaborate, longer-lasting, and stronger memory traces",
      "id": "BPSY-0174"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-forgetting.html",
      "chapter_title": "Memory & Forgetting",
      "section": "Other Encoding Phenomena",
      "passage_type": "paragraph",
      "passage": "Information related to the self is processed more deeply and remembered better than information about others. Asking \"Does this word describe me?\" leads to superior recall compared to semantic processing alone (Rogers, Kuiper, & Kirker, 1977)",
      "id": "BPSY-0175"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-forgetting.html",
      "chapter_title": "Memory & Forgetting",
      "section": "Other Encoding Phenomena",
      "passage_type": "paragraph",
      "passage": "The process of linking new information to existing knowledge and forming rich associations. The more connections created, the more retrieval routes are available later",
      "id": "BPSY-0176"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-forgetting.html",
      "chapter_title": "Memory & Forgetting",
      "section": "Other Encoding Phenomena",
      "passage_type": "paragraph",
      "passage": "Memory is most effective when the conditions at retrieval match the conditions present at encoding. This principle underlies both context-dependent memory (physical environment) and state-dependent memory (internal physiological or emotional state)",
      "id": "BPSY-0177"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-forgetting.html",
      "chapter_title": "Memory & Forgetting",
      "section": "Storage: Retaining Information",
      "passage_type": "paragraph",
      "passage": "Storage refers to maintaining encoded information over time. The dominant model of memory storage distinguishes three systems based on duration and capacity",
      "id": "BPSY-0178"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-forgetting.html",
      "chapter_title": "Memory & Forgetting",
      "section": "The Atkinson-Shiffrin Model (1968)",
      "passage_type": "paragraph",
      "passage": "Also called the modal model or multi-store model , this framework proposes three sequential stages of memory processing:",
      "id": "BPSY-0179"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-forgetting.html",
      "chapter_title": "Memory & Forgetting",
      "section": "The Atkinson-Shiffrin Model (1968)",
      "passage_type": "paragraph",
      "passage": "The brief retention of sensory information. Iconic memory (visual) lasts approximately 0.5 seconds and was demonstrated by Sperling's (1960) partial-report procedure. Echoic memory (auditory) persists for 3-4 seconds",
      "id": "BPSY-0180"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-forgetting.html",
      "chapter_title": "Memory & Forgetting",
      "section": "The Atkinson-Shiffrin Model (1968)",
      "passage_type": "paragraph",
      "passage": "A limited-capacity store that holds information for brief periods. George Miller (1956) established the capacity of STM at 7 plus or minus 2 items . Capacity can be expanded through chunking , the process of grouping individual items into larger meaningful units",
      "id": "BPSY-0181"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-forgetting.html",
      "chapter_title": "Memory & Forgetting",
      "section": "The Atkinson-Shiffrin Model (1968)",
      "passage_type": "paragraph",
      "passage": "The relatively permanent and essentially limitless storage system. Transfer from STM to LTM is facilitated by rehearsal, elaboration, and meaningful processing. LTM is divided into two major subsystems:",
      "id": "BPSY-0182"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-forgetting.html",
      "chapter_title": "Memory & Forgetting",
      "section": "Working Memory (Baddeley & Hitch, 1974)",
      "passage_type": "paragraph",
      "passage": "Baddeley's working memory model replaced the unitary concept of STM with a multicomponent system that actively manipulates information rather than passively holding it:",
      "id": "BPSY-0183"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-forgetting.html",
      "chapter_title": "Memory & Forgetting",
      "section": "Retrieval: Getting Information Out",
      "passage_type": "paragraph",
      "passage": "Retrieval is the process of accessing stored information. The success of retrieval depends on the quality of encoding, the availability of retrieval cues, and the match between encoding and retrieval conditions",
      "id": "BPSY-0184"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-forgetting.html",
      "chapter_title": "Memory & Forgetting",
      "section": "Retrieval Cues and Context",
      "passage_type": "paragraph",
      "passage": "Effective retrieval depends on the availability and quality of retrieval cues . Tulving's encoding specificity principle states that a cue is effective only if it was encoded with the target information at study",
      "id": "BPSY-0185"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-forgetting.html",
      "chapter_title": "Memory & Forgetting",
      "section": "Forgetting",
      "passage_type": "paragraph",
      "passage": "Forgetting is the inability to retrieve previously stored information. Several theories account for why forgetting occurs",
      "id": "BPSY-0186"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-forgetting.html",
      "chapter_title": "Memory & Forgetting",
      "section": "Ebbinghaus's Forgetting Curve (1885)",
      "passage_type": "paragraph",
      "passage": "Hermann Ebbinghaus demonstrated that forgetting is most rapid shortly after learning and then levels off. Using nonsense syllables, he showed that approximately 50% of learned material is forgotten within one hour, and about 70% within 24 hours, with the rate of forgetting then declining substantially",
      "id": "BPSY-0187"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-forgetting.html",
      "chapter_title": "Memory & Forgetting",
      "section": "Decay Theory",
      "passage_type": "paragraph",
      "passage": "Proposes that memory traces weaken over time if not accessed or rehearsed. While decay likely contributes to forgetting in sensory and short-term memory, evidence suggests that interference rather than mere time passage is the primary cause of long-term forgetting",
      "id": "BPSY-0188"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-forgetting.html",
      "chapter_title": "Memory & Forgetting",
      "section": "Retrieval Failure",
      "passage_type": "paragraph",
      "passage": "Information is available in memory but not accessible due to the absence of appropriate retrieval cues. The tip-of-the-tongue (TOT) phenomenon illustrates this: the person knows they know the information but temporarily cannot access it. TOT states increase with age",
      "id": "BPSY-0189"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-forgetting.html",
      "chapter_title": "Memory & Forgetting",
      "section": "Motivated Forgetting",
      "passage_type": "paragraph",
      "passage": "Freud proposed that threatening or anxiety-provoking memories may be pushed out of conscious awareness through repression (unconscious) or suppression (conscious). While controversial, Anderson and Green (2001) demonstrated \"think/no-think\" suppression effects in laboratory settings",
      "id": "BPSY-0190"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-forgetting.html",
      "chapter_title": "Memory & Forgetting",
      "section": "Amnesia",
      "passage_type": "paragraph",
      "passage": "Amnesia refers to severe memory loss that exceeds normal forgetting. Understanding amnesia types is critical for neuropsychological assessment on the EPPP",
      "id": "BPSY-0191"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-forgetting.html",
      "chapter_title": "Memory & Forgetting",
      "section": "Anterograde Amnesia",
      "passage_type": "paragraph",
      "passage": "The inability to form new memories after the onset of amnesia. Patients cannot transfer new information from short-term to long-term storage, yet procedural memory and priming are often preserved",
      "id": "BPSY-0192"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-forgetting.html",
      "chapter_title": "Memory & Forgetting",
      "section": "Retrograde Amnesia",
      "passage_type": "paragraph",
      "passage": "The inability to recall memories formed before the onset of amnesia. Retrograde amnesia typically follows Ribot's law (temporal gradient) : more recent memories are more vulnerable to disruption than remote memories, because older memories have been more fully consolidated",
      "id": "BPSY-0193"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-forgetting.html",
      "chapter_title": "Memory & Forgetting",
      "section": "Memory Distortions and Constructive Memory",
      "passage_type": "paragraph",
      "passage": "Memory is a reconstructive process, not a perfect recording. Elizabeth Loftus's research on the misinformation effect demonstrated that post-event information can alter memory for the original event (Loftus & Palmer, 1974). Leading questions (e.g., \"How fast were the cars going when they smashed into each other?\" vs. \"...hit each other?\") systematically influenced speed estimates and even whether participants \"remembered\" seeing broken glass",
      "id": "BPSY-0194"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-sleep.html",
      "chapter_title": "Memory & Sleep",
      "section": "Overview of Sleep and Memory",
      "passage_type": "definition",
      "passage": "Sleep: A naturally recurring state of reduced consciousness and metabolic activity, characterized by altered brain wave patterns, diminished responsiveness to external stimuli, and cyclic alternation between NREM and REM stages. Sleep is actively regulated by homeostatic and circadian processes",
      "id": "BPSY-0195"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-sleep.html",
      "chapter_title": "Memory & Sleep",
      "section": "Sleep Spindles and Memory",
      "passage_type": "clinical_note",
      "passage": "Clinical Significance: Sleep disruption impairs memory consolidation and is a contributor to cognitive deficits seen in insomnia, sleep apnea, depression, and PTSD. Addressing sleep disturbances is therefore a therapeutic priority. The finding that sleep processes emotional memories has implications for PTSD treatment, as sleep deprivation immediately after trauma has been explored as a potential prevention strategy",
      "id": "BPSY-0196"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-sleep.html",
      "chapter_title": "Memory & Sleep",
      "section": "Two-Process Model of Sleep Regulation (Borbely, 1982)",
      "passage_type": "example",
      "passage": "EPPP Application: The two-process model explains why it is possible to feel a \"second wind\" late at night despite prolonged wakefulness -- the circadian alerting signal transiently overcomes the high homeostatic sleep drive. Caffeine promotes wakefulness by blocking adenosine receptors, counteracting Process S",
      "id": "BPSY-0197"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-sleep.html",
      "chapter_title": "Memory & Sleep",
      "section": "Overview of Sleep and Memory",
      "passage_type": "paragraph",
      "passage": "Sleep is an active, highly organized physiological process essential for memory consolidation, cognitive function, emotional regulation, and physical health. For the EPPP, understanding sleep architecture, circadian regulation, the relationship between sleep stages and memory, and sleep disorders is critical. Sleep disruption is a transdiagnostic feature of many psychiatric conditions",
      "id": "BPSY-0198"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-sleep.html",
      "chapter_title": "Memory & Sleep",
      "section": "Sleep Stages and Architecture",
      "passage_type": "paragraph",
      "passage": "Sleep is divided into non-rapid eye movement (NREM) sleep and rapid eye movement (REM) sleep. A complete sleep cycle through all stages lasts approximately 90-110 minutes and repeats 4-6 times per night",
      "id": "BPSY-0199"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-sleep.html",
      "chapter_title": "Memory & Sleep",
      "section": "Circadian Rhythms",
      "passage_type": "paragraph",
      "passage": "Circadian rhythms are approximately 24-hour biological cycles that regulate the sleep-wake cycle, hormone secretion, body temperature, and other physiological processes",
      "id": "BPSY-0200"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-sleep.html",
      "chapter_title": "Memory & Sleep",
      "section": "The Suprachiasmatic Nucleus (SCN)",
      "passage_type": "paragraph",
      "passage": "The suprachiasmatic nucleus , located in the anterior hypothalamus above the optic chiasm, is the brain's master biological clock. It receives direct light input from the retina via the retinohypothalamic tract and synchronizes (entrains) internal rhythms to the external light-dark cycle",
      "id": "BPSY-0201"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-sleep.html",
      "chapter_title": "Memory & Sleep",
      "section": "Melatonin",
      "passage_type": "paragraph",
      "passage": "Melatonin is a hormone produced by the pineal gland under the control of the SCN. It serves as the body's \"darkness signal.\"",
      "id": "BPSY-0202"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-sleep.html",
      "chapter_title": "Memory & Sleep",
      "section": "Memory Consolidation During Sleep",
      "passage_type": "paragraph",
      "passage": "Sleep plays a critical role in memory consolidation -- the process by which newly encoded, labile memories are stabilized into long-term, durable representations",
      "id": "BPSY-0203"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-sleep.html",
      "chapter_title": "Memory & Sleep",
      "section": "Slow-Wave Sleep and Declarative Memory",
      "passage_type": "paragraph",
      "passage": "NREM slow-wave sleep (SWS) is particularly important for consolidating declarative (explicit) memories -- facts and events:",
      "id": "BPSY-0204"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-sleep.html",
      "chapter_title": "Memory & Sleep",
      "section": "Insomnia Disorder",
      "passage_type": "paragraph",
      "passage": "Difficulty initiating or maintaining sleep, or early morning awakening, at least 3 nights per week for at least 3 months, causing significant distress or functional impairment. Cognitive-behavioral therapy for insomnia (CBT-I) is the first-line treatment",
      "id": "BPSY-0205"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-sleep.html",
      "chapter_title": "Memory & Sleep",
      "section": "Narcolepsy",
      "passage_type": "paragraph",
      "passage": "A disorder of excessive daytime sleepiness caused by deficiency of hypocretin (orexin) , a neuropeptide produced by the hypothalamus that promotes wakefulness",
      "id": "BPSY-0206"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-sleep.html",
      "chapter_title": "Memory & Sleep",
      "section": "Obstructive Sleep Apnea (OSA)",
      "passage_type": "paragraph",
      "passage": "Repeated episodes of upper airway obstruction during sleep, causing intermittent hypoxia and sleep fragmentation. Associated with obesity, cardiovascular disease, daytime sleepiness, and cognitive impairment. Treated with continuous positive airway pressure (CPAP)",
      "id": "BPSY-0207"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-sleep.html",
      "chapter_title": "Memory & Sleep",
      "section": "Psychoanalytic Theory (Freud, 1900)",
      "passage_type": "paragraph",
      "passage": "Dreams represent disguised fulfillments of repressed wishes. The manifest content (the literal dream narrative) is a symbolic transformation of the latent content (the underlying unconscious wishes) through dream work (condensation, displacement, symbolization)",
      "id": "BPSY-0208"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-sleep.html",
      "chapter_title": "Memory & Sleep",
      "section": "Activation-Synthesis Hypothesis (Hobson & McCarley, 1977)",
      "passage_type": "paragraph",
      "passage": "Dreams result from the brain's attempt to make sense of random neural activation originating in the brainstem (particularly the pontine reticular formation) during REM sleep. The cortex synthesizes a narrative from this random input",
      "id": "BPSY-0209"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-sleep.html",
      "chapter_title": "Memory & Sleep",
      "section": "Threat Simulation Theory (Revonsuo, 2000)",
      "passage_type": "paragraph",
      "passage": "Dreams evolved to simulate threatening events, allowing the rehearsal of threat-avoidance behaviors in a safe environment. This theory is supported by the high prevalence of threatening content in dreams",
      "id": "BPSY-0210"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "memory-sleep.html",
      "chapter_title": "Memory & Sleep",
      "section": "Memory Consolidation Theory",
      "passage_type": "paragraph",
      "passage": "Dreams reflect the reactivation and processing of recent experiences during memory consolidation. Dream content often incorporates elements from recent waking experiences (\"day residue\")",
      "id": "BPSY-0211"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neurocognitive.html",
      "chapter_title": "Neurocognitive Disorders",
      "section": "Frontotemporal NCD (Frontotemporal Dementia, FTD)",
      "passage_type": "clinical_note",
      "passage": "FTD vs. Alzheimer's on the EPPP: The EPPP frequently tests the distinction between FTD and AD. Key differentiators: FTD has earlier onset (often before 65), personality/behavioral changes precede memory loss, memory and visuospatial skills are relatively preserved early on, and social cognition is disproportionately impaired. AD has later onset, memory impairment is the earliest and most prominent symptom, and personality is relatively preserved until later stages. Approximately 40% of FTD cases have a genetic component, with mutations in MAPT (tau), GRN (progranulin), and C9orf72 genes",
      "id": "BPSY-0212"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neurocognitive.html",
      "chapter_title": "Neurocognitive Disorders",
      "section": "Delirium vs. Dementia",
      "passage_type": "example",
      "passage": "Common Causes of Delirium (Mnemonic: I WATCH DEATH): I nfection, W ithdrawal (alcohol, benzodiazepines), A cute metabolic (electrolytes, hepatic/renal failure), T rauma/pain, C NS pathology (stroke, seizure), H ypoxia, D eficiencies (thiamine/B12), E ndocrine (thyroid, adrenal), A cute vascular (stroke, MI), T oxins/drugs (anticholinergics, opioids, benzodiazepines), H eavy metals. Anticholinergic medications are among the most common causes of drug-induced delirium, especially in elderly patients. Pre-existing dementia is itself a major risk factor for developing delirium",
      "id": "BPSY-0213"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neurocognitive.html",
      "chapter_title": "Neurocognitive Disorders",
      "section": "DSM-5 Neurocognitive Disorder Framework",
      "passage_type": "paragraph",
      "passage": "The DSM-5 replaced the older term \"dementia\" with neurocognitive disorder (NCD) , organizing these conditions along a severity spectrum. This framework emphasizes that cognitive decline occurs on a continuum and recognizes multiple etiological subtypes",
      "id": "BPSY-0214"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neurocognitive.html",
      "chapter_title": "Neurocognitive Disorders",
      "section": "Alzheimer's Disease",
      "passage_type": "paragraph",
      "passage": "Alzheimer's disease (AD) is the most common cause of major NCD, accounting for 60-80% of dementia cases. It is a progressive neurodegenerative disease characterized by insidious onset, gradual progression, and a characteristic neuropathological profile",
      "id": "BPSY-0215"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neurocognitive.html",
      "chapter_title": "Neurocognitive Disorders",
      "section": "Vascular Neurocognitive Disorder",
      "passage_type": "paragraph",
      "passage": "Vascular NCD (previously called vascular dementia or multi-infarct dementia) is the second most common cause of dementia, resulting from cerebrovascular disease. Unlike Alzheimer's, vascular NCD classically has a stepwise deterioration rather than gradual decline, with each \"step\" corresponding to a new vascular event (stroke or TIA)",
      "id": "BPSY-0216"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neurocognitive.html",
      "chapter_title": "Neurocognitive Disorders",
      "section": "NCD with Lewy Bodies",
      "passage_type": "paragraph",
      "passage": "Dementia with Lewy bodies (DLB) is the third most common cause of dementia. Lewy bodies are intracellular inclusions composed of alpha-synuclein protein, found diffusely throughout the cortex and brainstem",
      "id": "BPSY-0217"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neurocognitive.html",
      "chapter_title": "Neurocognitive Disorders",
      "section": "Frontotemporal NCD (Frontotemporal Dementia, FTD)",
      "passage_type": "paragraph",
      "passage": "Frontotemporal NCD encompasses a group of disorders characterized by progressive degeneration of the frontal and/or temporal lobes. FTD typically has a younger onset than AD (often ages 45-65) and accounts for a significant proportion of early-onset dementias",
      "id": "BPSY-0218"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neurocognitive.html",
      "chapter_title": "Neurocognitive Disorders",
      "section": "Delirium vs. Dementia",
      "passage_type": "paragraph",
      "passage": "One of the most frequently tested EPPP differential diagnoses is delirium versus dementia (major NCD). Distinguishing these conditions is critical because delirium is a medical emergency that is often reversible when the underlying cause is treated",
      "id": "BPSY-0219"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neurocognitive.html",
      "chapter_title": "Neurocognitive Disorders",
      "section": "HIV-Associated Neurocognitive Disorder (HAND)",
      "passage_type": "paragraph",
      "passage": "HIV-associated neurocognitive disorder exists on a spectrum from asymptomatic neurocognitive impairment (ANI) to mild neurocognitive disorder (MND) to HIV-associated dementia (HAD) . HIV preferentially targets subcortical structures (basal ganglia, white matter), producing a subcortical dementia profile: psychomotor slowing, executive dysfunction, and retrieval-based memory deficits. With effective antiretroviral therapy (ART), the incidence of HAD has dramatically decreased, though milder forms of HAND remain common",
      "id": "BPSY-0220"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neurocognitive.html",
      "chapter_title": "Neurocognitive Disorders",
      "section": "Substance/Medication-Induced NCD",
      "passage_type": "paragraph",
      "passage": "Chronic alcohol use can produce Korsakoff syndrome (thiamine/vitamin B1 deficiency leading to severe anterograde amnesia, confabulation, and apathy, with mammillary body and thalamic damage). The acute, reversible precursor is Wernicke encephalopathy (confusion, ataxia, ophthalmoplegia) -- this is a medical emergency requiring immediate IV thiamine. Chronic inhalant abuse, chronic sedative use, and other substance use disorders can also produce persistent neurocognitive impairment",
      "id": "BPSY-0221"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neurodegenerative-movement.html",
      "chapter_title": "Neurodegenerative & Movement Disorders",
      "section": "Parkinson's Disease",
      "passage_type": "definition",
      "passage": "Cardinal Motor Features (TRAP): Tremor (resting tremor, \"pill-rolling,\" 4-6 Hz, decreases with voluntary movement); Rigidity (cogwheel or lead-pipe resistance to passive movement); Akinesia/Bradykinesia (slowness of movement, difficulty initiating movement, reduced facial expression [masked facies]); Postural instability (impaired balance, tendency to fall). The tremor is typically asymmetric at onset and worsens with stress",
      "id": "BPSY-0222"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neurodegenerative-movement.html",
      "chapter_title": "Neurodegenerative & Movement Disorders",
      "section": "Huntington's Disease",
      "passage_type": "definition",
      "passage": "Pathology & Clinical Features: HD primarily affects the caudate nucleus and putamen (striatum), producing progressive atrophy. The characteristic movement disorder is chorea — involuntary, irregular, dance-like movements affecting the limbs, trunk, and face. The clinical triad includes: (1) choreiform movements, (2) progressive cognitive decline (subcortical dementia pattern with executive dysfunction, slowed processing), and (3) psychiatric disturbances (depression, irritability, personality changes, psychosis). Psychiatric symptoms often precede motor symptoms by years",
      "id": "BPSY-0223"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neurodegenerative-movement.html",
      "chapter_title": "Neurodegenerative & Movement Disorders",
      "section": "Parkinson's Disease",
      "passage_type": "clinical_note",
      "passage": "Treatment: Levodopa (L-DOPA) is the gold-standard treatment — it is a dopamine precursor that crosses the blood-brain barrier and is converted to dopamine. It is typically combined with carbidopa (which prevents peripheral conversion) to reduce side effects. Long-term levodopa use can produce motor fluctuations (\"wearing off,\" \"on-off\" phenomena) and dyskinesias (involuntary choreiform movements). Dopamine agonists (pramipexole, ropinirole), MAO-B inhibitors, and deep brain stimulation of the subthalamic nucleus are additional treatment options",
      "id": "BPSY-0224"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neurodegenerative-movement.html",
      "chapter_title": "Neurodegenerative & Movement Disorders",
      "section": "Myasthenia Gravis",
      "passage_type": "clinical_note",
      "passage": "Cerebellar Disorders: The cerebellum coordinates voluntary movement, balance, and motor learning. Cerebellar damage produces a characteristic syndrome: ataxia (uncoordinated, staggering gait), dysmetria (inability to accurately reach for objects — overshooting or undershooting), intention tremor (worsens as the hand approaches the target — opposite of Parkinson's resting tremor), dysarthria (slurred speech), and nystagmus (involuntary eye movements). Cerebellar signs are ipsilateral to the lesion (unlike cerebral cortex, which is contralateral)",
      "id": "BPSY-0225"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neurodegenerative-movement.html",
      "chapter_title": "Neurodegenerative & Movement Disorders",
      "section": "Huntington's Disease",
      "passage_type": "example",
      "passage": "EPPP Distinction — Parkinson's vs. Huntington's: Parkinson's involves too little dopamine (substantia nigra degeneration) and produces hypokinetic movements (slow, reduced). Huntington's involves loss of inhibitory neurons in the striatum and produces hyperkinetic movements (excessive, involuntary chorea). Parkinson's is typically sporadic; Huntington's is autosomal dominant. Both can produce dementia, but the cognitive profiles differ: PD dementia is more posterior-cortical; HD dementia is subcortical-frontal",
      "id": "BPSY-0226"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neurodegenerative-movement.html",
      "chapter_title": "Neurodegenerative & Movement Disorders",
      "section": "Parkinson's Disease",
      "passage_type": "paragraph",
      "passage": "Parkinson's disease (PD) is a progressive neurodegenerative disorder caused by the loss of dopaminergic neurons in the substantia nigra pars compacta , which projects to the striatum (caudate nucleus and putamen) via the nigrostriatal pathway. The result is a dramatic reduction in striatal dopamine, producing the characteristic motor symptoms",
      "id": "BPSY-0227"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neurodegenerative-movement.html",
      "chapter_title": "Neurodegenerative & Movement Disorders",
      "section": "Parkinson's Disease",
      "passage_type": "paragraph",
      "passage": "Non-motor features include depression (affects ~40% of PD patients), cognitive impairment progressing to dementia in ~30-40% of cases, REM sleep behavior disorder, anosmia (loss of smell), autonomic dysfunction (orthostatic hypotension, constipation), and psychosis (visual hallucinations, often medication-related)",
      "id": "BPSY-0228"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neurodegenerative-movement.html",
      "chapter_title": "Neurodegenerative & Movement Disorders",
      "section": "Huntington's Disease",
      "passage_type": "paragraph",
      "passage": "Huntington's disease (HD) is an autosomal dominant neurodegenerative disorder caused by an expanded CAG trinucleotide repeat on chromosome 4, producing an abnormal huntingtin protein. The disease is 100% penetrant — anyone who inherits the gene will develop the disease if they live long enough. Typical onset is between ages 30 and 50",
      "id": "BPSY-0229"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neurodegenerative-movement.html",
      "chapter_title": "Neurodegenerative & Movement Disorders",
      "section": "Multiple Sclerosis",
      "passage_type": "paragraph",
      "passage": "Multiple sclerosis (MS) is an autoimmune demyelinating disease of the central nervous system in which the immune system attacks oligodendrocytes and the myelin sheath. This produces plaques (lesions) of demyelination scattered throughout the brain and spinal cord, disrupting saltatory conduction and producing a wide range of neurological symptoms",
      "id": "BPSY-0230"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neurodegenerative-movement.html",
      "chapter_title": "Neurodegenerative & Movement Disorders",
      "section": "Multiple Sclerosis",
      "passage_type": "paragraph",
      "passage": "Common symptoms include optic neuritis (inflammation of the optic nerve causing vision loss), sensory disturbances (numbness, tingling, Lhermitte's sign), motor weakness, spasticity, cerebellar ataxia, bladder dysfunction, fatigue, and cognitive impairment (particularly in processing speed, working memory, and executive function). Symptoms often worsen with heat (Uhthoff's phenomenon)",
      "id": "BPSY-0231"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neurodegenerative-movement.html",
      "chapter_title": "Neurodegenerative & Movement Disorders",
      "section": "ALS (Lou Gehrig's Disease)",
      "passage_type": "paragraph",
      "passage": "Amyotrophic lateral sclerosis (ALS) is a progressive motor neuron disease affecting both upper and lower motor neurons. It produces progressive muscle weakness, atrophy, fasciculations (muscle twitching), spasticity, and ultimately respiratory failure. Critically, ALS typically spares cognitive function, sensation, and eye movements until very late stages. Approximately 5-10% of cases are familial (genetic); the remainder are sporadic. Average survival is 3-5 years from symptom onset",
      "id": "BPSY-0232"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neurodegenerative-movement.html",
      "chapter_title": "Neurodegenerative & Movement Disorders",
      "section": "Wilson's Disease",
      "passage_type": "paragraph",
      "passage": "Wilson's disease is an autosomal recessive disorder of copper metabolism causing toxic copper accumulation in the liver, brain (particularly the basal ganglia), and cornea. Neurological symptoms include tremor, dystonia, dysarthria, and psychiatric disturbances (personality changes, depression, psychosis). The pathognomonic sign is Kayser-Fleischer rings — golden-brown copper deposits visible in the cornea. It is treatable with copper chelation therapy (penicillamine) and zinc supplementation if diagnosed early",
      "id": "BPSY-0233"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neurodegenerative-movement.html",
      "chapter_title": "Neurodegenerative & Movement Disorders",
      "section": "Myasthenia Gravis",
      "passage_type": "paragraph",
      "passage": "Myasthenia gravis is an autoimmune disorder in which antibodies attack acetylcholine receptors at the neuromuscular junction, causing progressive muscle weakness that worsens with activity and improves with rest. Characteristic features include ptosis (drooping eyelids), diplopia (double vision), difficulty swallowing, and limb weakness. Treatment includes cholinesterase inhibitors (pyridostigmine), immunosuppressants, and thymectomy",
      "id": "BPSY-0234"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neurological-disorders.html",
      "chapter_title": "Neurological Disorders",
      "section": "Overview of Neurological Disorders",
      "passage_type": "definition",
      "passage": "Neurological Disorder: A disease or condition caused by dysfunction of the brain, spinal cord, or peripheral nerves. Unlike primary psychiatric disorders, neurological disorders have identifiable neuropathology. However, nearly all neurological disorders produce psychiatric and cognitive symptoms that psychologists must recognize and address",
      "id": "BPSY-0235"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neurological-disorders.html",
      "chapter_title": "Neurological Disorders",
      "section": "Huntington's Disease",
      "passage_type": "definition",
      "passage": "Neuropathology: Huntington's disease involves progressive atrophy of the caudate nucleus and putamen (striatum), with loss of GABAergic inhibitory neurons. The loss of inhibitory output from the striatum produces excess, uncontrolled movement (chorea). There is no cure; treatment is symptomatic. Genetic testing is available and raises significant ethical considerations for at-risk family members",
      "id": "BPSY-0236"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neurological-disorders.html",
      "chapter_title": "Neurological Disorders",
      "section": "Temporal Lobe Epilepsy (TLE)",
      "passage_type": "clinical_note",
      "passage": "Clinical Significance: The Wada test (intracarotid amobarbital procedure) is used before epilepsy surgery to determine hemispheric language dominance and memory lateralization. One hemisphere is anesthetized at a time while language and memory are tested. This information guides surgical decisions to avoid causing language or memory deficits",
      "id": "BPSY-0237"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neurological-disorders.html",
      "chapter_title": "Neurological Disorders",
      "section": "Multiple Sclerosis (MS)",
      "passage_type": "clinical_note",
      "passage": "Clinical Significance: MS lesions are disseminated in space (multiple CNS locations) and time (occurring on different occasions). Charcot's triad (nystagmus, intention tremor, scanning speech) is a classic but not always present presentation. Cognitive impairment affects 40-65% of MS patients and can occur early in the disease course",
      "id": "BPSY-0238"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neurological-disorders.html",
      "chapter_title": "Neurological Disorders",
      "section": "Aphasia Syndromes",
      "passage_type": "example",
      "passage": "EPPP Key Distinction: Conduction aphasia is distinguished from other aphasias by the selective impairment of repetition with relatively preserved comprehension and fluent speech. Patients make frequent phonemic paraphasias (sound-based errors, e.g., saying \"trable\" for \"table\") and are aware of their errors, making repeated self-correction attempts",
      "id": "BPSY-0239"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neurological-disorders.html",
      "chapter_title": "Neurological Disorders",
      "section": "Overview of Neurological Disorders",
      "passage_type": "paragraph",
      "passage": "Neurological disorders involve structural or functional pathology of the nervous system. For the EPPP, clinicians must understand the neuroanatomical bases, key symptoms, and differential diagnosis of major neurological conditions, as they frequently co-occur with or mimic psychiatric disorders. This chapter covers epilepsy, Parkinson's disease, Huntington's disease, multiple sclerosis, stroke, traumatic brain injury, and aphasia syndromes",
      "id": "BPSY-0240"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neurological-disorders.html",
      "chapter_title": "Neurological Disorders",
      "section": "Epilepsy",
      "passage_type": "paragraph",
      "passage": "Epilepsy is a chronic neurological disorder characterized by recurrent, unprovoked seizures resulting from abnormal, excessive, or hypersynchronous neuronal activity. It affects approximately 1% of the population",
      "id": "BPSY-0241"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neurological-disorders.html",
      "chapter_title": "Neurological Disorders",
      "section": "Temporal Lobe Epilepsy (TLE)",
      "passage_type": "paragraph",
      "passage": "The most common form of focal epilepsy in adults. Frequently involves the hippocampus and amygdala (mesial temporal sclerosis). Associated with:",
      "id": "BPSY-0242"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neurological-disorders.html",
      "chapter_title": "Neurological Disorders",
      "section": "Parkinson's Disease",
      "passage_type": "paragraph",
      "passage": "Parkinson's disease (PD) is a progressive neurodegenerative disorder caused by the loss of dopaminergic neurons in the substantia nigra pars compacta , leading to dopamine depletion in the striatum (nigrostriatal pathway)",
      "id": "BPSY-0243"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neurological-disorders.html",
      "chapter_title": "Neurological Disorders",
      "section": "Huntington's Disease",
      "passage_type": "paragraph",
      "passage": "Huntington's disease (HD) is an autosomal dominant neurodegenerative disorder caused by a CAG trinucleotide repeat expansion on chromosome 4 (huntingtin gene). Onset is typically in the 30s-40s. Characterized by the triad of:",
      "id": "BPSY-0244"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neurological-disorders.html",
      "chapter_title": "Neurological Disorders",
      "section": "Multiple Sclerosis (MS)",
      "passage_type": "paragraph",
      "passage": "Multiple sclerosis is an autoimmune demyelinating disease of the central nervous system in which the immune system attacks myelin sheaths and the oligodendrocytes that produce them. This results in demyelinating plaques (lesions) scattered throughout the CNS white matter",
      "id": "BPSY-0245"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neurological-disorders.html",
      "chapter_title": "Neurological Disorders",
      "section": "Stroke (Cerebrovascular Accident)",
      "passage_type": "paragraph",
      "passage": "Stroke is an acute neurological event caused by disruption of blood supply to the brain, resulting in rapid death of neural tissue. It is a leading cause of disability and the presentation depends on which artery and brain region are affected",
      "id": "BPSY-0246"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neurological-disorders.html",
      "chapter_title": "Neurological Disorders",
      "section": "Traumatic Brain Injury (TBI)",
      "passage_type": "paragraph",
      "passage": "Traumatic brain injury results from an external mechanical force causing brain dysfunction. Severity is classified by Glasgow Coma Scale (GCS) scores, duration of loss of consciousness, and duration of post-traumatic amnesia (PTA)",
      "id": "BPSY-0247"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neurological-disorders.html",
      "chapter_title": "Neurological Disorders",
      "section": "Aphasia Syndromes",
      "passage_type": "paragraph",
      "passage": "Aphasia is an acquired language disorder resulting from brain damage. The major aphasia types are among the most frequently tested neurological topics on the EPPP",
      "id": "BPSY-0248"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neurons-neurotransmitters.html",
      "chapter_title": "Neurons, Neurotransmitters & Neural Signaling",
      "section": "Neuron Structure & Types",
      "passage_type": "definition",
      "passage": "Glial Cells: Glial cells outnumber neurons and provide essential support functions. Astrocytes regulate the blood-brain barrier, maintain the extracellular environment, and modulate synaptic transmission. Oligodendrocytes produce myelin in the CNS; Schwann cells produce myelin in the PNS (important distinction for the EPPP). Microglia serve as the brain's immune cells, removing cellular debris and responding to infection or injury",
      "id": "BPSY-0249"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neurons-neurotransmitters.html",
      "chapter_title": "Neurons, Neurotransmitters & Neural Signaling",
      "section": "Phases of the Action Potential",
      "passage_type": "definition",
      "passage": "All-or-None Law: The all-or-none law states that an action potential either fires at full amplitude or does not fire at all — there is no partial action potential. The intensity of a stimulus is coded not by the amplitude of individual action potentials but by the frequency of firing (rate coding) and the number of neurons activated",
      "id": "BPSY-0250"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neurons-neurotransmitters.html",
      "chapter_title": "Neurons, Neurotransmitters & Neural Signaling",
      "section": "Synaptic Transmission",
      "passage_type": "definition",
      "passage": "Agonists & Antagonists: An agonist is a substance that mimics or enhances the action of a neurotransmitter (e.g., nicotine is an acetylcholine agonist; morphine is an endorphin agonist). An antagonist blocks or reduces the action of a neurotransmitter (e.g., curare blocks acetylcholine receptors; naloxone blocks opioid receptors). Reuptake inhibitors (e.g., SSRIs for serotonin) block the transporter that removes the neurotransmitter from the synaptic cleft, effectively increasing its availability and prolonging its action",
      "id": "BPSY-0251"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neurons-neurotransmitters.html",
      "chapter_title": "Neurons, Neurotransmitters & Neural Signaling",
      "section": "Refractory Periods",
      "passage_type": "example",
      "passage": "Saltatory Conduction: Saltatory conduction refers to the \"jumping\" of action potentials from one node of Ranvier to the next along myelinated axons. This dramatically increases conduction velocity (up to 120 m/s in large myelinated fibers) compared to continuous conduction in unmyelinated fibers (~1-2 m/s). Demyelinating diseases such as multiple sclerosis disrupt saltatory conduction, slowing or blocking neural transmission",
      "id": "BPSY-0252"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neurons-neurotransmitters.html",
      "chapter_title": "Neurons, Neurotransmitters & Neural Signaling",
      "section": "Neuron Structure & Types",
      "passage_type": "paragraph",
      "passage": "The neuron is the fundamental signaling unit of the nervous system. Although neurons vary widely in shape and size, they share a common structural plan consisting of a cell body, dendrites, and an axon",
      "id": "BPSY-0253"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neurons-neurotransmitters.html",
      "chapter_title": "Neurons, Neurotransmitters & Neural Signaling",
      "section": "The Action Potential",
      "passage_type": "paragraph",
      "passage": "The resting potential of a neuron is approximately -70 mV , maintained by the sodium-potassium pump (3 Na+ out, 2 K+ in) and selective ion channel permeability. When excitatory inputs depolarize the membrane to the threshold (approximately -55 mV), an action potential is triggered",
      "id": "BPSY-0254"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neurons-neurotransmitters.html",
      "chapter_title": "Neurons, Neurotransmitters & Neural Signaling",
      "section": "Refractory Periods",
      "passage_type": "paragraph",
      "passage": "The absolute refractory period occurs during depolarization and early repolarization, when no stimulus (regardless of intensity) can trigger another action potential. The relative refractory period follows, during which a stronger-than-normal stimulus can trigger an action potential. These periods limit the maximum firing rate and ensure unidirectional propagation of the signal along the axon",
      "id": "BPSY-0255"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neurons-neurotransmitters.html",
      "chapter_title": "Neurons, Neurotransmitters & Neural Signaling",
      "section": "Synaptic Transmission",
      "passage_type": "paragraph",
      "passage": "Communication between neurons occurs at the synapse , the junction between a presynaptic terminal button and a postsynaptic dendrite (or cell body). The synaptic cleft — a gap of approximately 20-40 nanometers — separates the pre- and postsynaptic membranes. The sequence of synaptic transmission is as follows:",
      "id": "BPSY-0256"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neurons-neurotransmitters.html",
      "chapter_title": "Neurons, Neurotransmitters & Neural Signaling",
      "section": "Behavioral Genetics",
      "passage_type": "paragraph",
      "passage": "Behavioral genetics investigates the relative contributions of genetic and environmental factors to individual differences in behavior, cognition, and psychopathology. This field provides essential evidence for understanding the biological bases of psychological traits and disorders, and its concepts are heavily tested on the EPPP",
      "id": "BPSY-0257"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neurons-neurotransmitters.html",
      "chapter_title": "Neurons, Neurotransmitters & Neural Signaling",
      "section": "Twin Studies",
      "passage_type": "paragraph",
      "passage": "Twin studies are the cornerstone method of behavioral genetics. They compare concordance rates (or correlations) between monozygotic (MZ, identical) twins, who share 100% of their DNA, and dizygotic (DZ, fraternal) twins, who share approximately 50% of their segregating genes",
      "id": "BPSY-0258"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neurons-neurotransmitters.html",
      "chapter_title": "Neurons, Neurotransmitters & Neural Signaling",
      "section": "Adoption Studies",
      "passage_type": "paragraph",
      "passage": "Adoption studies separate genetic from environmental contributions by comparing adopted children to both their biological parents (who share genes but not environment) and their adoptive parents (who share environment but not genes). If adopted children more closely resemble their biological parents on a trait, genetic factors are implicated. If they more closely resemble their adoptive parents, environmental factors are implicated. Adoption studies of schizophrenia  provided pivotal evidence for a genetic contribution to the disorder",
      "id": "BPSY-0259"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neuroscience-memory.html",
      "chapter_title": "Neuroscience of Memory & Amnesia",
      "section": "The Hippocampus & Memory Consolidation",
      "passage_type": "definition",
      "passage": "Memory Consolidation: Consolidation is the process by which newly encoded, fragile memory traces are stabilized and integrated into long-term storage. Synaptic consolidation occurs within hours at the level of individual synapses (involving protein synthesis and structural changes). Systems consolidation occurs over weeks to years, involving the gradual transfer of memory representations from the hippocampus to distributed neocortical networks. Once fully consolidated, memories can be retrieved independently of the hippocampus",
      "id": "BPSY-0260"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neuroscience-memory.html",
      "chapter_title": "Neuroscience of Memory & Amnesia",
      "section": "Korsakoff's Syndrome",
      "passage_type": "definition",
      "passage": "Clinical Features of Korsakoff's Syndrome: The hallmark features include severe anterograde amnesia, variable retrograde amnesia, and confabulation — the production of fabricated, distorted, or misinterpreted memories without the conscious intention to deceive. Confabulation occurs because the patient fills memory gaps with plausible-sounding but inaccurate information. Patients may also show apathy, lack of insight (anosognosia), and difficulty with temporal ordering of events. Procedural memory and priming are typically preserved",
      "id": "BPSY-0261"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neuroscience-memory.html",
      "chapter_title": "Neuroscience of Memory & Amnesia",
      "section": "Long-Term Potentiation & Hebb's Rule",
      "passage_type": "definition",
      "passage": "Hebb's Rule: Donald Hebb (1949) proposed that \"cells that fire together wire together\" — when a presynaptic neuron repeatedly contributes to firing a postsynaptic neuron, the synaptic connection between them is strengthened. This Hebbian learning rule anticipated the discovery of LTP by over two decades and remains a foundational principle of neural plasticity and memory formation. Hebb also proposed the concept of the \"cell assembly\" — a network of interconnected neurons that represents a memory and becomes increasingly coordinated through repeated co-activation",
      "id": "BPSY-0262"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neuroscience-memory.html",
      "chapter_title": "Neuroscience of Memory & Amnesia",
      "section": "Reconsolidation Theory",
      "passage_type": "clinical_note",
      "passage": "Clinical Application — Memory Reconsolidation in Therapy: Reconsolidation theory has informed trauma therapies that aim to reactivate traumatic memories in safe therapeutic conditions, then introduce new, corrective information during the reconsolidation window. This may update the original memory trace rather than simply creating a competing inhibitory memory (as in standard extinction). The approach is still being researched but represents a promising integration of neuroscience and psychotherapy",
      "id": "BPSY-0263"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neuroscience-memory.html",
      "chapter_title": "Neuroscience of Memory & Amnesia",
      "section": "Korsakoff's Syndrome",
      "passage_type": "example",
      "passage": "EPPP Distinction: Wernicke's encephalopathy (acute phase: confusion, ataxia, ophthalmoplegia) and Korsakoff's syndrome (chronic phase: amnesia, confabulation) are often considered a continuum — Wernicke-Korsakoff syndrome . Wernicke's is treated emergently with IV thiamine; if untreated, approximately 80% of cases progress to Korsakoff's, which is largely irreversible. The EPPP tests the connection between chronic alcohol use, thiamine deficiency, and the specific memory symptoms of Korsakoff's",
      "id": "BPSY-0264"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neuroscience-memory.html",
      "chapter_title": "Neuroscience of Memory & Amnesia",
      "section": "The Hippocampus & Memory Consolidation",
      "passage_type": "paragraph",
      "passage": "The hippocampus , a seahorse-shaped structure in the medial temporal lobe, plays a critical role in the consolidation of new declarative (explicit) memories. It serves as a temporary indexing system that binds together distributed cortical representations of an experience, enabling the gradual transfer of memories to neocortical storage over time",
      "id": "BPSY-0265"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neuroscience-memory.html",
      "chapter_title": "Neuroscience of Memory & Amnesia",
      "section": "The Hippocampus & Memory Consolidation",
      "passage_type": "paragraph",
      "passage": "The hippocampus is essential for encoding new episodic memories and spatial navigation (containing \"place cells\" that fire when an organism occupies a specific location). It is also part of the Papez circuit, which links the hippocampus to the mammillary bodies, anterior thalamus, and cingulate cortex in a circuit important for memory formation",
      "id": "BPSY-0266"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neuroscience-memory.html",
      "chapter_title": "Neuroscience of Memory & Amnesia",
      "section": "Patient H.M. & the Amnesia Syndromes",
      "passage_type": "paragraph",
      "passage": "The case of H.M. (Henry Molaison, 1926-2008) is the most important single case in the history of memory neuroscience. In 1953, neurosurgeon William Beecher Scoville performed a bilateral medial temporal lobectomy (removing the hippocampus, amygdala, and surrounding cortex bilaterally) to treat H.M.'s severe epilepsy. The surgery controlled his seizures but produced profound amnesia",
      "id": "BPSY-0267"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neuroscience-memory.html",
      "chapter_title": "Neuroscience of Memory & Amnesia",
      "section": "Korsakoff's Syndrome",
      "passage_type": "paragraph",
      "passage": "Korsakoff's syndrome is a chronic neurological condition caused by severe thiamine (vitamin B1) deficiency , most commonly associated with chronic alcohol use disorder. The thiamine deficiency produces damage to the mammillary bodies, dorsomedial thalamus, and periventricular regions — all structures critical to memory circuits",
      "id": "BPSY-0268"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neuroscience-memory.html",
      "chapter_title": "Neuroscience of Memory & Amnesia",
      "section": "Long-Term Potentiation & Hebb's Rule",
      "passage_type": "paragraph",
      "passage": "Long-term potentiation (LTP) is the persistent strengthening of synaptic connections following high-frequency stimulation. First described in the hippocampus by Bliss and Lomo (1973), LTP is widely considered the primary cellular mechanism underlying learning and memory",
      "id": "BPSY-0269"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neuroscience-memory.html",
      "chapter_title": "Neuroscience of Memory & Amnesia",
      "section": "Long-Term Potentiation & Hebb's Rule",
      "passage_type": "paragraph",
      "passage": "LTP involves several key molecular steps: (1) high-frequency stimulation of the presynaptic neuron releases glutamate, (2) this activates AMPA and NMDA receptors on the postsynaptic neuron, (3) NMDA receptor activation (which requires both glutamate binding and sufficient postsynaptic depolarization) allows calcium influx, (4) calcium triggers intracellular signaling cascades that strengthen the synapse through insertion of additional AMPA receptors and, eventually, structural changes (new dendritic spines)",
      "id": "BPSY-0270"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neuroscience-memory.html",
      "chapter_title": "Neuroscience of Memory & Amnesia",
      "section": "Amygdala & Emotional Memory",
      "passage_type": "paragraph",
      "passage": "The amygdala modulates the encoding and consolidation of emotionally arousing memories. It does not store the declarative content of emotional memories but enhances hippocampal consolidation through stress hormone and norepinephrine signaling. This explains why emotionally charged events are generally better remembered — the amygdala amplifies the hippocampal encoding process. Amygdala damage impairs the emotional enhancement of memory without affecting the formation of non-emotional declarative memories",
      "id": "BPSY-0271"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neuroscience-memory.html",
      "chapter_title": "Neuroscience of Memory & Amnesia",
      "section": "Cerebellum & Procedural Memory",
      "passage_type": "paragraph",
      "passage": "The cerebellum is essential for motor learning, classical conditioning of motor responses (e.g., eyeblink conditioning), and the fine-tuning of skilled movements. Cerebellar damage impairs the acquisition of conditioned motor responses and the performance of skilled procedural tasks",
      "id": "BPSY-0272"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neuroscience-memory.html",
      "chapter_title": "Neuroscience of Memory & Amnesia",
      "section": "Basal Ganglia & Habit Learning",
      "passage_type": "paragraph",
      "passage": "The basal ganglia (particularly the striatum) are critical for habit learning, stimulus-response associations, and the automatization of behaviors through reinforcement. Patients with Huntington's disease (caudate nucleus atrophy) or Parkinson's disease (substantia nigra degeneration) show impaired procedural and habit learning despite relatively preserved declarative memory in early stages",
      "id": "BPSY-0273"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "neuroscience-memory.html",
      "chapter_title": "Neuroscience of Memory & Amnesia",
      "section": "Reconsolidation Theory",
      "passage_type": "paragraph",
      "passage": "Reconsolidation theory proposes that when a consolidated memory is reactivated (retrieved), it temporarily returns to a labile state and must be reconsolidated to persist. During this reconsolidation window, the memory is vulnerable to modification, disruption, or updating. This has clinical implications for treating PTSD — reactivating a traumatic memory during a therapeutic window (e.g., with propranolol administration or extinction training) may allow the emotional component to be weakened during reconsolidation",
      "id": "BPSY-0274"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "retrieval-forgetting.html",
      "chapter_title": "Retrieval, Forgetting & Memory Distortion",
      "section": "Recall, Recognition & the Serial Position Effect",
      "passage_type": "definition",
      "passage": "Serial Position Effect: The serial position effect describes the tendency to recall items at the beginning and end of a list better than items in the middle. The primacy effect (superior recall of early items) is attributed to greater rehearsal and transfer to long-term memory. The recency effect (superior recall of recent items) is attributed to the items still being active in short-term/working memory. A distractor task between learning and recall eliminates the recency effect but not the primacy effect, supporting the distinction between STM and LTM stores",
      "id": "BPSY-0275"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "retrieval-forgetting.html",
      "chapter_title": "Retrieval, Forgetting & Memory Distortion",
      "section": "False Memories & the Misinformation Effect",
      "passage_type": "definition",
      "passage": "Misinformation Effect: The misinformation effect occurs when misleading post-event information is incorporated into an individual's memory of the original event. This can take the form of misleading questions, exposure to inaccurate accounts from other witnesses, or suggestive therapeutic techniques. The misinformation effect is more powerful when the original memory is weak, when the misleading information is presented with authority, and when there is a long delay between the event and the misinformation",
      "id": "BPSY-0276"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "retrieval-forgetting.html",
      "chapter_title": "Retrieval, Forgetting & Memory Distortion",
      "section": "Proactive vs. Retroactive Interference",
      "passage_type": "clinical_note",
      "passage": "Clinical Relevance: Proactive interference increases with age and is a significant contributor to age-related memory complaints. Older adults are particularly susceptible to proactive interference because they have accumulated more competing memories and may have reduced inhibitory control. In neuropsychological testing, proactive interference is assessed through paradigms such as the release-from-PI procedure and is a sensitive indicator of frontal lobe dysfunction",
      "id": "BPSY-0277"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "retrieval-forgetting.html",
      "chapter_title": "Retrieval, Forgetting & Memory Distortion",
      "section": "Recall, Recognition & the Serial Position Effect",
      "passage_type": "example",
      "passage": "EPPP Application: If an EPPP question describes a participant who learns a word list, performs 30 seconds of mental arithmetic, and then recalls the list, the expected finding is that the primacy effect is preserved (early items still recalled well) but the recency effect is eliminated (recent items are no longer in STM). This classic finding supports the Atkinson-Shiffrin dual-store model",
      "id": "BPSY-0278"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "retrieval-forgetting.html",
      "chapter_title": "Retrieval, Forgetting & Memory Distortion",
      "section": "Recall, Recognition & the Serial Position Effect",
      "passage_type": "paragraph",
      "passage": "Retrieval processes vary in the amount of environmental support they provide. Recall requires generating information from memory with minimal cues (e.g., \"Name the four lobes of the cortex\"), while recognition requires identifying previously encountered information from a set of alternatives (e.g., multiple-choice questions). Recognition is generally easier because the correct answer serves as its own retrieval cue",
      "id": "BPSY-0279"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "retrieval-forgetting.html",
      "chapter_title": "Retrieval, Forgetting & Memory Distortion",
      "section": "The Ebbinghaus Forgetting Curve & Interference Theory",
      "passage_type": "paragraph",
      "passage": "Hermann Ebbinghaus (1885) conducted the first systematic study of forgetting using nonsense syllables. His forgetting curve demonstrated that forgetting is most rapid immediately after learning, with the rate of forgetting decelerating over time. Approximately 50% of newly learned material is forgotten within the first hour, and about 70% within 24 hours, but the remaining material is retained relatively stably over longer periods",
      "id": "BPSY-0280"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "retrieval-forgetting.html",
      "chapter_title": "Retrieval, Forgetting & Memory Distortion",
      "section": "Proactive vs. Retroactive Interference",
      "passage_type": "paragraph",
      "passage": "Interference theory proposes that forgetting occurs because memories compete with one another during retrieval. Two forms of interference are critical for the EPPP:",
      "id": "BPSY-0281"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "retrieval-forgetting.html",
      "chapter_title": "Retrieval, Forgetting & Memory Distortion",
      "section": "Cue-Dependent Forgetting",
      "passage_type": "paragraph",
      "passage": "Cue-dependent forgetting occurs when information is stored in long-term memory but cannot be accessed because the appropriate retrieval cues are absent. This is distinct from trace decay — the memory exists but is temporarily inaccessible. The tip-of-the-tongue (TOT) phenomenon is a vivid example: the person feels certain they know the word, can often recall partial information (first letter, number of syllables), but cannot produce the complete word until the right cue appears",
      "id": "BPSY-0282"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "retrieval-forgetting.html",
      "chapter_title": "Retrieval, Forgetting & Memory Distortion",
      "section": "False Memories & the Misinformation Effect",
      "passage_type": "paragraph",
      "passage": "Elizabeth Loftus's research on the misinformation effect demonstrates that post-event information can alter memory for the original event. In her classic studies, participants who watched a video of a car accident and were later asked \"How fast were the cars going when they smashed into each other?\" (vs. \"contacted\" or \"hit\") reported higher speed estimates and were more likely to falsely remember seeing broken glass",
      "id": "BPSY-0283"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "retrieval-forgetting.html",
      "chapter_title": "Retrieval, Forgetting & Memory Distortion",
      "section": "The DRM Paradigm",
      "passage_type": "paragraph",
      "passage": "The Deese-Roediger-McDermott (DRM) paradigm demonstrates spontaneous false memory formation. Participants study a list of words all related to a non-presented critical lure (e.g., \"bed,\" \"rest,\" \"awake,\" \"tired,\" \"dream\" — the critical lure being \"sleep\"). At test, participants frequently recall or recognize the critical lure with high confidence, sometimes claiming to remember specific details of its presentation. This demonstrates that semantic activation during encoding can create false memories that feel phenomenologically real",
      "id": "BPSY-0284"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "retrieval-forgetting.html",
      "chapter_title": "Retrieval, Forgetting & Memory Distortion",
      "section": "Source Monitoring Errors",
      "passage_type": "paragraph",
      "passage": "Source monitoring refers to the process of attributing a memory to its correct source. Source monitoring errors occur when individuals correctly remember information but misattribute its origin — confusing something they imagined with something they actually experienced, something they read with something someone told them, or something one person said with something another person said. These errors are particularly common in children, older adults, and individuals with frontal lobe dysfunction",
      "id": "BPSY-0285"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "retrieval-forgetting.html",
      "chapter_title": "Retrieval, Forgetting & Memory Distortion",
      "section": "Recovered Memories & the Repression Debate",
      "passage_type": "paragraph",
      "passage": "The recovered memory debate centers on whether traumatic memories can be repressed and later accurately recovered, or whether \"recovered\" memories are typically false memories created through suggestive therapeutic techniques",
      "id": "BPSY-0286"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "retrieval-forgetting.html",
      "chapter_title": "Retrieval, Forgetting & Memory Distortion",
      "section": "Motivated Forgetting & Repression",
      "passage_type": "paragraph",
      "passage": "Motivated forgetting refers to the concept that individuals may forget information because it is unpleasant, threatening, or anxiety-provoking. Freud's concept of repression posits that traumatic memories are actively pushed out of conscious awareness as a defense mechanism. While there is evidence for intentional suppression of unwanted memories (Anderson & Green's \"Think/No-Think\" paradigm), the scientific evidence for Freudian repression of entire traumatic events is weak and contested",
      "id": "BPSY-0287"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "sensation-perception.html",
      "chapter_title": "Sensation, Perception & Psychophysics",
      "section": "Psychophysics: Thresholds & Signal Detection",
      "passage_type": "definition",
      "passage": "Absolute Threshold: The absolute threshold is the minimum intensity of a stimulus that can be detected 50% of the time. For example, the absolute threshold for vision is roughly the equivalent of a candle flame visible from 30 miles on a clear dark night. Note that the 50% criterion is key — detection is probabilistic, not all-or-none",
      "id": "BPSY-0288"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "sensation-perception.html",
      "chapter_title": "Sensation, Perception & Psychophysics",
      "section": "Psychophysics: Thresholds & Signal Detection",
      "passage_type": "definition",
      "passage": "Difference Threshold (JND): The difference threshold , or just noticeable difference (JND) , is the minimum difference between two stimuli that can be detected 50% of the time. Weber's Law states that the JND is a constant proportion of the original stimulus intensity (delta I / I = k). For example, if you can just barely notice the difference between a 100g weight and a 102g weight (2% difference), you would need a 4g difference to detect a change from 200g. The Weber fraction (k) is smaller for more sensitive modalities",
      "id": "BPSY-0289"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "sensation-perception.html",
      "chapter_title": "Sensation, Perception & Psychophysics",
      "section": "Color Vision Theories",
      "passage_type": "definition",
      "passage": "Trichromatic Theory (Young-Helmholtz): The retina contains three types of cones, each maximally sensitive to a different wavelength: short (blue), medium (green), and long (red). All perceived colors result from the combined activation of these three cone types. This theory explains color mixing and certain forms of color blindness (e.g., dichromacy from the absence of one cone type)",
      "id": "BPSY-0290"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "sensation-perception.html",
      "chapter_title": "Sensation, Perception & Psychophysics",
      "section": "Gate-Control Theory of Pain",
      "passage_type": "clinical_note",
      "passage": "Bottom-Up vs. Top-Down Processing: Bottom-up processing (data-driven) begins with sensory input and builds up to perception without influence from prior knowledge. Top-down processing (concept-driven) uses prior knowledge, expectations, and context to interpret sensory input. Most perception involves an interaction of both. Top-down processing explains why context allows you to read words with missing letters, why ambiguous stimuli are perceived differently depending on expectations, and why cultural background influences perception",
      "id": "BPSY-0291"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "sensation-perception.html",
      "chapter_title": "Sensation, Perception & Psychophysics",
      "section": "Change Blindness & Inattentional Blindness",
      "passage_type": "clinical_note",
      "passage": "Clinical Relevance: Attentional deficits are a core feature of many psychological disorders tested on the EPPP. ADHD involves impairments in sustained attention and executive control of attention. Hemispatial neglect following right parietal stroke represents a dramatic failure of spatial attention (Posner's disengage operation). Anxiety disorders involve attentional bias toward threat-related stimuli, which can be measured with the dot-probe task. Understanding the theoretical models of attention provides the conceptual framework for understanding these clinical presentations",
      "id": "BPSY-0292"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "sensation-perception.html",
      "chapter_title": "Sensation, Perception & Psychophysics",
      "section": "Signal Detection Theory (SDT)",
      "passage_type": "example",
      "passage": "Clinical Application: Signal detection theory applies directly to clinical decision-making. A psychologist conducting a risk assessment must balance the cost of false positives (incorrectly identifying someone as dangerous, leading to unnecessary restriction) against the cost of false negatives (failing to identify a truly dangerous individual). The base rate of the behavior, the severity of consequences, and the clinician's threshold for action all influence the decision criterion",
      "id": "BPSY-0293"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "sensation-perception.html",
      "chapter_title": "Sensation, Perception & Psychophysics",
      "section": "Psychophysics: Thresholds & Signal Detection",
      "passage_type": "paragraph",
      "passage": "Psychophysics is the study of the relationship between physical stimuli and the psychological sensations they produce. Several foundational concepts from psychophysics are heavily tested on the EPPP",
      "id": "BPSY-0294"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "sensation-perception.html",
      "chapter_title": "Sensation, Perception & Psychophysics",
      "section": "Signal Detection Theory (SDT)",
      "passage_type": "paragraph",
      "passage": "Signal detection theory provides a framework for understanding how decisions are made under conditions of uncertainty, going beyond simple threshold concepts by acknowledging that detection depends on both the sensitivity of the observer and their response criterion (decision bias)",
      "id": "BPSY-0295"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "sensation-perception.html",
      "chapter_title": "Sensation, Perception & Psychophysics",
      "section": "Signal Detection Theory (SDT)",
      "passage_type": "paragraph",
      "passage": "The observer's sensitivity (d-prime) reflects their ability to discriminate signal from noise, independent of response bias. The response criterion (beta) reflects the observer's willingness to say \"yes\" — a liberal criterion produces more hits but also more false alarms, while a conservative criterion produces fewer false alarms but also more misses. Response criterion shifts depending on the payoff matrix (e.g., a radiologist screening for cancer should adopt a liberal criterion because missing a tumor [miss] is more costly than a false alarm)",
      "id": "BPSY-0296"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "sensation-perception.html",
      "chapter_title": "Sensation, Perception & Psychophysics",
      "section": "Sensory Adaptation",
      "passage_type": "paragraph",
      "passage": "Sensory adaptation is the diminished sensitivity to an unchanging stimulus over time. When you first enter a room with a strong odor, the smell is noticeable, but after several minutes, you barely detect it. This occurs because sensory receptors reduce their firing rate in response to constant stimulation. Importantly, pain receptors show minimal adaptation — a biologically adaptive feature that ensures continued attention to potentially harmful stimuli",
      "id": "BPSY-0297"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "sensation-perception.html",
      "chapter_title": "Sensation, Perception & Psychophysics",
      "section": "Vision: From Retina to Cortex",
      "passage_type": "paragraph",
      "passage": "Light enters the eye through the cornea, passes through the pupil (regulated by the iris), is focused by the lens, and strikes the retina — a thin layer of neural tissue at the back of the eye containing the photoreceptors",
      "id": "BPSY-0298"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "sensation-perception.html",
      "chapter_title": "Sensation, Perception & Psychophysics",
      "section": "Feature Detection",
      "passage_type": "paragraph",
      "passage": "Hubel and Wiesel's Nobel Prize-winning research identified feature detectors in the primary visual cortex (V1): simple cells respond to lines and edges at specific orientations and locations; complex cells respond to moving lines at specific orientations regardless of exact position; and hypercomplex cells respond to lines of specific length or endpoints. This hierarchical processing demonstrates how the visual cortex builds complex representations from simple features",
      "id": "BPSY-0299"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "sensation-perception.html",
      "chapter_title": "Sensation, Perception & Psychophysics",
      "section": "Audition: Hearing Theories",
      "passage_type": "paragraph",
      "passage": "Sound waves are converted to neural signals through the mechanical structures of the ear (outer ear, tympanic membrane, ossicles) and the cochlea, where hair cells on the basilar membrane transduce mechanical vibration into electrical signals",
      "id": "BPSY-0300"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "sensation-perception.html",
      "chapter_title": "Sensation, Perception & Psychophysics",
      "section": "Audition: Hearing Theories",
      "passage_type": "paragraph",
      "passage": "Modern understanding: place theory and frequency/volley theory are complementary. Low frequencies are coded primarily by firing rate (frequency theory), high frequencies are coded by the location of maximal basilar membrane displacement (place theory), and intermediate frequencies use both mechanisms",
      "id": "BPSY-0301"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "sensation-perception.html",
      "chapter_title": "Sensation, Perception & Psychophysics",
      "section": "Gestalt Principles & Perceptual Organization",
      "passage_type": "paragraph",
      "passage": "The Gestalt principles describe how the visual system organizes individual elements into coherent wholes (\"the whole is different from the sum of its parts\"):",
      "id": "BPSY-0302"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "sensation-perception.html",
      "chapter_title": "Sensation, Perception & Psychophysics",
      "section": "Depth Perception",
      "passage_type": "paragraph",
      "passage": "Binocular cues (requiring both eyes): retinal disparity (each eye receives a slightly different image; greater disparity = closer object) and convergence (the inward turning of the eyes for near objects). Monocular cues (available from one eye): relative size, interposition (overlap), linear perspective, texture gradient, aerial perspective (haziness), and motion parallax",
      "id": "BPSY-0303"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "sensation-perception.html",
      "chapter_title": "Sensation, Perception & Psychophysics",
      "section": "Attention Models & Selective Processing",
      "passage_type": "paragraph",
      "passage": "Attention determines which of the vast amount of incoming sensory information reaches conscious awareness and receives further processing. A central debate in cognitive psychology concerns where in the processing stream selection occurs — early (before meaning is extracted) or late (after full semantic analysis). The major models of attention are frequently tested on the EPPP",
      "id": "BPSY-0304"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "sensation-perception.html",
      "chapter_title": "Sensation, Perception & Psychophysics",
      "section": "Deutsch-Norman Late Selection Model",
      "passage_type": "paragraph",
      "passage": "Deutsch and Deutsch (1963), later refined by Norman (1968), proposed a late selection model in which all incoming information is fully processed for meaning (semantically analyzed), and selection occurs only at the response/awareness stage. According to this model, the bottleneck is not in perception but in the decision about what to act on or remember. This explains how people can be influenced by the meaning of unattended messages without being consciously aware of them",
      "id": "BPSY-0305"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "sleep-architecture.html",
      "chapter_title": "Sleep Architecture, Dreaming & the Lifespan",
      "section": "Sleep Stages & EEG Patterns",
      "passage_type": "definition",
      "passage": "Sleep Spindles & K-Complexes: Sleep spindles are brief bursts of 12-14 Hz activity generated by the thalamus during NREM Stage 2. They are believed to play a role in memory consolidation and protecting sleep from external disturbances. K-complexes are large, sharp waveforms that also appear in Stage 2; they are thought to represent cortical responses to external stimuli and may function in sleep maintenance",
      "id": "BPSY-0306"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "sleep-architecture.html",
      "chapter_title": "Sleep Architecture, Dreaming & the Lifespan",
      "section": "Parasomnias",
      "passage_type": "definition",
      "passage": "NREM Parasomnias (Disorders of Arousal): Sleepwalking (somnambulism) and night terrors (sleep terrors) occur during NREM Stage 3 (slow-wave sleep), typically in the first third of the night. During night terrors, the individual may sit up screaming with autonomic arousal (tachycardia, sweating) but has no memory of the event. These parasomnias are most common in children and usually resolve with maturation. They should be distinguished from nightmares, which occur during REM sleep",
      "id": "BPSY-0307"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "sleep-architecture.html",
      "chapter_title": "Sleep Architecture, Dreaming & the Lifespan",
      "section": "Parasomnias",
      "passage_type": "definition",
      "passage": "REM Sleep Behavior Disorder (RBD): REM sleep behavior disorder involves loss of the normal muscle atonia during REM sleep, allowing individuals to physically act out their dreams. RBD is a strong prodromal marker for synucleinopathies — a significant percentage of patients with RBD eventually develop Parkinson's disease or Lewy body dementia. This association is high-yield for the EPPP",
      "id": "BPSY-0308"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "sleep-architecture.html",
      "chapter_title": "Sleep Architecture, Dreaming & the Lifespan",
      "section": "Sleep Across the Lifespan & Deprivation Effects",
      "passage_type": "clinical_note",
      "passage": "Sleep Deprivation Effects: Chronic sleep deprivation impairs attention, working memory, decision-making, emotional regulation, and immune function. Sleep-deprived individuals show increased activity in the amygdala and decreased prefrontal cortex regulation, leading to heightened emotional reactivity. Severe prolonged sleep deprivation can produce perceptual disturbances, paranoia, and psychotic-like symptoms. Growth hormone, which is primarily secreted during slow-wave sleep, is also affected — relevant for pediatric growth and recovery from illness",
      "id": "BPSY-0309"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "sleep-architecture.html",
      "chapter_title": "Sleep Architecture, Dreaming & the Lifespan",
      "section": "Circadian Rhythms & the Suprachiasmatic Nucleus",
      "passage_type": "example",
      "passage": "Clinical Application: Exogenous melatonin is used therapeutically for circadian rhythm disorders, jet lag, and as an adjunct for insomnia. The timing of administration is critical: melatonin given in the evening advances the circadian phase (useful for delayed sleep-wake phase disorder), while melatonin given in the morning delays the phase. Blue-light-blocking glasses in the evening can also advance sleep onset by preventing melatonin suppression",
      "id": "BPSY-0310"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "sleep-architecture.html",
      "chapter_title": "Sleep Architecture, Dreaming & the Lifespan",
      "section": "Sleep Stages & EEG Patterns",
      "passage_type": "paragraph",
      "passage": "Sleep is organized into a cyclic architecture of NREM (non-rapid eye movement) and REM (rapid eye movement) stages, each with characteristic electroencephalographic (EEG) signatures. A complete sleep cycle lasts approximately 90 minutes, with 4-6 cycles occurring per night",
      "id": "BPSY-0311"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "sleep-architecture.html",
      "chapter_title": "Sleep Architecture, Dreaming & the Lifespan",
      "section": "Sleep Stages & EEG Patterns",
      "passage_type": "paragraph",
      "passage": "As the night progresses, NREM Stage 3 (slow-wave sleep) decreases while REM periods become progressively longer. Most slow-wave sleep occurs in the first third of the night, while most REM sleep occurs in the last third. This distribution has important implications: disruptions to early-night sleep primarily affect slow-wave sleep (and declarative memory consolidation), while disruptions to late-night sleep primarily affect REM sleep (and procedural/emotional memory processing)",
      "id": "BPSY-0312"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "sleep-architecture.html",
      "chapter_title": "Sleep Architecture, Dreaming & the Lifespan",
      "section": "Circadian Rhythms & the Suprachiasmatic Nucleus",
      "passage_type": "paragraph",
      "passage": "Circadian rhythms are endogenous biological cycles with a period of approximately 24 hours that regulate sleep-wake cycles, hormone secretion, body temperature, and other physiological processes. The master circadian clock is the suprachiasmatic nucleus (SCN) , located in the anterior hypothalamus directly above the optic chiasm",
      "id": "BPSY-0313"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "sleep-architecture.html",
      "chapter_title": "Sleep Architecture, Dreaming & the Lifespan",
      "section": "Circadian Rhythms & the Suprachiasmatic Nucleus",
      "passage_type": "paragraph",
      "passage": "The SCN receives light information directly from the retina via the retinohypothalamic tract (using specialized melanopsin-containing retinal ganglion cells), allowing it to synchronize the internal clock with the external light-dark cycle. The SCN projects to the pineal gland , which secretes melatonin during darkness. Melatonin promotes sleep onset and is suppressed by light exposure, particularly blue-wavelength light",
      "id": "BPSY-0314"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "sleep-architecture.html",
      "chapter_title": "Sleep Architecture, Dreaming & the Lifespan",
      "section": "Insomnia",
      "passage_type": "paragraph",
      "passage": "Insomnia disorder involves difficulty initiating or maintaining sleep, or early morning awakening, at least three nights per week for at least three months, causing significant distress or functional impairment. Cognitive-behavioral therapy for insomnia (CBT-I) is the first-line treatment and includes stimulus control, sleep restriction, sleep hygiene education, cognitive restructuring, and relaxation training",
      "id": "BPSY-0315"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "sleep-architecture.html",
      "chapter_title": "Sleep Architecture, Dreaming & the Lifespan",
      "section": "Narcolepsy",
      "passage_type": "paragraph",
      "passage": "Narcolepsy is characterized by excessive daytime sleepiness and may include cataplexy (sudden loss of muscle tone triggered by strong emotions), hypnagogic/hypnopompic hallucinations, and sleep paralysis. Type 1 narcolepsy involves deficiency of hypocretin (orexin) , a neuropeptide produced by the lateral hypothalamus that promotes wakefulness. The loss of hypocretin-producing neurons is believed to result from autoimmune destruction",
      "id": "BPSY-0316"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "sleep-architecture.html",
      "chapter_title": "Sleep Architecture, Dreaming & the Lifespan",
      "section": "Obstructive Sleep Apnea",
      "passage_type": "paragraph",
      "passage": "Obstructive sleep apnea (OSA) involves repeated episodes of upper airway collapse during sleep, producing apneas (cessation of breathing for 10+ seconds) or hypopneas (partial airway obstruction). OSA disrupts sleep architecture, reduces oxygen saturation, and is associated with cardiovascular disease, cognitive impairment, and excessive daytime sleepiness. Treatment includes CPAP (continuous positive airway pressure)",
      "id": "BPSY-0317"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "subcortical.html",
      "chapter_title": "Subcortical Structures",
      "section": "Overview of Subcortical Structures",
      "passage_type": "definition",
      "passage": "Subcortical: Refers to structures situated below the cerebral cortex, including the thalamus, hypothalamus, basal ganglia, limbic system structures, brainstem, and cerebellum. These regions are phylogenetically older and more critical for survival-related functions than cortical structures",
      "id": "BPSY-0318"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "subcortical.html",
      "chapter_title": "Subcortical Structures",
      "section": "The Cerebellum",
      "passage_type": "definition",
      "passage": "Cerebellar Damage: Produces ataxia (loss of coordination), dysarthria (slurred speech), intention tremor (tremor that worsens as the hand approaches a target, in contrast to Parkinson's resting tremor), nystagmus (involuntary eye movements), and gait instability. Cerebellar damage does NOT cause paralysis",
      "id": "BPSY-0319"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "subcortical.html",
      "chapter_title": "Subcortical Structures",
      "section": "The Thalamus",
      "passage_type": "clinical_note",
      "passage": "Clinical Significance: Olfaction (smell) is the only sensory modality that does not relay through the thalamus. Olfactory information travels directly from the olfactory bulb to the piriform cortex and amygdala. This is a frequently tested fact on the EPPP",
      "id": "BPSY-0320"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "subcortical.html",
      "chapter_title": "Subcortical Structures",
      "section": "Clinical Significance of Basal Ganglia Dysfunction",
      "passage_type": "clinical_note",
      "passage": "Clinical Significance: The direct pathway through the basal ganglia facilitates movement (excitatory net effect), while the indirect pathway inhibits movement (inhibitory net effect). Parkinson's disease (too little dopamine) results in difficulty initiating movement. Huntington's disease (loss of inhibitory neurons) results in excessive, uncontrolled movement",
      "id": "BPSY-0321"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "subcortical.html",
      "chapter_title": "Subcortical Structures",
      "section": "Reticular Activating System (RAS)",
      "passage_type": "clinical_note",
      "passage": "Clinical Significance: The RAS is clinically important for understanding disorders of consciousness. Coma results from bilateral cortical damage or damage to the RAS. Damage to specific brainstem regions can produce \"locked-in syndrome,\" where patients are conscious but unable to move or communicate except through eye movements",
      "id": "BPSY-0322"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "subcortical.html",
      "chapter_title": "Subcortical Structures",
      "section": "Other Hypothalamic Functions",
      "passage_type": "example",
      "passage": "EPPP Application: Lesion studies are frequently tested. Remember: lateral hypothalamus lesions produce \"lateral leanness\" (aphagia/weight loss), while ventromedial hypothalamus lesions produce \"ventromedial voluminosity\" (hyperphagia/obesity). These mnemonics appear on many EPPP study resources",
      "id": "BPSY-0323"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "subcortical.html",
      "chapter_title": "Subcortical Structures",
      "section": "Overview of Subcortical Structures",
      "passage_type": "paragraph",
      "passage": "Subcortical structures are brain regions located beneath the cerebral cortex that perform vital functions including relaying sensory information, regulating homeostasis, coordinating movement, and mediating emotion and memory. For the EPPP, it is essential to know the key subcortical structures, their locations, their functions, and the clinical consequences of their damage",
      "id": "BPSY-0324"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "subcortical.html",
      "chapter_title": "Subcortical Structures",
      "section": "The Thalamus",
      "passage_type": "paragraph",
      "passage": "The thalamus is a large, egg-shaped structure sitting atop the brainstem at the center of the brain. It serves as the brain's primary sensory relay station, routing incoming sensory information to the appropriate cortical areas",
      "id": "BPSY-0325"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "subcortical.html",
      "chapter_title": "Subcortical Structures",
      "section": "The Hypothalamus",
      "passage_type": "paragraph",
      "passage": "The hypothalamus is a small structure (approximately the size of an almond) located below the thalamus. Despite its small size, it is critical for maintaining homeostasis and regulating the endocrine system through its connection with the pituitary gland",
      "id": "BPSY-0326"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "subcortical.html",
      "chapter_title": "Subcortical Structures",
      "section": "The Limbic System",
      "passage_type": "paragraph",
      "passage": "The limbic system is a collection of interconnected structures surrounding the thalamus that mediate emotion, motivation, learning, and memory. While the exact boundaries of the limbic system are debated, the following structures are consistently included:",
      "id": "BPSY-0327"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "subcortical.html",
      "chapter_title": "Subcortical Structures",
      "section": "Hippocampus",
      "passage_type": "paragraph",
      "passage": "A seahorse-shaped structure in the medial temporal lobe that is essential for the consolidation of new declarative (explicit) memories -- the transfer of information from short-term to long-term storage",
      "id": "BPSY-0328"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "subcortical.html",
      "chapter_title": "Subcortical Structures",
      "section": "Amygdala",
      "passage_type": "paragraph",
      "passage": "An almond-shaped structure anterior to the hippocampus, the amygdala is the brain's \"fear center\" and is critical for emotional processing, particularly fear conditioning and threat detection",
      "id": "BPSY-0329"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "subcortical.html",
      "chapter_title": "Subcortical Structures",
      "section": "Basal Ganglia",
      "passage_type": "paragraph",
      "passage": "The basal ganglia are a group of subcortical nuclei involved in the initiation, execution, and modulation of voluntary movement, as well as procedural learning and habit formation",
      "id": "BPSY-0330"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "subcortical.html",
      "chapter_title": "Subcortical Structures",
      "section": "The Brainstem",
      "passage_type": "paragraph",
      "passage": "The brainstem connects the cerebral hemispheres to the spinal cord and controls vital autonomic functions. It consists of three major divisions:",
      "id": "BPSY-0331"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "subcortical.html",
      "chapter_title": "Subcortical Structures",
      "section": "The Cerebellum",
      "passage_type": "paragraph",
      "passage": "The cerebellum (\"little brain\") is located posterior to the brainstem and contains more neurons than the rest of the brain combined. Although comprising only 10% of brain volume, it contains approximately 50% of the brain's neurons",
      "id": "BPSY-0332"
    },
    {
      "domain_code": "BPSY",
      "domain_name": "Biopsychology",
      "chapter_file": "subcortical.html",
      "chapter_title": "Subcortical Structures",
      "section": "Reticular Activating System (RAS)",
      "passage_type": "paragraph",
      "passage": "The reticular activating system is a network of neurons extending through the brainstem core from the medulla to the midbrain. It plays a critical role in regulating consciousness, arousal, and the sleep-wake cycle",
      "id": "BPSY-0333"
    }
  ]
}