{
  "domain_code": "LDEV",
  "domain_name": "Lifespan & Developmental Stages",
  "total_passages": 326,
  "passages": [
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "architecture-development.html",
      "chapter_title": "The Architecture of Development",
      "section": "Piaget's Cognitive-Developmental Theory",
      "passage_type": "definition",
      "passage": "Schema A cognitive framework or concept that organizes and interprets information. Schemas change with development, becoming more complex and abstract as the child matures through Piaget's stages",
      "id": "LDEV-0001"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "architecture-development.html",
      "chapter_title": "The Architecture of Development",
      "section": "Vygotsky's Sociocultural Theory",
      "passage_type": "definition",
      "passage": "Zone of Proximal Development (ZPD) The distance between what a learner can do independently and what they can accomplish with the guidance of a more skilled partner. Learning is most effective when instruction targets this zone rather than tasks the child can already perform or those far beyond current capacity",
      "id": "LDEV-0002"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "architecture-development.html",
      "chapter_title": "The Architecture of Development",
      "section": "Vygotsky's Sociocultural Theory",
      "passage_type": "definition",
      "passage": "Scaffolding The process by which a more knowledgeable other (parent, teacher, peer) provides temporary, adjustable support to help a learner master a task within their ZPD. As competence increases, the support is gradually withdrawn",
      "id": "LDEV-0003"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "architecture-development.html",
      "chapter_title": "The Architecture of Development",
      "section": "Bronfenbrenner's Ecological Systems Model",
      "passage_type": "definition",
      "passage": "The Five Systems Microsystem: Immediate settings where the child directly interacts (family, school, peer group). Mesosystem: Connections between microsystems (e.g., parent-teacher relationship). Exosystem: Settings that indirectly affect the child (e.g., parent's workplace policies). Macrosystem: Cultural values, laws, customs, and ideologies. Chronosystem: Changes over time in the child or the environment (e.g., historical events, life transitions)",
      "id": "LDEV-0004"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "architecture-development.html",
      "chapter_title": "The Architecture of Development",
      "section": "Gene-Environment Interaction and Correlation",
      "passage_type": "definition",
      "passage": "Epigenetics The study of heritable changes in gene expression that do not involve alterations to the DNA sequence itself. Epigenetic mechanisms—such as DNA methylation and histone modification—can be influenced by environmental factors including nutrition, stress, and toxin exposure, effectively serving as a molecular bridge between nature and nurture",
      "id": "LDEV-0005"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "architecture-development.html",
      "chapter_title": "The Architecture of Development",
      "section": "Critical Periods and Sensitive Periods",
      "passage_type": "definition",
      "passage": "Critical Period A strictly defined time window during which certain experiences must occur for development to proceed normally. If the window is missed, the capacity may be permanently lost. Example: Hubel and Wiesel's research on monocular deprivation in kittens demonstrated a critical period for visual cortex development",
      "id": "LDEV-0006"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "architecture-development.html",
      "chapter_title": "The Architecture of Development",
      "section": "Critical Periods and Sensitive Periods",
      "passage_type": "definition",
      "passage": "Sensitive Period A broader time window during which the organism is especially responsive to certain environmental stimuli, and development proceeds most efficiently. Unlike critical periods, development can still occur outside the sensitive period, though typically with greater effort and potentially less optimal outcomes. Language acquisition is a classic example of a sensitive period",
      "id": "LDEV-0007"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "architecture-development.html",
      "chapter_title": "The Architecture of Development",
      "section": "Cross-Sectional Designs",
      "passage_type": "definition",
      "passage": "Cohort Effect A difference between groups in a cross-sectional study that is attributable to the unique historical experiences of each generation rather than to age-related development. For example, differences in technology use between 20-year-olds and 70-year-olds tested today may reflect generational exposure rather than cognitive aging",
      "id": "LDEV-0008"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "architecture-development.html",
      "chapter_title": "The Architecture of Development",
      "section": "Vygotsky's Sociocultural Theory",
      "passage_type": "clinical_note",
      "passage": "Clinical Application Vygotsky's ZPD concept has direct implications for educational psychology and intervention planning. Clinicians conducting psychoeducational assessments may distinguish between a child's independent performance level and their assisted performance level, using the gap to guide recommendations for instructional strategies and accommodations",
      "id": "LDEV-0009"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "architecture-development.html",
      "chapter_title": "The Architecture of Development",
      "section": "Gene-Environment Interaction and Correlation",
      "passage_type": "clinical_note",
      "passage": "Clinical Relevance Research on early adversity and epigenetics has shown that childhood maltreatment can alter glucocorticoid receptor gene methylation, affecting the stress response system (McGowan et al., 2009). These findings have profound implications for understanding intergenerational transmission of trauma and the biological mechanisms underlying resilience and vulnerability",
      "id": "LDEV-0010"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "architecture-development.html",
      "chapter_title": "The Architecture of Development",
      "section": "Critical Periods and Sensitive Periods",
      "passage_type": "clinical_note",
      "passage": "Clinical Application The concept of sensitive periods informs early intervention programs for children with developmental delays or those at environmental risk. Programs like Head Start and early childhood mental health consultation are predicated on the understanding that the first few years of life represent a sensitive period for cognitive, social, and emotional development",
      "id": "LDEV-0011"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "architecture-development.html",
      "chapter_title": "The Architecture of Development",
      "section": "Piaget's Cognitive-Developmental Theory",
      "passage_type": "example",
      "passage": "Exam Example A 5-year-old watches as water is poured from a short, wide glass into a tall, narrow glass and says there is now \"more water.\" This illustrates the preoperational child's failure to conserve, driven by centration on a single perceptual dimension (height)",
      "id": "LDEV-0012"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "architecture-development.html",
      "chapter_title": "The Architecture of Development",
      "section": "Erikson's Psychosocial Framework",
      "passage_type": "example",
      "passage": "Exam Example A 45-year-old professional who mentors younger colleagues, volunteers in the community, and invests in raising children is displaying generativity —the concern for guiding the next generation that characterizes Erikson's seventh stage",
      "id": "LDEV-0013"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "architecture-development.html",
      "chapter_title": "The Architecture of Development",
      "section": "Bronfenbrenner's Ecological Systems Model",
      "passage_type": "example",
      "passage": "Exam Example A child's academic performance declines after their parent loses a job (exosystem influence), which increases marital conflict at home (microsystem effect). This chain of influence across ecological levels illustrates the interconnection of Bronfenbrenner's systems",
      "id": "LDEV-0014"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "architecture-development.html",
      "chapter_title": "The Architecture of Development",
      "section": "Sequential Designs",
      "passage_type": "example",
      "passage": "Exam Example A researcher in 1990 begins studying cognitive abilities in groups of 20-, 40-, and 60-year-olds, then retests each group every 10 years. By 2010, she can compare age effects (within-person change), cohort effects (between-group differences at the same age), and time-of-measurement effects. This is a sequential design",
      "id": "LDEV-0015"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "architecture-development.html",
      "chapter_title": "The Architecture of Development",
      "section": "Grand Theories of Development",
      "passage_type": "paragraph",
      "passage": "Developmental psychology rests on a handful of towering theoretical frameworks that have shaped how clinicians and researchers conceptualize human growth across the lifespan. These grand theories provide organizing structures for understanding the timing, sequence, and mechanisms of change from conception through death",
      "id": "LDEV-0016"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "architecture-development.html",
      "chapter_title": "The Architecture of Development",
      "section": "Piaget's Cognitive-Developmental Theory",
      "passage_type": "paragraph",
      "passage": "Jean Piaget (1896–1980) proposed that children actively construct their understanding of the world through a series of qualitatively distinct cognitive stages. Central to his theory are the processes of assimilation (incorporating new experiences into existing schemas) and accommodation (modifying existing schemas to fit new information). The dynamic tension between these processes drives cognitive growth through a process Piaget called equilibration",
      "id": "LDEV-0017"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "architecture-development.html",
      "chapter_title": "The Architecture of Development",
      "section": "Vygotsky's Sociocultural Theory",
      "passage_type": "paragraph",
      "passage": "Lev Vygotsky (1896–1934) challenged Piaget's view of the solitary child-as-scientist by emphasizing that cognitive development is fundamentally a social and cultural process. Vygotsky argued that higher mental functions—including logical memory, voluntary attention, and conceptual thinking—originate in social interactions before being internalized by the individual",
      "id": "LDEV-0018"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "architecture-development.html",
      "chapter_title": "The Architecture of Development",
      "section": "Erikson's Psychosocial Framework",
      "passage_type": "paragraph",
      "passage": "Erik Erikson (1902–1994) extended psychoanalytic theory by proposing eight stages of psychosocial development spanning the entire lifespan. Unlike Freud, whose stages ended in adolescence, Erikson emphasized that personality development continues through adulthood and old age. Each stage presents a central crisis —a turning point where the individual negotiates between two opposing tendencies",
      "id": "LDEV-0019"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "architecture-development.html",
      "chapter_title": "The Architecture of Development",
      "section": "Erikson's Psychosocial Framework",
      "passage_type": "paragraph",
      "passage": "Successful resolution of each crisis does not mean entirely avoiding the negative pole. Rather, a healthy outcome involves a favorable ratio between the positive and negative tendencies, producing an emergent ego strength (virtue) that equips the person for subsequent stages",
      "id": "LDEV-0020"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "architecture-development.html",
      "chapter_title": "The Architecture of Development",
      "section": "Bronfenbrenner's Ecological Systems Model",
      "passage_type": "paragraph",
      "passage": "Urie Bronfenbrenner (1917–2005) proposed that development occurs within a set of nested environmental systems, each influencing the individual in distinct but interconnected ways. His ecological systems theory (later revised as the bioecological model ) shifted the focus from exclusively child-centered factors to the broader contexts in which development unfolds",
      "id": "LDEV-0021"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "architecture-development.html",
      "chapter_title": "The Architecture of Development",
      "section": "Bronfenbrenner's Ecological Systems Model",
      "passage_type": "paragraph",
      "passage": "In his later work, Bronfenbrenner emphasized proximal processes —the enduring forms of interaction between the developing person and their immediate environment—as the primary engines of development. These processes operate differently depending on the characteristics of the person, the context, and the time period",
      "id": "LDEV-0022"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "architecture-development.html",
      "chapter_title": "The Architecture of Development",
      "section": "Nature, Nurture, and Epigenetics",
      "passage_type": "paragraph",
      "passage": "The nature versus nurture debate has been a central tension in developmental psychology for over a century. Contemporary perspectives recognize that the question is not which factor matters more but rather how genetic and environmental influences interact across the lifespan",
      "id": "LDEV-0023"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "architecture-development.html",
      "chapter_title": "The Architecture of Development",
      "section": "Behavioral Genetics",
      "passage_type": "paragraph",
      "passage": "Twin studies, adoption studies, and family studies have established that virtually every psychological trait shows some degree of heritability —the proportion of observed variance in a trait attributable to genetic differences within a population. However, heritability is a population statistic, not an individual-level measure, and it does not imply genetic determinism",
      "id": "LDEV-0024"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "architecture-development.html",
      "chapter_title": "The Architecture of Development",
      "section": "Gene-Environment Interaction and Correlation",
      "passage_type": "paragraph",
      "passage": "Gene-environment interaction (G x E) occurs when the effect of a gene depends on the environment, or vice versa. For example, the short allele of the 5-HTTLPR serotonin transporter gene has been associated with increased risk for depression, but primarily in individuals exposed to significant life stress",
      "id": "LDEV-0025"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "architecture-development.html",
      "chapter_title": "The Architecture of Development",
      "section": "Gene-Environment Interaction and Correlation",
      "passage_type": "paragraph",
      "passage": "Gene-environment correlation (rGE) occurs when genetic predispositions influence environmental exposure. Three types include: passive rGE (parents provide both genes and environment), evocative rGE (a child's genetically influenced traits elicit particular environmental responses), and active rGE (individuals seek out environments compatible with their genetic tendencies)",
      "id": "LDEV-0026"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "architecture-development.html",
      "chapter_title": "The Architecture of Development",
      "section": "Critical Periods and Sensitive Periods",
      "passage_type": "paragraph",
      "passage": "The timing of experiences matters profoundly in development. Two related but distinct concepts describe windows of heightened developmental susceptibility",
      "id": "LDEV-0027"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "architecture-development.html",
      "chapter_title": "The Architecture of Development",
      "section": "Critical Periods and Sensitive Periods",
      "passage_type": "paragraph",
      "passage": "The distinction between these concepts has significant implications for intervention. If a capacity has a true critical period, early identification and intervention are essential. If a sensitive period is involved, later intervention remains possible but may need to be more intensive",
      "id": "LDEV-0028"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "architecture-development.html",
      "chapter_title": "The Architecture of Development",
      "section": "Research Methods in Developmental Psychology",
      "passage_type": "paragraph",
      "passage": "Studying change over time presents unique methodological challenges. Developmental researchers employ specialized designs to disentangle the effects of age, historical period, and individual differences",
      "id": "LDEV-0029"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "architecture-development.html",
      "chapter_title": "The Architecture of Development",
      "section": "Longitudinal Designs",
      "passage_type": "paragraph",
      "passage": "In a longitudinal design , the same group of participants is studied repeatedly over an extended period. This allows researchers to track individual developmental trajectories and identify predictors of later outcomes. However, longitudinal studies are expensive, time-consuming, and vulnerable to attrition (participant dropout) and practice effects (improved performance from repeated testing)",
      "id": "LDEV-0030"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "architecture-development.html",
      "chapter_title": "The Architecture of Development",
      "section": "Cross-Sectional Designs",
      "passage_type": "paragraph",
      "passage": "A cross-sectional design compares groups of participants at different ages at a single point in time. This approach is faster and less expensive than longitudinal research but cannot track individual change and is vulnerable to cohort effects —differences between age groups that reflect generational differences in experiences rather than developmental change per se",
      "id": "LDEV-0031"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "architecture-development.html",
      "chapter_title": "The Architecture of Development",
      "section": "Sequential Designs",
      "passage_type": "paragraph",
      "passage": "Sequential designs (also called cohort-sequential or cross-sequential designs) combine elements of both longitudinal and cross-sectional approaches by studying multiple cohorts over time. This powerful strategy, championed by K. Warner Schaie, allows researchers to separate the effects of age, cohort, and time of measurement",
      "id": "LDEV-0032"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "attachment.html",
      "chapter_title": "Attachment & Emotions",
      "section": "Overview of Attachment Theory",
      "passage_type": "paragraph",
      "passage": "Attachment theory, developed by John Bowlby and extended by Mary Ainsworth, is one of the most influential frameworks in developmental psychology. It describes the deep emotional bond between an infant and caregiver and explains how early relationship experiences shape socioemotional development, internal representations of self and others, and relationship patterns across the lifespan",
      "id": "LDEV-0033"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "attachment.html",
      "chapter_title": "Attachment & Emotions",
      "section": "Overview of Attachment Theory",
      "passage_type": "paragraph",
      "passage": "For the EPPP, attachment theory is a commonly tested topic that intersects with developmental psychology, personality, psychopathology, and psychotherapy. Candidates must understand Bowlby's theoretical framework, Ainsworth's classification system, internal working models, and the extension of attachment concepts to adult relationships",
      "id": "LDEV-0034"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "attachment.html",
      "chapter_title": "Attachment & Emotions",
      "section": "Bowlby's Attachment Theory",
      "passage_type": "paragraph",
      "passage": "John Bowlby (1907-1990) drew on ethology, psychoanalysis, and systems theory to propose that attachment is an evolved behavioral system designed to maintain proximity between an infant and caregiver, thereby ensuring the infant's survival. Bowlby challenged the then-dominant psychoanalytic view that infant-mother bonding was based on feeding (drive reduction) and the behaviorist view that attachment was a secondary drive",
      "id": "LDEV-0035"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "attachment.html",
      "chapter_title": "Attachment & Emotions",
      "section": "Harlow's Monkey Studies",
      "passage_type": "paragraph",
      "passage": "Harry Harlow's (1958) research with rhesus monkeys provided powerful evidence against drive-reduction theory. Infant monkeys separated from their mothers were given a choice between a wire \"mother\" that provided food and a cloth \"mother\" that provided no food but was covered in soft terrycloth. The monkeys overwhelmingly preferred the cloth mother, spending most of their time clinging to it and running to it when frightened. This demonstrated that contact comfort , not feeding, was the primary basis of attachment",
      "id": "LDEV-0036"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "attachment.html",
      "chapter_title": "Attachment & Emotions",
      "section": "Harlow's Monkey Studies",
      "passage_type": "paragraph",
      "passage": "Monkeys raised in isolation showed severe and lasting social deficits, including inability to mate, neglect of offspring, and self-injurious behavior -- demonstrating the long-term consequences of attachment deprivation",
      "id": "LDEV-0037"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "attachment.html",
      "chapter_title": "Attachment & Emotions",
      "section": "Ainsworth's Strange Situation",
      "passage_type": "paragraph",
      "passage": "Mary Ainsworth (1913-1999) developed the Strange Situation procedure to systematically classify infant attachment patterns. This laboratory paradigm involves a series of eight 3-minute episodes in which a 12-18 month old infant is observed with the caregiver, with a stranger, and alone. The critical behaviors observed are the infant's response to separation from and reunion with the caregiver",
      "id": "LDEV-0038"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "attachment.html",
      "chapter_title": "Attachment & Emotions",
      "section": "Internal Working Models",
      "passage_type": "paragraph",
      "passage": "Bowlby proposed that through repeated interactions with caregivers, infants develop internal working models -- mental representations of the self, the attachment figure, and relationships. These models include:",
      "id": "LDEV-0039"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "attachment.html",
      "chapter_title": "Attachment & Emotions",
      "section": "Internal Working Models",
      "passage_type": "paragraph",
      "passage": "Internal working models are hypothesized to operate largely outside conscious awareness and to influence expectations, emotions, and behavior in subsequent relationships. While they tend to be stable over time, they are not immutable -- significant relationship experiences (positive or negative) can alter internal working models, a concept central to attachment-based psychotherapy",
      "id": "LDEV-0040"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "attachment.html",
      "chapter_title": "Attachment & Emotions",
      "section": "Adult Attachment",
      "passage_type": "paragraph",
      "passage": "Hazan and Shaver (1987) extended attachment theory to adult romantic relationships, proposing that romantic love is an attachment process. Adults' attachment orientations parallel the infant patterns:",
      "id": "LDEV-0041"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "attachment.html",
      "chapter_title": "Attachment & Emotions",
      "section": "Dimensional Model (Bartholomew & Horowitz, 1991)",
      "passage_type": "paragraph",
      "passage": "Bartholomew proposed a four-category model based on two dimensions: model of self (positive/negative) and model of others (positive/negative):",
      "id": "LDEV-0042"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "attachment.html",
      "chapter_title": "Attachment & Emotions",
      "section": "Adult Attachment Interview (AAI)",
      "passage_type": "paragraph",
      "passage": "The Adult Attachment Interview , developed by Mary Main and colleagues (George, Kaplan, & Main, 1985), assesses adults' \"state of mind with respect to attachment\" through a semi-structured interview about childhood attachment experiences. Classification is based not on what happened but on how coherently and collaboratively the person narrates their attachment history:",
      "id": "LDEV-0043"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "attachment.html",
      "chapter_title": "Attachment & Emotions",
      "section": "Adult Attachment Interview (AAI)",
      "passage_type": "paragraph",
      "passage": "Robust research demonstrates intergenerational transmission: a parent's AAI classification predicts their infant's Strange Situation classification with approximately 75% accuracy (van IJzendoorn, 1995)",
      "id": "LDEV-0044"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "attachment.html",
      "chapter_title": "Attachment & Emotions",
      "section": "Cross-Cultural Considerations",
      "passage_type": "paragraph",
      "passage": "While the distribution of attachment patterns varies across cultures, the core patterns (especially secure attachment) are found universally. Van IJzendoorn and Kroonenberg (1988) meta-analyzed Strange Situation studies across cultures and found:",
      "id": "LDEV-0045"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "awakening-infancy.html",
      "chapter_title": "The Awakening — Infancy & Toddlerhood",
      "section": "Bowlby's Ethological Attachment Theory",
      "passage_type": "definition",
      "passage": "Internal Working Model Bowlby proposed that early attachment experiences create mental representations—internal working models—of the self and others that guide expectations about relationships throughout the lifespan. A securely attached child develops a model of the self as worthy of care and of others as reliable and responsive",
      "id": "LDEV-0046"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "awakening-infancy.html",
      "chapter_title": "The Awakening — Infancy & Toddlerhood",
      "section": "Temperament",
      "passage_type": "definition",
      "passage": "Thomas and Chess's Three Temperament Types Easy child (~40%): Positive mood, regular biological rhythms, adaptable, moderate intensity of reaction. Difficult child (~10%): Negative mood, irregular rhythms, slow to adapt, intense reactions. Slow-to-warm-up child (~15%): Initially negative, low activity level, slow adaptation, mildly intense reactions. The remaining ~35% showed mixed patterns",
      "id": "LDEV-0047"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "awakening-infancy.html",
      "chapter_title": "The Awakening — Infancy & Toddlerhood",
      "section": "Key Substages",
      "passage_type": "definition",
      "passage": "Object Permanence The understanding that objects continue to exist even when they are out of sight. This is the hallmark achievement of the sensorimotor stage. It begins to emerge around 4–8 months (searching for partially hidden objects) and is fully developed by 18–24 months",
      "id": "LDEV-0048"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "awakening-infancy.html",
      "chapter_title": "The Awakening — Infancy & Toddlerhood",
      "section": "Key Substages",
      "passage_type": "definition",
      "passage": "A-not-B Error An error observed around 8–12 months in which an infant who has repeatedly found an object at location A continues to search there even after watching the object being hidden at location B. This error reflects immature object representation and is one of Piaget's most replicated findings",
      "id": "LDEV-0049"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "awakening-infancy.html",
      "chapter_title": "The Awakening — Infancy & Toddlerhood",
      "section": "Language Development",
      "passage_type": "definition",
      "passage": "Holophrastic Speech The use of a single word to express a complete thought or sentence. The meaning is derived from context, intonation, and gesture. For example, \"up\" accompanied by raised arms means \"pick me up.\"",
      "id": "LDEV-0050"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "awakening-infancy.html",
      "chapter_title": "The Awakening — Infancy & Toddlerhood",
      "section": "Language Development",
      "passage_type": "definition",
      "passage": "Telegraphic Speech Two- or three-word utterances that contain only the most essential content words (nouns, verbs) and omit grammatical function words (articles, prepositions). Example: \"daddy go work.\" This stage typically emerges around 18–24 months",
      "id": "LDEV-0051"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "awakening-infancy.html",
      "chapter_title": "The Awakening — Infancy & Toddlerhood",
      "section": "Overextension and Underextension",
      "passage_type": "definition",
      "passage": "Overextension Using a word too broadly by applying it to objects that share perceptual features with the original referent. For example, calling all four-legged animals \"doggie\" or all round objects \"ball.\" Overextension is more common in production than comprehension and typically resolves as vocabulary expands",
      "id": "LDEV-0052"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "awakening-infancy.html",
      "chapter_title": "The Awakening — Infancy & Toddlerhood",
      "section": "Overextension and Underextension",
      "passage_type": "definition",
      "passage": "Underextension Using a word too narrowly by restricting it to only a specific instance of a category. For example, a child may use \"car\" only for the family car and not recognize that other vehicles are also cars. Underextension is less commonly tested but reflects the child's initial context-bound word learning",
      "id": "LDEV-0053"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "awakening-infancy.html",
      "chapter_title": "The Awakening — Infancy & Toddlerhood",
      "section": "Skinner's Behaviorist Approach",
      "passage_type": "definition",
      "passage": "Skinner's Verbal Operants Mand: A verbal response driven by a state of deprivation or need (essentially a request; e.g., saying \"water\" when thirsty). Tact: A verbal response evoked by a nonverbal stimulus (essentially labeling; e.g., saying \"dog\" upon seeing a dog). Echoic: Repeating the verbal behavior of another (imitation). Intraverbal: Verbal behavior controlled by other verbal behavior (e.g., answering a question, holding a conversation)",
      "id": "LDEV-0054"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "awakening-infancy.html",
      "chapter_title": "The Awakening — Infancy & Toddlerhood",
      "section": "Ainsworth's Strange Situation",
      "passage_type": "clinical_note",
      "passage": "Clinical Application Disorganized attachment has been identified as a significant risk factor for the development of dissociative symptoms, borderline personality features, and externalizing behavior problems in later childhood and adolescence. Attachment-based interventions such as Circle of Security and Child-Parent Psychotherapy target the caregiver-child relationship to promote security",
      "id": "LDEV-0055"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "awakening-infancy.html",
      "chapter_title": "The Awakening — Infancy & Toddlerhood",
      "section": "Language Development",
      "passage_type": "clinical_note",
      "passage": "Clinical Note Language delay is one of the most common reasons for referral in early childhood. While late talkers (children with expressive vocabularies below 50 words at 24 months) often catch up, persistent language delays by age 3 may signal specific language impairment, autism spectrum disorder, or hearing loss and warrant formal evaluation",
      "id": "LDEV-0056"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "awakening-infancy.html",
      "chapter_title": "The Awakening — Infancy & Toddlerhood",
      "section": "Chomsky's Nativist Approach",
      "passage_type": "clinical_note",
      "passage": "Historical Significance Chomsky's 1959 review of Skinner's Verbal Behavior is widely regarded as one of the pivotal events in the cognitive revolution , helping shift psychology away from strict behaviorism and toward the study of internal mental structures and processes. This is a high-frequency EPPP topic",
      "id": "LDEV-0057"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "awakening-infancy.html",
      "chapter_title": "The Awakening — Infancy & Toddlerhood",
      "section": "Synaptic Pruning",
      "passage_type": "clinical_note",
      "passage": "Clinical Relevance The concept of experience-expectant development refers to neural processes that require typical environmental input (visual stimulation, language exposure, social interaction) to develop normally. Experience-dependent development involves the formation of synapses in response to unique individual experiences. Both processes underscore the importance of enriched early environments for optimal brain development",
      "id": "LDEV-0058"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "awakening-infancy.html",
      "chapter_title": "The Awakening — Infancy & Toddlerhood",
      "section": "Ainsworth's Strange Situation",
      "passage_type": "example",
      "passage": "Exam Example In the Strange Situation, a 14-month-old becomes very upset when her mother leaves the room. When the mother returns, the child reaches out to be picked up but then immediately pushes away and cries harder, alternating between clinging and angry resistance. This pattern is most consistent with insecure-resistant (ambivalent) attachment (Type C)",
      "id": "LDEV-0059"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "awakening-infancy.html",
      "chapter_title": "The Awakening — Infancy & Toddlerhood",
      "section": "Temperament",
      "passage_type": "example",
      "passage": "Exam Example A parent describes their 6-month-old as fussy, with unpredictable eating and sleeping schedules, and strong emotional reactions to new situations. Using Thomas and Chess's classification, this infant would be described as having a \"difficult\" temperament. A clinician would focus on goodness of fit between the child's temperament and parenting approach",
      "id": "LDEV-0060"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "awakening-infancy.html",
      "chapter_title": "The Awakening — Infancy & Toddlerhood",
      "section": "Key Substages",
      "passage_type": "example",
      "passage": "Exam Example A researcher hides a toy under blanket A several times, and the 9-month-old successfully retrieves it. Then, in full view of the infant, the researcher hides the toy under blanket B. The infant searches under blanket A. This is the classic A-not-B error, characteristic of Piaget's substage 4 (coordination of secondary schemes)",
      "id": "LDEV-0061"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "awakening-infancy.html",
      "chapter_title": "The Awakening — Infancy & Toddlerhood",
      "section": "Interactionist Approaches",
      "passage_type": "example",
      "passage": "Exam Example A 2-year-old says \"I goed to the park\" even though no adult has ever modeled this sentence. This overregularization error provides evidence for Chomsky's nativist theory over Skinner's behaviorist account, because the child is applying an internalized grammatical rule (past tense = verb + \"-ed\") rather than imitating adult speech",
      "id": "LDEV-0062"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "awakening-infancy.html",
      "chapter_title": "The Awakening — Infancy & Toddlerhood",
      "section": "Attachment Theory",
      "passage_type": "paragraph",
      "passage": "Attachment—the deep emotional bond between an infant and a caregiver—is one of the most heavily tested topics on the EPPP within the developmental domain. The theoretical foundations laid by John Bowlby and the empirical classification system developed by Mary Ainsworth remain cornerstones of clinical and developmental psychology",
      "id": "LDEV-0063"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "awakening-infancy.html",
      "chapter_title": "The Awakening — Infancy & Toddlerhood",
      "section": "Bowlby's Ethological Attachment Theory",
      "passage_type": "paragraph",
      "passage": "Bowlby (1969/1982) proposed that attachment is an evolved behavioral system designed to maintain proximity between infants and caregivers, thereby promoting survival. He described four phases of attachment development:",
      "id": "LDEV-0064"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "awakening-infancy.html",
      "chapter_title": "The Awakening — Infancy & Toddlerhood",
      "section": "Ainsworth's Strange Situation",
      "passage_type": "paragraph",
      "passage": "Mary Ainsworth developed the Strange Situation paradigm to assess the quality of infant-caregiver attachment in a laboratory setting. The procedure involves a series of separations and reunions between the infant (typically 12–18 months) and the caregiver, observed through a one-way mirror",
      "id": "LDEV-0065"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "awakening-infancy.html",
      "chapter_title": "The Awakening — Infancy & Toddlerhood",
      "section": "Ainsworth's Strange Situation",
      "passage_type": "paragraph",
      "passage": "The disorganized attachment classification (Type D) was added later by Mary Main and Judith Solomon (1986). These infants appear to lack a coherent strategy for managing distress and show the highest risk for later psychopathology",
      "id": "LDEV-0066"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "awakening-infancy.html",
      "chapter_title": "The Awakening — Infancy & Toddlerhood",
      "section": "Temperament",
      "passage_type": "paragraph",
      "passage": "Temperament refers to individual differences in emotional reactivity and self-regulation that appear early in life, show moderate stability over time, and are influenced by both genetic and environmental factors. The most influential classification was developed by Thomas and Chess (1977) based on the New York Longitudinal Study (NYLS)",
      "id": "LDEV-0067"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "awakening-infancy.html",
      "chapter_title": "The Awakening — Infancy & Toddlerhood",
      "section": "Temperament",
      "passage_type": "paragraph",
      "passage": "Thomas and Chess introduced the concept of goodness of fit —the match between a child's temperament and the demands and expectations of the caregiving environment. A difficult child in a patient, flexible environment may thrive, while the same child in a rigid, punitive environment may develop behavioral problems",
      "id": "LDEV-0068"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "awakening-infancy.html",
      "chapter_title": "The Awakening — Infancy & Toddlerhood",
      "section": "Kagan's Behavioral Inhibition",
      "passage_type": "paragraph",
      "passage": "Jerome Kagan identified a temperamental dimension called behavioral inhibition —the tendency to react with wariness and withdrawal to novel or unfamiliar stimuli. Approximately 15–20% of infants are classified as behaviorally inhibited. Kagan's longitudinal research showed that inhibited infants tend to remain cautious and shy into childhood, and they show a heightened risk for developing anxiety disorders, particularly social anxiety",
      "id": "LDEV-0069"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "awakening-infancy.html",
      "chapter_title": "The Awakening — Infancy & Toddlerhood",
      "section": "Cognitive Development: The Sensorimotor Stage",
      "passage_type": "paragraph",
      "passage": "Piaget's sensorimotor stage (birth to approximately 2 years) describes the period during which infants construct knowledge about the world through physical actions and sensory experiences. Piaget divided this stage into six substages, each marked by increasingly sophisticated cognitive achievements",
      "id": "LDEV-0070"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "awakening-infancy.html",
      "chapter_title": "The Awakening — Infancy & Toddlerhood",
      "section": "Language Development",
      "passage_type": "paragraph",
      "passage": "The first two years of life witness a remarkable transformation in communicative ability, from reflexive crying to the production of multi-word utterances. Language development follows a predictable sequence across cultures, though the rate varies among individuals",
      "id": "LDEV-0071"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "awakening-infancy.html",
      "chapter_title": "The Awakening — Infancy & Toddlerhood",
      "section": "Language Acquisition Theories",
      "passage_type": "paragraph",
      "passage": "How do children acquire language? This question has generated one of the most influential debates in psychology, pitting behaviorist, nativist, and interactionist perspectives against one another. The Skinner–Chomsky debate remains a foundational topic for the EPPP",
      "id": "LDEV-0072"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "awakening-infancy.html",
      "chapter_title": "The Awakening — Infancy & Toddlerhood",
      "section": "Skinner's Behaviorist Approach",
      "passage_type": "paragraph",
      "passage": "In Verbal Behavior (1957), B. F. Skinner argued that language is acquired through the same principles of operant conditioning that govern all learned behavior. According to Skinner, children learn to speak through reinforcement (a parent smiles and responds when a child says \"mama\"), shaping (successive approximations of correct speech are differentially reinforced), and imitation (children repeat the speech they hear modeled by adults)",
      "id": "LDEV-0073"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "awakening-infancy.html",
      "chapter_title": "The Awakening — Infancy & Toddlerhood",
      "section": "Chomsky's Nativist Approach",
      "passage_type": "paragraph",
      "passage": "Noam Chomsky fundamentally challenged Skinner's account in his landmark 1959 review of Verbal Behavior , arguing that reinforcement and imitation cannot explain the speed, creativity, and rule-governed nature of language acquisition. Chomsky proposed that humans are born with an innate Language Acquisition Device (LAD) —a neurological mechanism containing Universal Grammar (UG) , the set of grammatical principles shared by all human languages",
      "id": "LDEV-0074"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "awakening-infancy.html",
      "chapter_title": "The Awakening — Infancy & Toddlerhood",
      "section": "Interactionist Approaches",
      "passage_type": "paragraph",
      "passage": "Contemporary theories recognize that both biological endowment and social experience are necessary for language development. Interactionist perspectives emphasize the scaffolding role of the social environment in activating and shaping innate capacities",
      "id": "LDEV-0075"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "awakening-infancy.html",
      "chapter_title": "The Awakening — Infancy & Toddlerhood",
      "section": "Brain Development and Motor Milestones",
      "passage_type": "paragraph",
      "passage": "The infant brain undergoes explosive growth during the first two years of life, doubling in weight by the first birthday and reaching roughly 75% of adult size by age 2. This growth is driven by synaptogenesis (the formation of new synaptic connections) and myelination (the coating of neural axons with myelin to increase signal speed)",
      "id": "LDEV-0076"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "awakening-infancy.html",
      "chapter_title": "The Awakening — Infancy & Toddlerhood",
      "section": "Synaptic Pruning",
      "passage_type": "paragraph",
      "passage": "The infant brain produces far more synapses than it will ultimately retain—a process of neural overproduction. Synaptic pruning is the experience-dependent elimination of underused or redundant connections, sculpting the brain's architecture based on environmental input. This process follows the principle of \"use it or lose it\" and is critical for efficient neural functioning",
      "id": "LDEV-0077"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "awakening-infancy.html",
      "chapter_title": "The Awakening — Infancy & Toddlerhood",
      "section": "Motor Development",
      "passage_type": "paragraph",
      "passage": "While the sequence of motor milestones is largely invariant, the timing can vary considerably across individuals and cultures. Motor development reflects the maturation of the nervous system, muscular strength, body proportions, and opportunities for practice",
      "id": "LDEV-0078"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "building-competence.html",
      "chapter_title": "Building Competence — Middle Childhood",
      "section": "Conservation",
      "passage_type": "definition",
      "passage": "Conservation The understanding that certain physical properties of objects (number, length, liquid quantity, mass, area, weight, volume) remain unchanged despite changes in their outward appearance. Conservation develops gradually, with number and length typically mastered first (around age 6–7) and volume last (around age 11–12). This staggered acquisition is called horizontal décalage",
      "id": "LDEV-0079"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "building-competence.html",
      "chapter_title": "Building Competence — Middle Childhood",
      "section": "Kohlberg's Theory of Moral Development",
      "passage_type": "definition",
      "passage": "The Heinz Dilemma A man's wife is dying of cancer. A druggist has discovered a cure but is charging $2,000—ten times what the drug costs to make. Heinz can only raise $1,000. Should he steal the drug? Kohlberg's scoring focuses not on whether the person says Heinz should or should not steal, but on the reasoning behind the judgment",
      "id": "LDEV-0080"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "building-competence.html",
      "chapter_title": "Building Competence — Middle Childhood",
      "section": "Erikson's Industry vs. Inferiority",
      "passage_type": "definition",
      "passage": "Industry vs. Inferiority Erikson's fourth psychosocial stage (approximately ages 6–11). Children develop a sense of industry —competence and mastery—through productive work in school, sports, hobbies, and social activities. Failure to develop competence leads to feelings of inferiority and inadequacy. The virtue that emerges from successful resolution is competence",
      "id": "LDEV-0081"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "building-competence.html",
      "chapter_title": "Building Competence — Middle Childhood",
      "section": "Specific Learning Disorders",
      "passage_type": "definition",
      "passage": "Dyslexia The most common specific learning disorder, characterized by difficulties with accurate and/or fluent word recognition, poor spelling, and poor decoding. Research implicates deficits in phonological processing —the ability to identify and manipulate the sound structures of language. The prevalence is approximately 5–15% of school-age children, with higher rates in boys",
      "id": "LDEV-0082"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "building-competence.html",
      "chapter_title": "Building Competence — Middle Childhood",
      "section": "Gilligan's Ethic of Care",
      "passage_type": "clinical_note",
      "passage": "Clinical Consideration Empirical research has produced mixed support for Gilligan's claim of systematic gender differences in moral reasoning. Meta-analyses have found that when differences appear, they tend to be small. However, Gilligan's work importantly highlighted the role of cultural context and relational orientation in moral development, broadening the field beyond a purely justice-based framework",
      "id": "LDEV-0083"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "building-competence.html",
      "chapter_title": "Building Competence — Middle Childhood",
      "section": "Peer Status Categories",
      "passage_type": "clinical_note",
      "passage": "Clinical Application Chronic peer rejection in middle childhood is one of the strongest predictors of later maladjustment, including school dropout, delinquency, and substance use. Social skills training interventions targeting rejected children aim to improve social cognition, emotion regulation, and behavioral repertoire to break the cycle of rejection",
      "id": "LDEV-0084"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "building-competence.html",
      "chapter_title": "Building Competence — Middle Childhood",
      "section": "Peer Status Categories",
      "passage_type": "clinical_note",
      "passage": "Clinical Note: Bullying Bullying peaks during the transition to middle school. Olweus (1993) identified characteristics of both bullies (dominant, low empathy, positive attitudes toward aggression) and victims (anxious, insecure, physically weaker). Bully-victims—children who are both perpetrators and targets—show the worst psychological outcomes. Evidence-based prevention programs (e.g., Olweus Bullying Prevention Program) address the school climate systemically",
      "id": "LDEV-0085"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "building-competence.html",
      "chapter_title": "Building Competence — Middle Childhood",
      "section": "Classification and Seriation",
      "passage_type": "example",
      "passage": "Exam Example A child is shown a set of sticks of varying lengths and asked to arrange them from shortest to longest. A preoperational child may use trial-and-error, while a concrete operational child systematically selects the shortest stick first, then the next shortest, demonstrating seriation ability",
      "id": "LDEV-0086"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "building-competence.html",
      "chapter_title": "Building Competence — Middle Childhood",
      "section": "Kohlberg's Theory of Moral Development",
      "passage_type": "example",
      "passage": "Exam Example A child says Heinz should not steal the drug because \"he'll get in trouble and go to jail.\" This reasoning reflects Stage 1 (preconventional), where morality is based on avoidance of punishment. In contrast, an adult who says Heinz should steal because \"the right to life supersedes the right to property\" is reasoning at Stage 6 (postconventional)",
      "id": "LDEV-0087"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "building-competence.html",
      "chapter_title": "Building Competence — Middle Childhood",
      "section": "Susan Harter's Self-Perception Model",
      "passage_type": "example",
      "passage": "Exam Example A 9-year-old who excels at reading but is poor at sports has high self-esteem if she values academic achievement and places less importance on athletics. According to Harter, the discrepancy between perceived competence and the importance of a domain predicts self-esteem",
      "id": "LDEV-0088"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "building-competence.html",
      "chapter_title": "Building Competence — Middle Childhood",
      "section": "Attention-Deficit/Hyperactivity Disorder (ADHD)",
      "passage_type": "example",
      "passage": "Exam Example A teacher reports that an 8-year-old girl daydreams frequently, loses her homework, and has difficulty following multi-step instructions, but is not disruptive in class. Her grades have been declining despite average intelligence. This presentation is most consistent with ADHD, predominantly inattentive presentation—a subtype that is more common in girls and often missed due to the absence of hyperactive-impulsive behaviors",
      "id": "LDEV-0089"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "building-competence.html",
      "chapter_title": "Building Competence — Middle Childhood",
      "section": "Piaget's Concrete Operational Stage",
      "passage_type": "paragraph",
      "passage": "The concrete operational stage (approximately ages 7–11) represents a major cognitive watershed. Children now think logically about concrete, tangible events. The hallmark limitations of preoperational thought—egocentrism, centration, irreversibility—give way to more flexible, organized reasoning. However, children at this stage still struggle with abstract or hypothetical problems",
      "id": "LDEV-0090"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "building-competence.html",
      "chapter_title": "Building Competence — Middle Childhood",
      "section": "Classification and Seriation",
      "passage_type": "paragraph",
      "passage": "Classification is the ability to group objects according to shared characteristics and to understand class inclusion relationships (e.g., understanding that \"dogs\" is a subset of \"animals\"). Seriation is the ability to arrange objects in a logical order along a quantitative dimension (e.g., shortest to tallest). Transitivity —the ability to infer the relationship between two items based on their relationships with a third item (if A > B and B > C, then A > C)—also emerges during this period",
      "id": "LDEV-0091"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "building-competence.html",
      "chapter_title": "Building Competence — Middle Childhood",
      "section": "Reversibility and Decentration",
      "passage_type": "paragraph",
      "passage": "Reversibility —the ability to mentally reverse an action or operation—is a key achievement that enables conservation. The concrete operational child understands that pouring water back into the original container would restore the original appearance. Decentration —the ability to consider multiple aspects of a situation simultaneously—allows the child to attend to both height and width when judging volume",
      "id": "LDEV-0092"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "building-competence.html",
      "chapter_title": "Building Competence — Middle Childhood",
      "section": "Kohlberg's Theory of Moral Development",
      "passage_type": "paragraph",
      "passage": "Lawrence Kohlberg (1927–1987) expanded upon Piaget's earlier work on moral judgment to propose a comprehensive stage theory of moral reasoning. Using moral dilemmas (most famously the Heinz dilemma), Kohlberg identified three levels of moral development, each containing two stages",
      "id": "LDEV-0093"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "building-competence.html",
      "chapter_title": "Building Competence — Middle Childhood",
      "section": "Gilligan's Ethic of Care",
      "passage_type": "paragraph",
      "passage": "Carol Gilligan (1982) critiqued Kohlberg's theory as reflecting a male-centered justice orientation and proposed an alternative ethic of care . Gilligan argued that women's moral reasoning tends to emphasize relationships, compassion, and responsibility to others, which Kohlberg's framework undervalued. She proposed three levels of moral development in women: (1) self-interest, (2) self-sacrifice and caring for others, and (3) a balanced ethic of care that includes both self and others",
      "id": "LDEV-0094"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "building-competence.html",
      "chapter_title": "Building Competence — Middle Childhood",
      "section": "Self-Concept and Self-Esteem",
      "passage_type": "paragraph",
      "passage": "During middle childhood, children develop increasingly complex and realistic self-representations. Unlike the overly positive and concrete self-descriptions of early childhood (\"I'm fast,\" \"I have a dog\"), school-age children begin to describe themselves in terms of psychological traits, social comparisons, and competencies across multiple domains",
      "id": "LDEV-0095"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "building-competence.html",
      "chapter_title": "Building Competence — Middle Childhood",
      "section": "Susan Harter's Self-Perception Model",
      "passage_type": "paragraph",
      "passage": "Susan Harter demonstrated that by middle childhood, self-esteem becomes differentiated into distinct domains: academic competence, social acceptance, athletic competence, physical appearance, and behavioral conduct. Global self-worth depends on both the child's self-perceived competence in each domain and the importance they attach to that domain. A child who values academics and performs well will have higher self-esteem than one who values academics but struggles",
      "id": "LDEV-0096"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "building-competence.html",
      "chapter_title": "Building Competence — Middle Childhood",
      "section": "Peer Relationships and Friendship",
      "passage_type": "paragraph",
      "passage": "Peer relationships become increasingly important during middle childhood, as children spend more time with age-mates and less time under direct adult supervision. The nature of friendships shifts from proximity-based and activity-based connections to relationships grounded in mutual trust, loyalty, and reciprocity",
      "id": "LDEV-0097"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "building-competence.html",
      "chapter_title": "Building Competence — Middle Childhood",
      "section": "Peer Status Categories",
      "passage_type": "paragraph",
      "passage": "Sociometric research has identified five peer status categories based on peer nominations: popular (many liked, few disliked), rejected (few liked, many disliked), neglected (few liked, few disliked), controversial (many liked, many disliked), and average . Rejected children are at highest risk for later adjustment difficulties, particularly rejected-aggressive children, who show elevated rates of externalizing problems and delinquency",
      "id": "LDEV-0098"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "building-competence.html",
      "chapter_title": "Building Competence — Middle Childhood",
      "section": "Learning Disabilities and ADHD",
      "passage_type": "paragraph",
      "passage": "Middle childhood is the period when learning disabilities and attention difficulties are most commonly identified, as the academic demands of formal schooling expose underlying cognitive processing weaknesses",
      "id": "LDEV-0099"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "building-competence.html",
      "chapter_title": "Building Competence — Middle Childhood",
      "section": "Specific Learning Disorders",
      "passage_type": "paragraph",
      "passage": "The DSM-5 uses the umbrella term Specific Learning Disorder with specifiers for the affected academic domain: reading (dyslexia), written expression (dysgraphia), and mathematics (dyscalculia). Key diagnostic features include academic skills substantially below age expectations despite adequate instruction, not better explained by intellectual disability, sensory deficits, or psychosocial adversity",
      "id": "LDEV-0100"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "building-competence.html",
      "chapter_title": "Building Competence — Middle Childhood",
      "section": "Attention-Deficit/Hyperactivity Disorder (ADHD)",
      "passage_type": "paragraph",
      "passage": "ADHD is characterized by a persistent pattern of inattention and/or hyperactivity-impulsivity that interferes with functioning. The DSM-5 identifies three presentations: predominantly inattentive, predominantly hyperactive-impulsive, and combined. The prevalence is approximately 5–7% of children, with boys diagnosed more frequently than girls (though girls are more likely to have the inattentive presentation, which may be underidentified)",
      "id": "LDEV-0101"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "cognitive-development.html",
      "chapter_title": "Cognitive Development",
      "section": "Piaget's Theory of Cognitive Development",
      "passage_type": "definition",
      "passage": "Key Terminology Schema: An organized pattern of thought or action used to interpret experience. Schemas become more sophisticated with development. Assimilation: Incorporating new information into existing schemas without changing the schema itself. Accommodation: Modifying existing schemas or creating new ones to incorporate information that does not fit current understanding. Equilibration: The self-regulatory process by which children balance assimilation and accommodation to achieve cognitive stability",
      "id": "LDEV-0102"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "cognitive-development.html",
      "chapter_title": "Cognitive Development",
      "section": "Core Components",
      "passage_type": "definition",
      "passage": "Key Terminology Encoding: The process of transforming sensory input into mental representations. Automaticity: The ability to perform a cognitive task with minimal conscious effort, freeing working memory resources for other tasks. Executive functions: Higher-order cognitive processes including inhibitory control, cognitive flexibility, and working memory updating, primarily mediated by the prefrontal cortex",
      "id": "LDEV-0103"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "cognitive-development.html",
      "chapter_title": "Cognitive Development",
      "section": "Stage 4: Formal Operational Stage (~11 Years and Onward)",
      "passage_type": "clinical_note",
      "passage": "Clinical Implications Understanding Piaget's stages is essential for clinical work with children. A child functioning in the preoperational stage may not benefit from cognitive-behavioral interventions requiring abstract thought. Clinicians should match therapeutic strategies to the child's cognitive level -- for example, using concrete behavioral techniques with younger children and introducing cognitive restructuring only when the child has reached concrete or formal operations",
      "id": "LDEV-0104"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "cognitive-development.html",
      "chapter_title": "Cognitive Development",
      "section": "Core Components",
      "passage_type": "clinical_note",
      "passage": "Clinical Implications Information processing models are particularly relevant for understanding and assessing learning disabilities, ADHD, and traumatic brain injury in children. Deficits in specific components (e.g., working memory, processing speed) can be identified through neuropsychological testing and targeted with specific interventions. For example, children with ADHD often show deficits in executive function that can be addressed through behavioral strategies and, when appropriate, pharmacological treatment",
      "id": "LDEV-0105"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "cognitive-development.html",
      "chapter_title": "Cognitive Development",
      "section": "Stage 1: Sensorimotor Stage (Birth to ~2 Years)",
      "passage_type": "example",
      "passage": "Clinical Example: Object Permanence Assessment A developmental psychologist assessing a 10-month-old hides a toy under Cloth A repeatedly. After the infant retrieves it several times, the psychologist moves the toy to Cloth B while the infant watches. The infant persists in searching under Cloth A -- demonstrating the classic A-not-B error , which Piaget attributed to incomplete object permanence. However, newer research  using looking-time paradigms suggests infants may have earlier object knowledge than Piaget believed",
      "id": "LDEV-0106"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "cognitive-development.html",
      "chapter_title": "Cognitive Development",
      "section": "Overview of Cognitive Development",
      "passage_type": "paragraph",
      "passage": "Cognitive development refers to the progressive changes in how individuals think, reason, and understand the world from infancy through adulthood. This chapter covers the major theoretical frameworks that have shaped our understanding of intellectual growth, including Piaget's stage theory, Vygotsky's sociocultural approach, information processing models, and neo-Piagetian extensions",
      "id": "LDEV-0107"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "cognitive-development.html",
      "chapter_title": "Cognitive Development",
      "section": "Overview of Cognitive Development",
      "passage_type": "paragraph",
      "passage": "For the EPPP, candidates must understand not only the stages and mechanisms proposed by each theory but also the key differences, criticisms, and clinical applications of these models. Cognitive development is foundational to understanding psychopathology, learning disabilities, and neuropsychological assessment across the lifespan",
      "id": "LDEV-0108"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "cognitive-development.html",
      "chapter_title": "Cognitive Development",
      "section": "Piaget's Theory of Cognitive Development",
      "passage_type": "paragraph",
      "passage": "Jean Piaget (1896-1980) proposed the most influential stage theory of cognitive development. He viewed children as active constructors of knowledge who build increasingly complex schemas through interaction with the environment. Piaget identified two complementary processes that drive cognitive growth",
      "id": "LDEV-0109"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "cognitive-development.html",
      "chapter_title": "Cognitive Development",
      "section": "Stage 1: Sensorimotor Stage (Birth to ~2 Years)",
      "passage_type": "paragraph",
      "passage": "During this stage, infants learn about the world through sensory experiences and motor actions. Piaget subdivided this stage into six substages, progressing from simple reflexes to the beginning of symbolic thought",
      "id": "LDEV-0110"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "cognitive-development.html",
      "chapter_title": "Cognitive Development",
      "section": "Stage 1: Sensorimotor Stage (Birth to ~2 Years)",
      "passage_type": "paragraph",
      "passage": "The major achievement of the sensorimotor stage is object permanence -- the understanding that objects continue to exist even when they cannot be seen, heard, or touched. Piaget observed that this develops gradually, typically consolidating around 8-12 months when infants begin searching for hidden objects (the A-not-B error occurs around this age)",
      "id": "LDEV-0111"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "cognitive-development.html",
      "chapter_title": "Cognitive Development",
      "section": "Stage 1: Sensorimotor Stage (Birth to ~2 Years)",
      "passage_type": "paragraph",
      "passage": "By the end of this stage, children demonstrate deferred imitation (imitating actions observed earlier) and the beginnings of mental representation, which marks the transition to preoperational thought",
      "id": "LDEV-0112"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "cognitive-development.html",
      "chapter_title": "Cognitive Development",
      "section": "Stage 2: Preoperational Stage (~2 to 7 Years)",
      "passage_type": "paragraph",
      "passage": "The preoperational stage is characterized by the rapid development of symbolic thought, including language and pretend play, but is limited by several cognitive constraints:",
      "id": "LDEV-0113"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "cognitive-development.html",
      "chapter_title": "Cognitive Development",
      "section": "Stage 2: Preoperational Stage (~2 to 7 Years)",
      "passage_type": "paragraph",
      "passage": "Children in this stage fail conservation tasks because they cannot simultaneously consider multiple dimensions (e.g., height and width of liquid in a container)",
      "id": "LDEV-0114"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "cognitive-development.html",
      "chapter_title": "Cognitive Development",
      "section": "Stage 3: Concrete Operational Stage (~7 to 11 Years)",
      "passage_type": "paragraph",
      "passage": "A critical limitation is that logical operations can only be applied to concrete , tangible problems -- abstract and hypothetical reasoning remains beyond reach",
      "id": "LDEV-0115"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "cognitive-development.html",
      "chapter_title": "Cognitive Development",
      "section": "Stage 4: Formal Operational Stage (~11 Years and Onward)",
      "passage_type": "paragraph",
      "passage": "The hallmark of this stage is hypothetico-deductive reasoning -- the ability to formulate hypotheses and systematically test them. Adolescents can think abstractly, reason about possibilities (not just realities), and engage in propositional logic",
      "id": "LDEV-0116"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "cognitive-development.html",
      "chapter_title": "Cognitive Development",
      "section": "Stage 4: Formal Operational Stage (~11 Years and Onward)",
      "passage_type": "paragraph",
      "passage": "Piaget used the pendulum problem to assess this stage: participants must isolate variables (string length, weight, force, height) to determine what controls the pendulum's speed. Formal operational thinkers test variables systematically rather than haphazardly",
      "id": "LDEV-0117"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "cognitive-development.html",
      "chapter_title": "Cognitive Development",
      "section": "Stage 4: Formal Operational Stage (~11 Years and Onward)",
      "passage_type": "paragraph",
      "passage": "Not all individuals reach formal operations, and research suggests this stage may be more culturally and educationally dependent than earlier stages. Cross-cultural studies indicate that formal operational thinking is not universal",
      "id": "LDEV-0118"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "cognitive-development.html",
      "chapter_title": "Cognitive Development",
      "section": "Vygotsky's Sociocultural Theory",
      "passage_type": "paragraph",
      "passage": "Lev Vygotsky (1896-1934) proposed that cognitive development is fundamentally a social process. Unlike Piaget, who emphasized the child as an independent explorer, Vygotsky argued that higher mental functions develop through social interaction and are mediated by cultural tools, especially language",
      "id": "LDEV-0119"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "cognitive-development.html",
      "chapter_title": "Cognitive Development",
      "section": "Vygotsky's Sociocultural Theory",
      "passage_type": "paragraph",
      "passage": "Vygotsky distinguished between elementary mental functions (innate capacities like attention and sensation) and higher mental functions (culturally mediated processes like logical memory and voluntary attention). The transformation from elementary to higher functions occurs through social interaction",
      "id": "LDEV-0120"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "cognitive-development.html",
      "chapter_title": "Cognitive Development",
      "section": "Vygotsky's Sociocultural Theory",
      "passage_type": "paragraph",
      "passage": "A central tenet of Vygotsky's theory is that language and thought begin as separate systems and merge around age 2, after which language serves as the primary tool for thought. This contrasts with Piaget's view that language merely reflects existing cognitive structures",
      "id": "LDEV-0121"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "cognitive-development.html",
      "chapter_title": "Cognitive Development",
      "section": "Information Processing Approach",
      "passage_type": "paragraph",
      "passage": "The information processing approach views cognitive development not as a series of qualitative stages but as a continuous process of improvement in the efficiency and capacity of mental processes. This perspective draws analogies between the human mind and computer processing",
      "id": "LDEV-0122"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "cognitive-development.html",
      "chapter_title": "Cognitive Development",
      "section": "Core Components",
      "passage_type": "paragraph",
      "passage": "Siegler's (1996) overlapping waves theory proposes that children have access to multiple strategies at any given age and gradually shift toward more efficient ones. This contrasts with Piaget's abrupt stage transitions and better explains the variability observed in children's problem-solving",
      "id": "LDEV-0123"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "cognitive-development.html",
      "chapter_title": "Cognitive Development",
      "section": "Neo-Piagetian Theories",
      "passage_type": "paragraph",
      "passage": "Neo-Piagetian theorists have attempted to integrate Piaget's stage framework with information processing concepts and address limitations of the original theory",
      "id": "LDEV-0124"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "cognitive-development.html",
      "chapter_title": "Cognitive Development",
      "section": "Robbie Case's Theory",
      "passage_type": "paragraph",
      "passage": "Case (1992) proposed that cognitive development progresses through stages similar to Piaget's but attributed stage transitions to increases in working memory capacity rather than the development of new logical structures. As children become more efficient at processing information (through practice and biological maturation), they free up working memory resources for more complex thinking",
      "id": "LDEV-0125"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "cognitive-development.html",
      "chapter_title": "Cognitive Development",
      "section": "Kurt Fischer's Skill Theory",
      "passage_type": "paragraph",
      "passage": "Fischer (1980) proposed that cognitive development involves the construction of increasingly complex skills organized into tiers (reflexive, sensorimotor, representational, and abstract). Development is domain-specific rather than domain-general -- a child may show advanced skills in one area while functioning at a lower level in another, a concept Fischer called developmental range",
      "id": "LDEV-0126"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "conception-prenatal.html",
      "chapter_title": "From Conception to First Breath",
      "section": "Genotype and Phenotype",
      "passage_type": "definition",
      "passage": "Genotype vs. Phenotype Genotype refers to the specific genetic makeup of an organism—the particular alleles inherited for a given trait. Phenotype refers to the observable characteristics that result from the interaction of the genotype with the environment. The same genotype can produce different phenotypes depending on environmental conditions",
      "id": "LDEV-0127"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "conception-prenatal.html",
      "chapter_title": "From Conception to First Breath",
      "section": "Chromosomal Abnormalities",
      "passage_type": "definition",
      "passage": "Phenylketonuria (PKU) An autosomal recessive metabolic disorder in which the enzyme needed to break down phenylalanine is absent. If untreated, the accumulation of phenylalanine leads to severe intellectual disability. PKU is a classic example of how environment (diet) can modify genetic expression—a restricted diet begun in infancy prevents cognitive impairment",
      "id": "LDEV-0128"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "conception-prenatal.html",
      "chapter_title": "From Conception to First Breath",
      "section": "Teratogens and Prenatal Risk Factors",
      "passage_type": "definition",
      "passage": "Principles of Teratogenic Effects 1. Susceptibility depends on the developmental stage at the time of exposure. 2. Each teratogen has a characteristic pattern of abnormalities (specificity). 3. The effect is dose-dependent: greater exposure typically produces more severe effects. 4. Teratogens differ in their mechanisms of action at the cellular level. 5. The genotype of the mother and the embryo/fetus influences susceptibility",
      "id": "LDEV-0129"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "conception-prenatal.html",
      "chapter_title": "From Conception to First Breath",
      "section": "Birth Complications",
      "passage_type": "definition",
      "passage": "Apgar Score Developed by Virginia Apgar in 1952, this rapid assessment is performed at 1 and 5 minutes after birth. Five criteria are each scored 0–2: A ppearance (skin color), P ulse (heart rate), G rimace (reflex irritability), A ctivity (muscle tone), and R espiration. Total scores range from 0–10, with 7–10 indicating good condition, 4–6 requiring some intervention, and 0–3 indicating a critical need for resuscitation",
      "id": "LDEV-0130"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "conception-prenatal.html",
      "chapter_title": "From Conception to First Breath",
      "section": "Chromosomal Abnormalities",
      "passage_type": "clinical_note",
      "passage": "Clinical Relevance PKU screening is performed via the newborn heel-prick test (Guthrie test) in all U.S. states. It illustrates a core principle: a genetic condition does not inevitably produce disability if the environmental trigger is removed early. This concept is central to understanding the gene-environment interaction framework",
      "id": "LDEV-0131"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "conception-prenatal.html",
      "chapter_title": "From Conception to First Breath",
      "section": "Embryonic Period (Weeks 3–8)",
      "passage_type": "clinical_note",
      "passage": "Clinical Note Neural tube defects (e.g., spina bifida, anencephaly) result from failure of the neural tube to close properly during weeks 3–4. Adequate maternal folic acid intake before and during early pregnancy significantly reduces this risk, which is why supplementation is recommended before conception",
      "id": "LDEV-0132"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "conception-prenatal.html",
      "chapter_title": "From Conception to First Breath",
      "section": "Other Teratogens",
      "passage_type": "clinical_note",
      "passage": "Clinical Application Clinicians should be aware that the effects of prenatal substance exposure may not be fully apparent at birth but can emerge as developmental delays in cognition, language, and behavior during childhood. A thorough developmental history should always include questions about prenatal exposures",
      "id": "LDEV-0133"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "conception-prenatal.html",
      "chapter_title": "From Conception to First Breath",
      "section": "Nutrition",
      "passage_type": "clinical_note",
      "passage": "Clinical Application When conducting a comprehensive developmental history, clinicians should inquire about maternal nutrition, stress, substance use, infections, and complications during pregnancy and delivery. These factors form an essential part of the biopsychosocial formulation for any developmental concern",
      "id": "LDEV-0134"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "conception-prenatal.html",
      "chapter_title": "From Conception to First Breath",
      "section": "Alcohol: Fetal Alcohol Spectrum Disorders",
      "passage_type": "example",
      "passage": "Exam Example A child presents with a smooth philtrum, thin upper lip, small head circumference, and significant learning difficulties. The mother reports heavy alcohol use during pregnancy. This presentation is most consistent with Fetal Alcohol Syndrome, the most severe manifestation of prenatal alcohol exposure",
      "id": "LDEV-0135"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "conception-prenatal.html",
      "chapter_title": "From Conception to First Breath",
      "section": "Neonatal Reflexes",
      "passage_type": "example",
      "passage": "Exam Example A pediatric neurologist evaluates a 10-month-old and notes that the Babinski reflex is still present. While the Babinski reflex is normal in infants, its persistence beyond approximately 12 months (or its reappearance in adults) may indicate upper motor neuron damage and warrants further neurological investigation",
      "id": "LDEV-0136"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "conception-prenatal.html",
      "chapter_title": "From Conception to First Breath",
      "section": "Neonatal Reflexes",
      "passage_type": "example",
      "passage": "Exam Example A neonate scored 3 at 1 minute and 6 at 5 minutes on the Apgar. The low initial score indicated the need for immediate medical intervention, while the improvement to 6 suggests partial response to resuscitation. The 5-minute score is the stronger predictor of long-term outcomes",
      "id": "LDEV-0137"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "conception-prenatal.html",
      "chapter_title": "From Conception to First Breath",
      "section": "Foundations of Genetics",
      "passage_type": "paragraph",
      "passage": "Human development begins at conception, when a sperm cell fertilizes an ovum to form a single-celled zygote containing 46 chromosomes—23 from each parent. Understanding the basic principles of genetics is essential for the EPPP, particularly as they relate to the inheritance of traits, genetic disorders, and the interplay between genotype and phenotype",
      "id": "LDEV-0138"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "conception-prenatal.html",
      "chapter_title": "From Conception to First Breath",
      "section": "Patterns of Inheritance",
      "passage_type": "paragraph",
      "passage": "In dominant-recessive inheritance , a single dominant allele is sufficient to produce the trait in the phenotype, whereas the recessive trait appears only when the individual is homozygous recessive (carries two copies of the recessive allele). Examples include Huntington's disease (dominant) and cystic fibrosis (recessive)",
      "id": "LDEV-0139"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "conception-prenatal.html",
      "chapter_title": "From Conception to First Breath",
      "section": "Patterns of Inheritance",
      "passage_type": "paragraph",
      "passage": "Many traits follow more complex patterns, including codominance (both alleles fully expressed, as in AB blood type), incomplete dominance (blended expression), and polygenic inheritance (traits influenced by many genes, such as intelligence and temperament)",
      "id": "LDEV-0140"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "conception-prenatal.html",
      "chapter_title": "From Conception to First Breath",
      "section": "Stages of Prenatal Development",
      "passage_type": "paragraph",
      "passage": "Prenatal development unfolds across three distinct periods, each characterized by unique milestones and vulnerabilities. The timing of harmful exposures determines which structures are most affected, a principle known as organogenesis timing",
      "id": "LDEV-0141"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "conception-prenatal.html",
      "chapter_title": "From Conception to First Breath",
      "section": "Germinal Period (Weeks 0–2)",
      "passage_type": "paragraph",
      "passage": "The germinal period begins at fertilization and extends through implantation in the uterine wall (approximately days 10–14). During this phase, the zygote undergoes rapid cell division (cleavage), forming a blastocyst . The inner cell mass will become the embryo, while the outer layer (trophoblast) develops into support structures including the placenta. Approximately 50–60% of fertilized ova fail to implant successfully",
      "id": "LDEV-0142"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "conception-prenatal.html",
      "chapter_title": "From Conception to First Breath",
      "section": "Embryonic Period (Weeks 3–8)",
      "passage_type": "paragraph",
      "passage": "The embryonic period is the most critical phase of prenatal development. During these six weeks, all major organ systems begin to form through a process called organogenesis . The three germ layers—ectoderm (nervous system, skin), mesoderm (muscles, bones, circulatory system), and endoderm (digestive and respiratory systems)—differentiate into specialized tissues. The neural tube, which will become the brain and spinal cord, closes by approximately day 28",
      "id": "LDEV-0143"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "conception-prenatal.html",
      "chapter_title": "From Conception to First Breath",
      "section": "Fetal Period (Weeks 9–Birth)",
      "passage_type": "paragraph",
      "passage": "The fetal period is characterized by rapid growth, refinement of organ systems, and increasing behavioral complexity. By week 12, the fetus can move its limbs. By weeks 22–26, the age of viability is approached—the point at which survival outside the womb becomes possible with intensive medical support. During the third trimester, the brain undergoes rapid development, with extensive synapse formation and the beginnings of myelination",
      "id": "LDEV-0144"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "conception-prenatal.html",
      "chapter_title": "From Conception to First Breath",
      "section": "Teratogens and Prenatal Risk Factors",
      "passage_type": "paragraph",
      "passage": "A teratogen is any environmental agent that can cause damage to the developing embryo or fetus. The impact of a teratogen depends on several factors: the dose and duration of exposure, the genetic susceptibility of the organism, the timing of exposure (organ systems are most vulnerable during their period of most rapid formation), and the presence of other risk or protective factors",
      "id": "LDEV-0145"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "conception-prenatal.html",
      "chapter_title": "From Conception to First Breath",
      "section": "Alcohol: Fetal Alcohol Spectrum Disorders",
      "passage_type": "paragraph",
      "passage": "Fetal Alcohol Spectrum Disorders (FASD) represent a continuum of effects resulting from prenatal alcohol exposure. The most severe form, Fetal Alcohol Syndrome (FAS) , is characterized by facial dysmorphology (smooth philtrum, thin upper lip, short palpebral fissures), growth retardation, and central nervous system dysfunction. Alcohol is the leading known preventable cause of intellectual disability in the Western world",
      "id": "LDEV-0146"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "conception-prenatal.html",
      "chapter_title": "From Conception to First Breath",
      "section": "Other Teratogens",
      "passage_type": "paragraph",
      "passage": "Additional teratogens of note include: tobacco (associated with low birth weight, preterm delivery, and SIDS risk); cocaine (vasoconstriction leading to placental abruption, preterm birth); prescription medications such as thalidomide (limb malformations), isotretinoin/Accutane (craniofacial, cardiac, and CNS defects), and certain antiepileptic drugs (e.g., valproic acid, associated with neural tube defects); and environmental toxins such as lead and mercury",
      "id": "LDEV-0147"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "conception-prenatal.html",
      "chapter_title": "From Conception to First Breath",
      "section": "Birth and Neonatal Assessment",
      "passage_type": "paragraph",
      "passage": "The transition from intrauterine to extrauterine life is a critical period. Complications during labor and delivery can have lasting developmental consequences, making rapid assessment of the newborn essential",
      "id": "LDEV-0148"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "conception-prenatal.html",
      "chapter_title": "From Conception to First Breath",
      "section": "Birth Complications",
      "passage_type": "paragraph",
      "passage": "Key complications include anoxia (oxygen deprivation), which can lead to brain damage if prolonged; preterm birth (before 37 weeks gestation), associated with increased risk for respiratory distress, intraventricular hemorrhage, and later developmental delays; and low birth weight (below 2,500 grams), which can result from either prematurity or intrauterine growth restriction (IUGR)",
      "id": "LDEV-0149"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "conception-prenatal.html",
      "chapter_title": "From Conception to First Breath",
      "section": "Neonatal Reflexes",
      "passage_type": "paragraph",
      "passage": "Newborns arrive equipped with a set of primitive reflexes that serve survival functions and provide diagnostic information about neurological integrity. The presence, strength, and eventual disappearance of these reflexes follow predictable timetables",
      "id": "LDEV-0150"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "conception-prenatal.html",
      "chapter_title": "From Conception to First Breath",
      "section": "Maternal Factors Affecting Prenatal Development",
      "passage_type": "paragraph",
      "passage": "Beyond specific teratogens, a range of maternal characteristics and conditions influence prenatal development. These factors interact with one another and with genetic susceptibility to produce cumulative effects on the developing organism",
      "id": "LDEV-0151"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "conception-prenatal.html",
      "chapter_title": "From Conception to First Breath",
      "section": "Maternal Age",
      "passage_type": "paragraph",
      "passage": "Advanced maternal age (typically defined as 35 or older at delivery) is associated with increased risk of chromosomal abnormalities, particularly Down syndrome , due to age-related changes in oocyte quality. The risk of trisomy 21 rises from approximately 1 in 1,250 at age 25 to 1 in 100 at age 40. Adolescent mothers face increased risks related to inadequate prenatal care, nutritional deficiencies, and social stressors",
      "id": "LDEV-0152"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "conception-prenatal.html",
      "chapter_title": "From Conception to First Breath",
      "section": "Maternal Stress",
      "passage_type": "paragraph",
      "passage": "Chronic maternal stress during pregnancy elevates cortisol levels, which can cross the placental barrier and affect fetal development. Research has linked prenatal stress to preterm birth, low birth weight, and later behavioral and emotional difficulties in offspring, including increased reactivity of the hypothalamic-pituitary-adrenal (HPA) axis",
      "id": "LDEV-0153"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "conception-prenatal.html",
      "chapter_title": "From Conception to First Breath",
      "section": "Nutrition",
      "passage_type": "paragraph",
      "passage": "Adequate maternal nutrition is essential for optimal prenatal development. Key nutrients include folic acid (prevents neural tube defects), iron (supports oxygen transport and brain development), iodine (critical for thyroid function and cognitive development), and omega-3 fatty acids (support neural development). Severe maternal malnutrition is associated with low birth weight, cognitive impairment, and increased vulnerability to later disease",
      "id": "LDEV-0154"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "discovering-early-childhood.html",
      "chapter_title": "Discovering the World — Early Childhood",
      "section": "Symbolic Function Substage (Ages 2–4)",
      "passage_type": "definition",
      "passage": "Egocentrism The inability to take another person's perspective or to understand that others may see, think, or feel differently than oneself. Piaget demonstrated this with the three-mountain task , in which preoperational children selected their own view of a three-dimensional display rather than the view that would be seen by a doll placed on the other side",
      "id": "LDEV-0155"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "discovering-early-childhood.html",
      "chapter_title": "Discovering the World — Early Childhood",
      "section": "Symbolic Function Substage (Ages 2–4)",
      "passage_type": "definition",
      "passage": "Animism The belief that inanimate objects are alive and have feelings and intentions. A preoperational child might say that the sun is \"happy\" or that a rock \"wants\" to stay in one place. This reflects the child's difficulty in distinguishing between animate and inanimate entities",
      "id": "LDEV-0156"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "discovering-early-childhood.html",
      "chapter_title": "Discovering the World — Early Childhood",
      "section": "Parten's Stages of Play",
      "passage_type": "definition",
      "passage": "Parallel Play vs. Associative Play The distinction between parallel and associative play is frequently tested. In parallel play , children play side by side with similar materials but do not interact directly (e.g., two children both building with blocks at the same table but constructing independent structures). In associative play , children interact, share materials, and talk about their activity, but there is no organized division of labor or shared goal (e.g., children playing in a sandbox together, sharing shovels and commenting on each other's digging, but not building the same thing)",
      "id": "LDEV-0157"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "discovering-early-childhood.html",
      "chapter_title": "Discovering the World — Early Childhood",
      "section": "Baumrind's Parenting Styles",
      "passage_type": "definition",
      "passage": "Authoritative Parenting Characterized by high expectations paired with high warmth, open communication, and reasoned discipline. Authoritative parents set clear standards while encouraging autonomy. This style is consistently associated with the most positive developmental outcomes across Western cultures",
      "id": "LDEV-0158"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "discovering-early-childhood.html",
      "chapter_title": "Discovering the World — Early Childhood",
      "section": "Vygotsky's Private Speech",
      "passage_type": "definition",
      "passage": "Private Speech The self-directed speech that children use to plan, guide, and regulate their behavior. Vygotsky viewed private speech as a bridge between social speech and inner (silent) thought. Rather than being egocentric (as Piaget characterized it), private speech serves a critical self-regulatory function. It increases during challenging tasks and gradually becomes internalized as inner speech by around age 7",
      "id": "LDEV-0159"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "discovering-early-childhood.html",
      "chapter_title": "Discovering the World — Early Childhood",
      "section": "False Belief Understanding",
      "passage_type": "clinical_note",
      "passage": "Clinical Relevance Deficits in Theory of Mind are a hallmark feature of Autism Spectrum Disorder (ASD) . Baron-Cohen and colleagues proposed that the social communication difficulties seen in autism reflect an impaired \"mindblindness\"—a fundamental difficulty in understanding that others have mental states. However, ToM deficits are not unique to ASD and can also be observed in other conditions affecting social cognition",
      "id": "LDEV-0160"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "discovering-early-childhood.html",
      "chapter_title": "Discovering the World — Early Childhood",
      "section": "Parten's Stages of Play",
      "passage_type": "clinical_note",
      "passage": "Clinical Relevance While Parten's stages suggest a developmental progression, contemporary research recognizes that all forms of play persist across the preschool years and beyond. Solitary play in older preschoolers is not inherently concerning—it depends on context and the nature of the play. Constructive solitary play (building, drawing) is associated with positive outcomes, while reticent behavior (hovering near peers without joining) may signal social anxiety. Clinicians assessing social development in young children should observe the quality and nature of play, not just its social level",
      "id": "LDEV-0161"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "discovering-early-childhood.html",
      "chapter_title": "Discovering the World — Early Childhood",
      "section": "Baumrind's Parenting Styles",
      "passage_type": "clinical_note",
      "passage": "Clinical Consideration Research on parenting styles was initially conducted with predominantly White, middle-class American families. Cross-cultural studies have revealed that authoritarian parenting may not carry the same negative associations in all cultural contexts. For example, in some collectivist cultures and in high-risk neighborhoods, authoritarian parenting may serve a protective function. Clinicians should consider cultural context when evaluating parenting practices",
      "id": "LDEV-0162"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "discovering-early-childhood.html",
      "chapter_title": "Discovering the World — Early Childhood",
      "section": "Vygotsky's Private Speech",
      "passage_type": "clinical_note",
      "passage": "Clinical Application Self-instructional training , a cognitive-behavioral intervention for impulsive children, is directly based on Vygotsky's theory of private speech. Children are taught to talk themselves through problems, first aloud, then in a whisper, and finally silently. This technique has been used in the treatment of ADHD and conduct problems",
      "id": "LDEV-0163"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "discovering-early-childhood.html",
      "chapter_title": "Discovering the World — Early Childhood",
      "section": "Intuitive Thought Substage (Ages 4–7)",
      "passage_type": "example",
      "passage": "Exam Example A 4-year-old is shown two identical rows of coins. When one row is spread apart to appear longer, the child says it now has \"more\" coins. This conservation failure results from centration (focusing on the length of the row) and irreversibility (inability to mentally \"push\" the coins back together)",
      "id": "LDEV-0164"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "discovering-early-childhood.html",
      "chapter_title": "Discovering the World — Early Childhood",
      "section": "False Belief Understanding",
      "passage_type": "example",
      "passage": "Exam Example A 3-year-old watches as a candy box is filled with crayons. When asked what another child (who hasn't seen inside) would think is in the box, the 3-year-old says \"crayons.\" This failure to attribute a false belief to the other child indicates that Theory of Mind has not yet fully developed",
      "id": "LDEV-0165"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "discovering-early-childhood.html",
      "chapter_title": "Discovering the World — Early Childhood",
      "section": "Play and Social Development",
      "passage_type": "example",
      "passage": "Exam Example A preschool teacher observes two 3-year-olds sitting at the same table, both drawing with crayons. They occasionally glance at each other's pictures and chat about their drawings, but each child is creating their own picture with no shared plan. This behavior is most consistent with Parten's associative play—there is social interaction and shared materials, but no organized common goal",
      "id": "LDEV-0166"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "discovering-early-childhood.html",
      "chapter_title": "Discovering the World — Early Childhood",
      "section": "Baumrind's Parenting Styles",
      "passage_type": "example",
      "passage": "Exam Example A parent sets clear rules about homework and bedtime but explains the reasons behind the rules, listens to the child's perspective, and allows age-appropriate choices. This parent is best described as authoritative—high in both demandingness and responsiveness",
      "id": "LDEV-0167"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "discovering-early-childhood.html",
      "chapter_title": "Discovering the World — Early Childhood",
      "section": "Piaget's Preoperational Stage",
      "passage_type": "paragraph",
      "passage": "The preoperational stage (approximately ages 2–7) is marked by tremendous cognitive growth alongside characteristic limitations. The child gains the ability to represent objects and events mentally through symbols, language, and pretend play, but is not yet capable of logical operations",
      "id": "LDEV-0168"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "discovering-early-childhood.html",
      "chapter_title": "Discovering the World — Early Childhood",
      "section": "Symbolic Function Substage (Ages 2–4)",
      "passage_type": "paragraph",
      "passage": "The symbolic function substage is characterized by the child's emerging ability to use mental symbols, words, and images to represent objects and events that are not physically present. This capacity enables pretend play (using a block as a telephone), drawing, and language use. However, thinking at this stage is limited by egocentrism and animism",
      "id": "LDEV-0169"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "discovering-early-childhood.html",
      "chapter_title": "Discovering the World — Early Childhood",
      "section": "Intuitive Thought Substage (Ages 4–7)",
      "passage_type": "paragraph",
      "passage": "During the intuitive thought substage , children begin to use primitive reasoning and want to know the answers to all sorts of questions. However, their thinking remains constrained by several key limitations:",
      "id": "LDEV-0170"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "discovering-early-childhood.html",
      "chapter_title": "Discovering the World — Early Childhood",
      "section": "Theory of Mind",
      "passage_type": "paragraph",
      "passage": "Theory of Mind (ToM) refers to the understanding that other people have mental states—beliefs, desires, intentions, knowledge—that may differ from one's own and that may differ from reality. The development of ToM represents one of the most important cognitive achievements of early childhood",
      "id": "LDEV-0171"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "discovering-early-childhood.html",
      "chapter_title": "Discovering the World — Early Childhood",
      "section": "False Belief Understanding",
      "passage_type": "paragraph",
      "passage": "The classic test for ToM is the false belief task . In the most widely used version (the Sally-Anne task, Baron-Cohen, Leslie, & Frith, 1985), a child watches as Sally places a marble in a basket and leaves. While Sally is away, Anne moves the marble to a box. The child is asked where Sally will look for the marble when she returns. Children who understand false belief correctly indicate that Sally will look in the basket (where she left it), while those lacking ToM say she will look in the box (where it actually is)",
      "id": "LDEV-0172"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "discovering-early-childhood.html",
      "chapter_title": "Discovering the World — Early Childhood",
      "section": "False Belief Understanding",
      "passage_type": "paragraph",
      "passage": "Most typically developing children pass false belief tasks between ages 4 and 5. Prior to this age, children struggle to distinguish between what they know and what another person knows—a cognitive limitation closely related to Piaget's concept of egocentrism",
      "id": "LDEV-0173"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "discovering-early-childhood.html",
      "chapter_title": "Discovering the World — Early Childhood",
      "section": "Parten's Stages of Play",
      "passage_type": "paragraph",
      "passage": "Mildred Parten (1932) conducted pioneering observational research on children's social play, identifying six categories that reflect increasing levels of social involvement. Parten's classification describes a developmental progression from nonsocial to highly social forms of play, typically observed during the preschool years (ages 2–5)",
      "id": "LDEV-0174"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "discovering-early-childhood.html",
      "chapter_title": "Discovering the World — Early Childhood",
      "section": "Play and Social Development",
      "passage_type": "paragraph",
      "passage": "The progression through Parten's stages reflects the child's growing capacity for social cognition , perspective-taking, and behavioral regulation. Cooperative play requires Theory of Mind (understanding others' intentions and desires), executive function (inhibiting impulses, following rules), and language skills (negotiating roles, resolving conflicts). Play is therefore not \"just play\"—it is a critical context for developing social competence",
      "id": "LDEV-0175"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "discovering-early-childhood.html",
      "chapter_title": "Discovering the World — Early Childhood",
      "section": "Baumrind's Parenting Styles",
      "passage_type": "paragraph",
      "passage": "Diana Baumrind (1966, 1971) identified three parenting styles based on two dimensions: demandingness (the degree of behavioral control and expectations for maturity) and responsiveness (the degree of warmth, acceptance, and sensitivity to the child's needs). A fourth style was later added by Maccoby and Martin (1983)",
      "id": "LDEV-0176"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "discovering-early-childhood.html",
      "chapter_title": "Discovering the World — Early Childhood",
      "section": "Language Explosion and Private Speech",
      "passage_type": "paragraph",
      "passage": "Early childhood witnesses a language explosion . Vocabulary grows from approximately 200 words at age 2 to roughly 10,000 words by age 6. Children master complex grammatical structures, begin to use past tense and plurals (sometimes overgeneralizing rules, as in \"goed\" or \"mouses\"), and engage in increasingly sophisticated conversations",
      "id": "LDEV-0177"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "discovering-early-childhood.html",
      "chapter_title": "Discovering the World — Early Childhood",
      "section": "Overregularization",
      "passage_type": "paragraph",
      "passage": "Overregularization occurs when children apply grammatical rules to irregular forms (e.g., \"runned\" instead of \"ran,\" \"foots\" instead of \"feet\"). Paradoxically, this type of error reflects cognitive progress—the child has internalized a grammatical rule and is applying it systematically, even where exceptions apply",
      "id": "LDEV-0178"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "discovering-early-childhood.html",
      "chapter_title": "Discovering the World — Early Childhood",
      "section": "Vygotsky's Private Speech",
      "passage_type": "paragraph",
      "passage": "Research supports Vygotsky's view: children use more private speech when tasks are moderately difficult, and private speech use is positively correlated with task performance. Children with ADHD and learning difficulties often show delayed internalization of private speech",
      "id": "LDEV-0179"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "discovering-early-childhood.html",
      "chapter_title": "Discovering the World — Early Childhood",
      "section": "Gender Development",
      "passage_type": "paragraph",
      "passage": "Early childhood is a period of rapid gender development. By age 2–3, most children can label themselves and others as male or female. By age 5–6, they demonstrate strong gender-typed preferences in play, clothing, and peer interactions. Several theoretical perspectives explain these developments",
      "id": "LDEV-0180"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "discovering-early-childhood.html",
      "chapter_title": "Discovering the World — Early Childhood",
      "section": "Gender Schema Theory",
      "passage_type": "paragraph",
      "passage": "Gender schema theory  proposes that children develop gender schemas —organized networks of knowledge and expectations about what it means to be male or female in their culture. Once a basic gender identity is established, children actively filter new information through these schemas, attending to and remembering gender-consistent information more than gender-inconsistent information",
      "id": "LDEV-0181"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "discovering-early-childhood.html",
      "chapter_title": "Discovering the World — Early Childhood",
      "section": "Social Learning Theory",
      "passage_type": "paragraph",
      "passage": "From the perspective of social learning theory , gender development results from observation, imitation, and reinforcement. Children observe gender-typed behavior in models (parents, peers, media), imitate same-sex models, and receive differential reinforcement for gender-appropriate and gender-inappropriate behavior",
      "id": "LDEV-0182"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "family-influences.html",
      "chapter_title": "School & Family Influences",
      "section": "Dose-Response Relationship",
      "passage_type": "clinical_note",
      "passage": "Clinical Implications The ACEs framework has profound implications for clinical practice. Trauma-informed care approaches recognize that many presenting problems (substance use, depression, relationship difficulties, chronic health conditions) may have roots in childhood adversity. Clinicians should routinely screen for ACEs while being sensitive to the potential for retraumatization. The ACEs framework also supports a shift from asking \"What is wrong with you?\" to \"What happened to you?\"",
      "id": "LDEV-0183"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "family-influences.html",
      "chapter_title": "School & Family Influences",
      "section": "Overview of Family and Social Influences",
      "passage_type": "paragraph",
      "passage": "The family is the primary context for development, but children are also shaped by schools, peers, neighborhoods, and broader cultural systems. This chapter covers parenting styles, the effects of family transitions (especially divorce), sibling and peer relationships, and Bronfenbrenner's ecological systems theory, which provides a comprehensive framework for understanding how multiple environmental layers interact to influence development",
      "id": "LDEV-0184"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "family-influences.html",
      "chapter_title": "School & Family Influences",
      "section": "Overview of Family and Social Influences",
      "passage_type": "paragraph",
      "passage": "For the EPPP, candidates should understand the research on parenting dimensions and their associated outcomes, the factors that mediate children's adjustment to divorce, and how contextual influences operate at multiple levels",
      "id": "LDEV-0185"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "family-influences.html",
      "chapter_title": "School & Family Influences",
      "section": "Baumrind's Parenting Styles",
      "passage_type": "paragraph",
      "passage": "Diana Baumrind (1966, 1971) identified parenting styles based on two key dimensions: demandingness (control, expectations for mature behavior) and responsiveness (warmth, acceptance, sensitivity to the child's needs). Maccoby and Martin (1983) later expanded the framework to include a fourth style",
      "id": "LDEV-0186"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "family-influences.html",
      "chapter_title": "School & Family Influences",
      "section": "Effects of Divorce on Children",
      "passage_type": "paragraph",
      "passage": "Approximately 40-50% of first marriages in the United States end in divorce. Research by Hetherington (Hetherington & Kelly, 2002) and Amato (2001) has clarified both the risks and the protective factors for children experiencing parental divorce",
      "id": "LDEV-0187"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "family-influences.html",
      "chapter_title": "School & Family Influences",
      "section": "Long-Term Effects",
      "passage_type": "paragraph",
      "passage": "However, it is critical to note that the majority of children from divorced families are well-adjusted . Amato's (2001) meta-analysis found that effect sizes are small, and that much of the variance attributed to divorce is actually due to pre-divorce conflict, economic decline, and disrupted parenting",
      "id": "LDEV-0188"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "family-influences.html",
      "chapter_title": "School & Family Influences",
      "section": "Adverse Childhood Experiences (ACEs) and Resilience",
      "passage_type": "paragraph",
      "passage": "The Adverse Childhood Experiences (ACEs) Study , a landmark collaboration between the CDC and Kaiser Permanente involving over 17,000 adults, demonstrated a powerful dose-response relationship between adverse childhood experiences and negative health outcomes in adulthood. This study fundamentally changed how clinicians and public health professionals understand the long-term consequences of childhood adversity",
      "id": "LDEV-0189"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "family-influences.html",
      "chapter_title": "School & Family Influences",
      "section": "Types of ACEs",
      "passage_type": "paragraph",
      "passage": "The original ACE questionnaire assessed 10 categories of adverse experiences occurring before age 18, grouped into three domains:",
      "id": "LDEV-0190"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "family-influences.html",
      "chapter_title": "School & Family Influences",
      "section": "Dose-Response Relationship",
      "passage_type": "paragraph",
      "passage": "The ACE score (0–10) counts the number of categories of adverse experiences. The study's central finding was a graded dose-response relationship : as the ACE score increases, the risk for a wide range of negative adult outcomes increases in a stepwise fashion. Compared to individuals with an ACE score of 0, those with a score of 4 or more showed:",
      "id": "LDEV-0191"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "family-influences.html",
      "chapter_title": "School & Family Influences",
      "section": "Dose-Response Relationship",
      "passage_type": "paragraph",
      "passage": "Critically, ACEs are common : approximately two-thirds of participants reported at least one ACE, and about one in eight reported four or more. ACEs also tend to co-occur—experiencing one category increases the likelihood of experiencing others",
      "id": "LDEV-0192"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "family-influences.html",
      "chapter_title": "School & Family Influences",
      "section": "Resilience and Protective Factors",
      "passage_type": "paragraph",
      "passage": "Despite the powerful impact of ACEs, many individuals exposed to adversity demonstrate resilience —the capacity to adapt successfully in the face of significant adversity, threat, or trauma. Resilience is not an all-or-nothing trait but a dynamic process influenced by the interaction between risk and protective factors",
      "id": "LDEV-0193"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "family-influences.html",
      "chapter_title": "School & Family Influences",
      "section": "Sibling Relationships",
      "passage_type": "paragraph",
      "passage": "Siblings serve as important socialization agents, providing opportunities for companionship, conflict resolution, social skills practice, and emotional support. Key findings from the research include:",
      "id": "LDEV-0194"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "family-influences.html",
      "chapter_title": "School & Family Influences",
      "section": "Peer Influence",
      "passage_type": "paragraph",
      "passage": "Peers become increasingly important socializing agents from middle childhood through adolescence. Judith Rich Harris (1998) controversially argued in The Nurture Assumption that peers are more influential than parents in personality development, though most developmental psychologists view peers and parents as influencing different domains",
      "id": "LDEV-0195"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "family-influences.html",
      "chapter_title": "School & Family Influences",
      "section": "Family Life Cycle",
      "passage_type": "paragraph",
      "passage": "Betty Carter and Monica McGoldrick (1989, 2005) developed one of the most influential frameworks for understanding family development over time. Their Family Life Cycle model describes a sequence of stages through which families typically progress, each involving specific emotional transitions and developmental tasks that the family must negotiate",
      "id": "LDEV-0196"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "family-influences.html",
      "chapter_title": "School & Family Influences",
      "section": "Bronfenbrenner's Ecological Systems Theory",
      "passage_type": "paragraph",
      "passage": "Urie Bronfenbrenner (1979) proposed that development occurs within a series of nested environmental systems, each influencing the other. This model emphasizes that children's development cannot be understood in isolation from the multiple contexts in which they live",
      "id": "LDEV-0197"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "language-development.html",
      "chapter_title": "Language Development",
      "section": "Critical and Sensitive Periods for Language",
      "passage_type": "clinical_note",
      "passage": "Clinical Implications The sensitive period concept has profound implications for clinical practice. Early identification and intervention for hearing impairment, autism spectrum disorder, and specific language impairment are critical because the window for optimal language development is limited. Children with cochlear implants show the best language outcomes when implanted before age 2 . Similarly, early intensive behavioral intervention for children with ASD shows the strongest effects on language outcomes when initiated before age 3",
      "id": "LDEV-0198"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "language-development.html",
      "chapter_title": "Language Development",
      "section": "Overview of Language Development",
      "passage_type": "paragraph",
      "passage": "Language acquisition is one of the most remarkable achievements of early childhood. By age 5, most children have mastered the basic grammar of their native language and possess a vocabulary of several thousand words -- all without formal instruction. Understanding the components of language, the milestones of acquisition, and the major theoretical perspectives is essential for EPPP preparation",
      "id": "LDEV-0199"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "language-development.html",
      "chapter_title": "Language Development",
      "section": "Overview of Language Development",
      "passage_type": "paragraph",
      "passage": "Language development intersects with cognitive development, social development, and clinical assessment. Delays or disorders in language are among the most common reasons for referral in pediatric and educational settings",
      "id": "LDEV-0200"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "language-development.html",
      "chapter_title": "Language Development",
      "section": "Components of Language",
      "passage_type": "paragraph",
      "passage": "For the EPPP, it is critical to distinguish between receptive language (comprehension -- understanding what others say) and expressive language (production -- generating speech). Receptive language consistently develops ahead of expressive language; children understand far more words than they can produce",
      "id": "LDEV-0201"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "language-development.html",
      "chapter_title": "Language Development",
      "section": "Nativist Theory: Chomsky's Language Acquisition Device",
      "passage_type": "paragraph",
      "passage": "Noam Chomsky (1965) argued that humans are biologically equipped with an innate Language Acquisition Device (LAD) -- a neurological mechanism that contains a Universal Grammar (UG) , the set of grammatical principles common to all human languages. Key arguments for the nativist position include:",
      "id": "LDEV-0202"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "language-development.html",
      "chapter_title": "Language Development",
      "section": "Behaviorist Theory: Skinner's Verbal Behavior",
      "passage_type": "paragraph",
      "passage": "B. F. Skinner (1957) proposed in Verbal Behavior that language is acquired through the same learning principles as any other behavior: operant conditioning (reinforcement and shaping) and imitation . Skinner classified verbal behavior into functional categories:",
      "id": "LDEV-0203"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "language-development.html",
      "chapter_title": "Language Development",
      "section": "Behaviorist Theory: Skinner's Verbal Behavior",
      "passage_type": "paragraph",
      "passage": "Chomsky's (1959) devastating review of Verbal Behavior argued that reinforcement and imitation cannot account for the creativity and rule-governed nature of language. This review is considered one of the pivotal moments in the cognitive revolution",
      "id": "LDEV-0204"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "language-development.html",
      "chapter_title": "Language Development",
      "section": "Critical and Sensitive Periods for Language",
      "passage_type": "paragraph",
      "passage": "Lenneberg (1967) proposed a critical period hypothesis for language acquisition, suggesting that the ability to acquire a first language natively is constrained to roughly the first 12 years of life, after which language acquisition becomes qualitatively different and more effortful",
      "id": "LDEV-0205"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "language-development.html",
      "chapter_title": "Language Development",
      "section": "Critical and Sensitive Periods for Language",
      "passage_type": "paragraph",
      "passage": "Most contemporary researchers prefer the term sensitive period rather than \"critical period,\" recognizing that language learning remains possible beyond this window but becomes progressively more difficult and less likely to reach native levels",
      "id": "LDEV-0206"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "long-horizon-adulthood.html",
      "chapter_title": "The Long Horizon — Adulthood & Aging",
      "section": "Arnett's Emerging Adulthood",
      "passage_type": "definition",
      "passage": "Emerging Adulthood Jeffrey Jensen Arnett (2000) proposed that the period from approximately ages 18–25 constitutes a distinct developmental stage in industrialized societies called emerging adulthood . This phase is characterized by five features: (1) identity exploration (especially in love, work, and worldviews), (2) instability (frequent changes in residence, relationships, and employment), (3) self-focus, (4) feeling \"in between\" adolescence and adulthood, and (5) a sense of possibilities and optimism about the future",
      "id": "LDEV-0207"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "long-horizon-adulthood.html",
      "chapter_title": "The Long Horizon — Adulthood & Aging",
      "section": "Key Eras and Transitions",
      "passage_type": "definition",
      "passage": "Midlife Crisis Levinson proposed that the midlife transition (ages 40–45) often involves a period of questioning and potential turmoil as individuals confront the gap between youthful dreams and reality. However, subsequent research suggests that a full-blown \"midlife crisis\" is not universal—only about 10–25% of adults report a crisis in middle adulthood. Most experience a more gradual midlife transition rather than a dramatic upheaval",
      "id": "LDEV-0208"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "long-horizon-adulthood.html",
      "chapter_title": "The Long Horizon — Adulthood & Aging",
      "section": "Cognitive Aging: Fluid and Crystallized Intelligence",
      "passage_type": "definition",
      "passage": "Fluid Intelligence (Gf) The capacity for novel reasoning, pattern recognition, and problem-solving independent of previously acquired knowledge. Fluid intelligence relies heavily on processing speed, working memory, and the ability to adapt to new situations. It peaks in the mid-20s and shows a gradual, steady decline beginning in the 30s that accelerates in later adulthood",
      "id": "LDEV-0209"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "long-horizon-adulthood.html",
      "chapter_title": "The Long Horizon — Adulthood & Aging",
      "section": "Cognitive Aging: Fluid and Crystallized Intelligence",
      "passage_type": "definition",
      "passage": "Crystallized Intelligence (Gc) Accumulated knowledge, vocabulary, and expertise gained through education and life experience. Crystallized intelligence remains stable or even increases through middle adulthood and often into the 60s and 70s, declining significantly only in very late life or in the presence of neurodegenerative disease",
      "id": "LDEV-0210"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "long-horizon-adulthood.html",
      "chapter_title": "The Long Horizon — Adulthood & Aging",
      "section": "Dual Process Model of Bereavement",
      "passage_type": "definition",
      "passage": "Complicated Grief / Prolonged Grief Disorder While grief is a normal process, a subset of bereaved individuals (approximately 7–10%) develop prolonged grief disorder , characterized by persistent, pervasive longing for the deceased, difficulty accepting the death, emotional numbness, difficulty moving forward in life, and significant functional impairment lasting beyond 12 months (6 months in the ICD-11). This condition is distinct from major depressive disorder and requires specific clinical attention",
      "id": "LDEV-0211"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "long-horizon-adulthood.html",
      "chapter_title": "The Long Horizon — Adulthood & Aging",
      "section": "Socioemotional Selectivity Theory",
      "passage_type": "definition",
      "passage": "Socioemotional Selectivity Theory (SST) Proposed by Laura Carstensen (1991), SST posits that as people age and perceive their remaining time as limited, they shift their goals from knowledge acquisition and future-oriented pursuits to emotional regulation and the pursuit of emotionally meaningful experiences. This leads older adults to prune their social networks, retaining only the most emotionally rewarding relationships. This selective narrowing is not a sign of decline but an adaptive motivational shift driven by time perspective",
      "id": "LDEV-0212"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "long-horizon-adulthood.html",
      "chapter_title": "The Long Horizon — Adulthood & Aging",
      "section": "Menopause",
      "passage_type": "clinical_note",
      "passage": "Clinical Note While menopause is a normal biological transition, the hormonal changes associated with perimenopause can exacerbate or precipitate depressive episodes in vulnerable women. Clinicians should assess for mood changes during this period and be aware that the relationship between menopause and depression is not deterministic but reflects a complex interaction of biological, psychological, and social factors",
      "id": "LDEV-0213"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "long-horizon-adulthood.html",
      "chapter_title": "The Long Horizon — Adulthood & Aging",
      "section": "Kübler-Ross's Five Stages",
      "passage_type": "clinical_note",
      "passage": "Important Clinical Caveat Kübler-Ross's model, while widely known, has been criticized for implying a fixed sequence. Contemporary research shows that not all individuals experience all stages, the stages do not necessarily occur in the described order, and people may move back and forth between stages. The model is best understood as a description of common emotional reactions to dying rather than a prescriptive or universal progression. Clinicians should avoid rigidly applying this framework and instead attend to the individual's unique experience",
      "id": "LDEV-0214"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "long-horizon-adulthood.html",
      "chapter_title": "The Long Horizon — Adulthood & Aging",
      "section": "The Berlin Wisdom Paradigm",
      "passage_type": "clinical_note",
      "passage": "Clinical Application The SOC model has direct clinical relevance for working with older adults. Clinicians can help aging clients identify their most valued goals (selection), develop strategies to pursue those goals effectively (optimization), and find alternative approaches when abilities change (compensation). This framework is particularly useful in rehabilitation settings, chronic illness management, and psychotherapy with older adults experiencing age-related losses",
      "id": "LDEV-0215"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "long-horizon-adulthood.html",
      "chapter_title": "The Long Horizon — Adulthood & Aging",
      "section": "Major Neurocognitive Disorders (Dementias)",
      "passage_type": "clinical_note",
      "passage": "Clinical Application Neuropsychological assessment is essential in differentiating normal aging from MCI and various dementia subtypes. Key assessment tools include the Mini-Mental State Examination (MMSE), Montreal Cognitive Assessment (MoCA), and comprehensive neuropsychological batteries that evaluate memory, executive function, language, visuospatial skills, and processing speed. Clinicians should also screen for treatable conditions that can mimic dementia, including depression (\"pseudodementia\"), medication side effects, thyroid dysfunction, and vitamin B12 deficiency",
      "id": "LDEV-0216"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "long-horizon-adulthood.html",
      "chapter_title": "The Long Horizon — Adulthood & Aging",
      "section": "Erikson's Adult Psychosocial Stages",
      "passage_type": "example",
      "passage": "Exam Example A 70-year-old retired professor reflects on his career and family life with a sense of satisfaction and acceptance, acknowledging both accomplishments and mistakes. He tells his grandchildren, \"I wouldn't change the big choices I made.\" This reflects successful resolution of Erikson's ego integrity crisis",
      "id": "LDEV-0217"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "long-horizon-adulthood.html",
      "chapter_title": "The Long Horizon — Adulthood & Aging",
      "section": "Cognitive Aging: Fluid and Crystallized Intelligence",
      "passage_type": "example",
      "passage": "Exam Example A 75-year-old retired attorney takes longer to learn a new smartphone app (reflecting decline in fluid intelligence) but remains highly articulate, well-read, and effective in advising younger colleagues on complex legal matters (reflecting preserved crystallized intelligence). This pattern exemplifies the differential aging trajectories of Gf and Gc",
      "id": "LDEV-0218"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "long-horizon-adulthood.html",
      "chapter_title": "The Long Horizon — Adulthood & Aging",
      "section": "Socioemotional Selectivity Theory",
      "passage_type": "example",
      "passage": "Exam Example A 78-year-old woman has a smaller social network than she did at 40 but reports higher levels of satisfaction with her relationships. She prioritizes spending time with close family and lifelong friends over meeting new people. According to Carstensen's socioemotional selectivity theory, this pattern reflects a motivational shift toward emotionally meaningful goals as perceived time remaining decreases",
      "id": "LDEV-0219"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "long-horizon-adulthood.html",
      "chapter_title": "The Long Horizon — Adulthood & Aging",
      "section": "The Selection, Optimization, and Compensation (SOC) Model",
      "passage_type": "example",
      "passage": "Classic Illustration: The Pianist Rubinstein Baltes frequently used the concert pianist Arthur Rubinstein to illustrate SOC. In his 80s, Rubinstein continued to perform brilliantly by: (1) selecting a smaller number of pieces to perform (reducing his repertoire), (2) optimizing by practicing those selected pieces more frequently and intensively, and (3) compensating for reduced motor speed by slowing down before fast passages, creating a contrast that made the fast sections appear faster than they actually were",
      "id": "LDEV-0220"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "long-horizon-adulthood.html",
      "chapter_title": "The Long Horizon — Adulthood & Aging",
      "section": "The Berlin Wisdom Paradigm",
      "passage_type": "example",
      "passage": "Exam Example A 72-year-old retired surgeon volunteers as a medical advisor rather than continuing to perform operations. She reads the latest journals daily to maintain her knowledge base and uses voice-recording software when her handwriting becomes unreliable. According to Baltes' SOC model, she is demonstrating selection (choosing advisory over surgical roles), optimization (continuing to update medical knowledge), and compensation (using technology to substitute for declining fine motor skills)",
      "id": "LDEV-0221"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "long-horizon-adulthood.html",
      "chapter_title": "The Long Horizon — Adulthood & Aging",
      "section": "Major Neurocognitive Disorders (Dementias)",
      "passage_type": "example",
      "passage": "Exam Example An 80-year-old man presents with a gradual, progressive decline in memory over the past 3 years. He forgets recent conversations, has difficulty finding his way in familiar places, and his wife reports personality changes and word-finding problems. His MoCA score is 18/30. Brain imaging shows hippocampal atrophy. This presentation is most consistent with Alzheimer's disease, the most common neurodegenerative cause of dementia",
      "id": "LDEV-0222"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "long-horizon-adulthood.html",
      "chapter_title": "The Long Horizon — Adulthood & Aging",
      "section": "Emerging Adulthood and Psychosocial Development",
      "passage_type": "paragraph",
      "passage": "The study of adult development has expanded dramatically since the mid-20th century, reflecting both increased life expectancy and the recognition that psychological growth does not end at adolescence. This chapter covers the vast terrain from the late teens through the end of life",
      "id": "LDEV-0223"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "long-horizon-adulthood.html",
      "chapter_title": "The Long Horizon — Adulthood & Aging",
      "section": "Arnett's Emerging Adulthood",
      "passage_type": "paragraph",
      "passage": "Arnett's concept has been debated—critics note that it may apply primarily to privileged populations in Western, industrialized nations and may not describe the experiences of those who take on adult responsibilities (parenthood, full-time work) early due to economic necessity. Nevertheless, the concept has been influential in framing the transitional nature of the late teens to mid-20s",
      "id": "LDEV-0224"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "long-horizon-adulthood.html",
      "chapter_title": "The Long Horizon — Adulthood & Aging",
      "section": "Levinson's Seasons of Life and the Midlife Transition",
      "passage_type": "paragraph",
      "passage": "Daniel Levinson (1978) proposed that adult development follows a sequence of eras, each lasting approximately 20–25 years, with transitional periods between them. His model, based on intensive biographical interviews (initially with men, later extended to women), describes the construction, modification, and rebuilding of life structures —the underlying patterns of a person's life at any given time, encompassing relationships, work, and other central commitments",
      "id": "LDEV-0225"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "long-horizon-adulthood.html",
      "chapter_title": "The Long Horizon — Adulthood & Aging",
      "section": "Cognitive Aging: Fluid and Crystallized Intelligence",
      "passage_type": "paragraph",
      "passage": "One of the most important distinctions in the psychology of cognitive aging is between fluid intelligence (Gf) and crystallized intelligence (Gc) , originally proposed by Raymond Cattell (1963) and elaborated by John Horn",
      "id": "LDEV-0226"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "long-horizon-adulthood.html",
      "chapter_title": "The Long Horizon — Adulthood & Aging",
      "section": "Death, Dying, and Grief",
      "passage_type": "paragraph",
      "passage": "Understanding the psychology of death and dying is essential for clinicians who work with patients facing terminal illness, their families, and bereaved individuals of all ages",
      "id": "LDEV-0227"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "long-horizon-adulthood.html",
      "chapter_title": "The Long Horizon — Adulthood & Aging",
      "section": "Dual Process Model of Bereavement",
      "passage_type": "paragraph",
      "passage": "The Dual Process Model (Stroebe & Schut, 1999) offers a more nuanced framework for understanding grief. It proposes that bereaved individuals oscillate between two types of coping: loss-oriented coping (confronting and processing the emotional pain of the loss) and restoration-oriented coping (attending to life changes, new roles, and rebuilding). Healthy grieving involves dynamic oscillation between these two orientations rather than exclusively dwelling on loss or avoiding it",
      "id": "LDEV-0228"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "long-horizon-adulthood.html",
      "chapter_title": "The Long Horizon — Adulthood & Aging",
      "section": "Theories of Successful Aging",
      "passage_type": "paragraph",
      "passage": "Several theoretical perspectives address how individuals adapt to the challenges of aging, with each emphasizing different mechanisms for maintaining well-being in later life",
      "id": "LDEV-0229"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "long-horizon-adulthood.html",
      "chapter_title": "The Long Horizon — Adulthood & Aging",
      "section": "Disengagement Theory",
      "passage_type": "paragraph",
      "passage": "Disengagement theory (Cumming & Henry, 1961) was one of the first formal theories of aging. It proposed that it is natural and adaptive for older adults to gradually withdraw from social roles and relationships, and for society to reciprocally disengage from the aging individual. This mutual withdrawal was seen as functional for both the individual (allowing preparation for death) and society (facilitating orderly transfer of roles to younger people)",
      "id": "LDEV-0230"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "long-horizon-adulthood.html",
      "chapter_title": "The Long Horizon — Adulthood & Aging",
      "section": "Disengagement Theory",
      "passage_type": "paragraph",
      "passage": "Disengagement theory has been widely criticized for normalizing social isolation and for lacking empirical support. Most research shows that continued social engagement is associated with better physical and mental health outcomes in older adults",
      "id": "LDEV-0231"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "long-horizon-adulthood.html",
      "chapter_title": "The Long Horizon — Adulthood & Aging",
      "section": "Activity Theory",
      "passage_type": "paragraph",
      "passage": "Activity theory  proposes that successful aging involves maintaining the activities, roles, and social connections of middle adulthood for as long as possible. When roles are lost (e.g., through retirement or widowhood), the individual should find substitute activities. Happiness in late life is linked to staying active and engaged",
      "id": "LDEV-0232"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "long-horizon-adulthood.html",
      "chapter_title": "The Long Horizon — Adulthood & Aging",
      "section": "Baltes' Lifespan Development Theory",
      "passage_type": "paragraph",
      "passage": "Paul Baltes (1987, 1997) was the foremost architect of the lifespan developmental psychology perspective, which holds that development is a lifelong process—not something that ends with adolescence or early adulthood. His theoretical contributions are among the most important frameworks for understanding adult development and aging on the EPPP",
      "id": "LDEV-0233"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "long-horizon-adulthood.html",
      "chapter_title": "The Long Horizon — Adulthood & Aging",
      "section": "Baltes' Dual-Process Model of Cognitive Aging",
      "passage_type": "paragraph",
      "passage": "Baltes (1997) proposed a dual-process framework that distinguishes between two broad categories of cognitive functioning:",
      "id": "LDEV-0234"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "long-horizon-adulthood.html",
      "chapter_title": "The Long Horizon — Adulthood & Aging",
      "section": "Baltes' Dual-Process Model of Cognitive Aging",
      "passage_type": "paragraph",
      "passage": "A key insight of Baltes' dual-process model is that pragmatics can partially compensate for declines in mechanics—but only up to a point. In very old age (the \"fourth age,\" roughly 80+), the biological declines become so pronounced that even well-developed pragmatic systems can no longer fully compensate, leading to more pervasive functional decline",
      "id": "LDEV-0235"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "long-horizon-adulthood.html",
      "chapter_title": "The Long Horizon — Adulthood & Aging",
      "section": "The Berlin Wisdom Paradigm",
      "passage_type": "paragraph",
      "passage": "Paul Baltes and colleagues at the Max Planck Institute in Berlin developed the most systematic empirical research program on wisdom . The Berlin Wisdom Paradigm defines wisdom as expert knowledge about the fundamental pragmatics of life , encompassing five criteria:",
      "id": "LDEV-0236"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "long-horizon-adulthood.html",
      "chapter_title": "The Long Horizon — Adulthood & Aging",
      "section": "The Berlin Wisdom Paradigm",
      "passage_type": "paragraph",
      "passage": "Research using the Berlin paradigm found that wisdom does not automatically increase with age—older adults do not consistently score higher than younger adults. However, older adults with rich life experiences, high intelligence, and openness to experience have the greatest potential for wisdom. Clinical psychologists and those in mentoring professions showed relatively high wisdom scores",
      "id": "LDEV-0237"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "long-horizon-adulthood.html",
      "chapter_title": "The Long Horizon — Adulthood & Aging",
      "section": "Normal Aging",
      "passage_type": "paragraph",
      "passage": "Normal aging involves slowed processing speed, decreased working memory capacity, occasional word-finding difficulties (\"tip of the tongue\"), and reduced efficiency in encoding new episodic memories. Importantly, these changes typically do not significantly impair daily functioning or independent living",
      "id": "LDEV-0238"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "long-horizon-adulthood.html",
      "chapter_title": "The Long Horizon — Adulthood & Aging",
      "section": "Mild Cognitive Impairment (MCI)",
      "passage_type": "paragraph",
      "passage": "Mild Cognitive Impairment represents a transitional state between normal aging and dementia. Individuals with MCI show cognitive decline greater than expected for their age and education level, but not severe enough to meet criteria for dementia. They maintain functional independence. Approximately 10–15% of individuals with MCI progress to dementia annually, though some remain stable or even revert to normal cognition",
      "id": "LDEV-0239"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "moral-development.html",
      "chapter_title": "Moral Development",
      "section": "Gilligan's Ethics of Care",
      "passage_type": "definition",
      "passage": "Gilligan's Three Levels of Care-Based Morality Level 1 -- Orientation to Self-Survival: Focus on self-interest and individual survival. Transition: Recognition that this orientation is selfish. Level 2 -- Goodness as Self-Sacrifice: Focus on caring for others, often at the expense of self. Being \"good\" means being responsible for others. Transition: Recognition that neglecting one's own needs is also problematic. Level 3 -- Morality of Nonviolence: Balance between care for self and care for others. The injunction against hurting anyone (including oneself) becomes the guiding principle",
      "id": "LDEV-0240"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "moral-development.html",
      "chapter_title": "Moral Development",
      "section": "Overview of Moral Development",
      "passage_type": "paragraph",
      "passage": "Moral development encompasses the growth of an individual's ability to distinguish right from wrong, to develop a personal moral code, and to behave in accordance with ethical principles. This chapter covers the major theoretical frameworks: Piaget's foundational work on moral reasoning, Kohlberg's influential stage theory, Gilligan's feminist critique, and research on prosocial behavior and empathy development",
      "id": "LDEV-0241"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "moral-development.html",
      "chapter_title": "Moral Development",
      "section": "Overview of Moral Development",
      "passage_type": "paragraph",
      "passage": "For the EPPP, moral development is a consistently tested topic. Candidates must know Kohlberg's six stages in detail, understand the criticisms leveled against his theory, and be able to apply these concepts to clinical and forensic contexts",
      "id": "LDEV-0242"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "moral-development.html",
      "chapter_title": "Moral Development",
      "section": "Piaget's Theory of Moral Development",
      "passage_type": "paragraph",
      "passage": "Jean Piaget (1932) studied moral development by observing children playing games (especially marbles) and presenting them with moral dilemmas. He identified two broad stages of moral reasoning:",
      "id": "LDEV-0243"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "moral-development.html",
      "chapter_title": "Moral Development",
      "section": "Piaget's Theory of Moral Development",
      "passage_type": "paragraph",
      "passage": "Piaget's key contribution was demonstrating that moral reasoning develops in a predictable sequence tied to cognitive development. The shift from heteronomous to autonomous morality parallels the transition from preoperational to concrete operational thinking. Peer interaction (particularly disagreement and negotiation among equals) was seen as the primary driver of moral development, more so than adult instruction",
      "id": "LDEV-0244"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "moral-development.html",
      "chapter_title": "Moral Development",
      "section": "Kohlberg's Theory of Moral Development",
      "passage_type": "paragraph",
      "passage": "Lawrence Kohlberg (1927-1987) extended Piaget's work by proposing a more detailed six-stage model of moral reasoning. Kohlberg assessed moral development by presenting participants with hypothetical moral dilemmas and analyzing the reasoning (not the content) behind their judgments. His most famous dilemma involves Heinz, whose wife is dying and who must decide whether to steal an unaffordable drug to save her life",
      "id": "LDEV-0245"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "moral-development.html",
      "chapter_title": "Moral Development",
      "section": "Level 2: Conventional Morality (Most adolescents and adults)",
      "passage_type": "paragraph",
      "passage": "Moral reasoning is based on conforming to social expectations, maintaining relationships, and upholding the social order",
      "id": "LDEV-0246"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "moral-development.html",
      "chapter_title": "Moral Development",
      "section": "Gilligan's Ethics of Care",
      "passage_type": "paragraph",
      "passage": "Carol Gilligan (1982), in her influential book In a Different Voice , argued that Kohlberg's theory was biased toward a justice orientation (emphasizing individual rights, abstract principles, and impartiality) that reflects typically male moral reasoning. Gilligan proposed that women more often use a care orientation (emphasizing relationships, compassion, responsibility to others, and contextual sensitivity), which Kohlberg's scoring system systematically undervalued",
      "id": "LDEV-0247"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "moral-development.html",
      "chapter_title": "Moral Development",
      "section": "Gilligan's Ethics of Care",
      "passage_type": "paragraph",
      "passage": "Subsequent research  has generally found only small or no gender differences in moral reasoning on Kohlberg's scale, and both men and women use both justice and care orientations depending on the context of the dilemma. Nevertheless, Gilligan's contribution was valuable in highlighting that moral reasoning involves more than justice considerations alone",
      "id": "LDEV-0248"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "moral-development.html",
      "chapter_title": "Moral Development",
      "section": "Prosocial Behavior and Empathy",
      "passage_type": "paragraph",
      "passage": "Prosocial behavior refers to voluntary actions intended to benefit others, including sharing, helping, comforting, and cooperating. The development of prosocial behavior is closely tied to the development of empathy and perspective-taking",
      "id": "LDEV-0249"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "nature-nurture.html",
      "chapter_title": "Nature vs. Nurture",
      "section": "Twin Studies",
      "passage_type": "definition",
      "passage": "Key Terminology Concordance rate: The probability that both twins exhibit a given trait when one twin has it. Higher concordance in MZ vs. DZ twins suggests genetic influence. Equal environments assumption: The critical assumption in twin studies that MZ and DZ twins share environmental influences to the same degree. Violations of this assumption can inflate heritability estimates",
      "id": "LDEV-0250"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "nature-nurture.html",
      "chapter_title": "Nature vs. Nurture",
      "section": "Epigenetics",
      "passage_type": "definition",
      "passage": "Key Terminology DNA methylation: The addition of methyl groups to DNA, typically silencing gene expression. Increased methylation of a gene promoter region generally reduces that gene's activity. Histone modification: Chemical changes to the histone proteins around which DNA is wound, affecting how tightly DNA is packaged and thus how accessible genes are for transcription. Transgenerational epigenetic inheritance: The transmission of epigenetic marks from one generation to the next without changes in DNA sequence",
      "id": "LDEV-0251"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "nature-nurture.html",
      "chapter_title": "Nature vs. Nurture",
      "section": "Epigenetics",
      "passage_type": "clinical_note",
      "passage": "Clinical Implications Epigenetics provides a biological mechanism for understanding how early adversity (e.g., childhood abuse, neglect) can have lasting effects on stress reactivity, mental health, and even physical health. Studies of human suicide victims with histories of childhood abuse have found increased methylation of the glucocorticoid receptor gene in the hippocampus (McGowan et al., 2009), paralleling the animal findings. This research supports the importance of early intervention and suggests that environmental enrichment may help reverse adverse epigenetic modifications",
      "id": "LDEV-0252"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "nature-nurture.html",
      "chapter_title": "Nature vs. Nurture",
      "section": "Overview of the Nature-Nurture Debate",
      "passage_type": "paragraph",
      "passage": "The nature-nurture question is one of the oldest and most fundamental issues in psychology: To what extent are human characteristics determined by genetic inheritance (nature) versus environmental experience (nurture)? Contemporary developmental psychology has moved well beyond this dichotomy, recognizing that virtually all traits arise from complex interactions between genes and environments",
      "id": "LDEV-0253"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "nature-nurture.html",
      "chapter_title": "Nature vs. Nurture",
      "section": "Overview of the Nature-Nurture Debate",
      "passage_type": "paragraph",
      "passage": "For the EPPP, candidates must understand behavioral genetics methodology, the concept of heritability, epigenetic mechanisms, and the specific types of gene-environment interactions and correlations that shape development",
      "id": "LDEV-0254"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "nature-nurture.html",
      "chapter_title": "Nature vs. Nurture",
      "section": "Behavioral Genetics",
      "passage_type": "paragraph",
      "passage": "Behavioral genetics is the field that examines the relative contributions of genetic and environmental factors to individual differences in behavior and psychological traits. It relies on several key research designs to disentangle genetic from environmental influences",
      "id": "LDEV-0255"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "nature-nurture.html",
      "chapter_title": "Nature vs. Nurture",
      "section": "Twin Studies",
      "passage_type": "paragraph",
      "passage": "Twin studies compare monozygotic (MZ) twins (who share 100% of their DNA) with dizygotic (DZ) twins (who share approximately 50% of their segregating genes, like any siblings). The logic is straightforward: if MZ twins are more similar on a trait than DZ twins, genetic factors are implicated",
      "id": "LDEV-0256"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "nature-nurture.html",
      "chapter_title": "Nature vs. Nurture",
      "section": "Twin Studies",
      "passage_type": "paragraph",
      "passage": "The landmark Minnesota Study of Twins Reared Apart  found that MZ twins raised in different families showed remarkably similar IQ scores (correlation ~.70), personality traits, and even behavioral quirks, providing compelling evidence for strong genetic influences on many psychological characteristics",
      "id": "LDEV-0257"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "nature-nurture.html",
      "chapter_title": "Nature vs. Nurture",
      "section": "Adoption Studies",
      "passage_type": "paragraph",
      "passage": "Adoption studies compare adopted children with both their biological parents (who share genes but not environment) and their adoptive parents (who share environment but not genes). If adopted children more closely resemble their biological parents on a trait, genetic factors are implicated; if they more resemble their adoptive parents, environmental factors are suggested",
      "id": "LDEV-0258"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "nature-nurture.html",
      "chapter_title": "Nature vs. Nurture",
      "section": "Adoption Studies",
      "passage_type": "paragraph",
      "passage": "The Colorado Adoption Project  followed adopted and non-adopted children longitudinally, revealing that the correlation between adopted children and their biological parents on cognitive measures actually increases with age, while correlations with adoptive parents decrease -- a finding consistent with increasing genetic influence over time",
      "id": "LDEV-0259"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "nature-nurture.html",
      "chapter_title": "Nature vs. Nurture",
      "section": "Heritability",
      "passage_type": "paragraph",
      "passage": "Heritability (h-squared) is a statistic that estimates the proportion of variance in a trait within a population that is attributable to genetic differences among individuals. It ranges from 0.0 (no genetic contribution to individual differences) to 1.0 (all variation due to genetic differences)",
      "id": "LDEV-0260"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "nature-nurture.html",
      "chapter_title": "Nature vs. Nurture",
      "section": "Heritability",
      "passage_type": "paragraph",
      "passage": "Heritability estimates for major psychological traits include approximately .50 for general intelligence (with estimates increasing from childhood to adulthood), .40-.60 for personality traits (Big Five), and .60-.80 for schizophrenia and bipolar disorder",
      "id": "LDEV-0261"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "nature-nurture.html",
      "chapter_title": "Nature vs. Nurture",
      "section": "Shared vs. Nonshared Environment",
      "passage_type": "paragraph",
      "passage": "Plomin and Daniels (1987) published a highly influential paper asking \"Why are children in the same family so different from one another?\" Their conclusion -- that nonshared environmental influences dominate over shared ones for most psychological traits -- reshaped how psychologists think about family influence",
      "id": "LDEV-0262"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "nature-nurture.html",
      "chapter_title": "Nature vs. Nurture",
      "section": "Epigenetics",
      "passage_type": "paragraph",
      "passage": "Epigenetics refers to changes in gene expression that do not involve alterations to the DNA sequence itself. These modifications determine whether specific genes are \"turned on\" or \"turned off\" and can be influenced by environmental factors including stress, nutrition, toxins, and early caregiving experiences",
      "id": "LDEV-0263"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "nature-nurture.html",
      "chapter_title": "Nature vs. Nurture",
      "section": "Epigenetics",
      "passage_type": "paragraph",
      "passage": "A groundbreaking study by Meaney and colleagues  demonstrated that rat pups who received high levels of maternal licking and grooming showed altered methylation patterns at the glucocorticoid receptor gene, resulting in lower stress reactivity throughout life. This effect was reversible through cross-fostering, demonstrating a direct mechanism by which early caregiving shapes gene expression and stress physiology",
      "id": "LDEV-0264"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "nature-nurture.html",
      "chapter_title": "Nature vs. Nurture",
      "section": "Gene-Environment Interaction (GxE)",
      "passage_type": "paragraph",
      "passage": "Gene-environment interaction occurs when the effect of a gene depends on the environment (or vice versa). The same genetic variant may lead to different outcomes depending on environmental conditions",
      "id": "LDEV-0265"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "nature-nurture.html",
      "chapter_title": "Nature vs. Nurture",
      "section": "Gene-Environment Interaction (GxE)",
      "passage_type": "paragraph",
      "passage": "The classic example is Caspi et al. (2003), who found that individuals with the short allele of the 5-HTTLPR serotonin transporter gene were more likely to develop depression following stressful life events than those with the long allele. The gene alone did not cause depression, nor did stress alone -- it was the interaction that mattered. (Note: This finding has been debated in subsequent replication attempts, highlighting the complexity of GxE research.)",
      "id": "LDEV-0266"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "nature-nurture.html",
      "chapter_title": "Nature vs. Nurture",
      "section": "Gene-Environment Correlations (rGE)",
      "passage_type": "paragraph",
      "passage": "Scarr and McCartney (1983) described three types of gene-environment correlation , which explain how genes and environments become linked:",
      "id": "LDEV-0267"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "physical-development.html",
      "chapter_title": "Physical Development",
      "section": "Fine Motor Milestones",
      "passage_type": "definition",
      "passage": "Key Terminology Dynamic systems theory (Thelen & Smith, 1994): Motor development results from the dynamic interaction of multiple systems -- neural maturation, body proportions, muscle strength, motivation, and environmental support. This theory replaced earlier maturational views (Gesell) that attributed motor milestones solely to biological unfolding. Neonatal reflexes: Involuntary motor responses present at birth that typically disappear within the first few months as cortical control develops. Their persistence beyond expected ages may indicate neurological dysfunction",
      "id": "LDEV-0268"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "physical-development.html",
      "chapter_title": "Physical Development",
      "section": "Myelination",
      "passage_type": "clinical_note",
      "passage": "Clinical Implications The late maturation of the prefrontal cortex relative to the limbic system (which matures earlier in adolescence) creates a developmental mismatch that helps explain increased risk-taking behavior in adolescents. Steinberg (2008) described this as \"starting the engine before the steering is in place\" -- heightened emotional and reward sensitivity (limbic system) with still-developing impulse control (prefrontal cortex). This understanding has influenced legal and policy decisions regarding juvenile justice, age of consent, and driving regulations",
      "id": "LDEV-0269"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "physical-development.html",
      "chapter_title": "Physical Development",
      "section": "Overview of Physical Development",
      "passage_type": "paragraph",
      "passage": "Physical development encompasses changes in body size, proportions, motor abilities, brain structure, and physiological processes from conception through old age. For the EPPP, candidates must understand the major milestones of motor development, the principles governing brain maturation, the biological changes of puberty and menopause, and the distinction between primary and secondary aging",
      "id": "LDEV-0270"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "physical-development.html",
      "chapter_title": "Physical Development",
      "section": "Overview of Physical Development",
      "passage_type": "paragraph",
      "passage": "Physical development follows several general principles: development proceeds in a cephalocaudal (head-to-toe) and proximodistal (center-to-periphery) direction, and it moves from gross motor to fine motor control",
      "id": "LDEV-0271"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "physical-development.html",
      "chapter_title": "Physical Development",
      "section": "Motor Development in Infancy and Childhood",
      "passage_type": "paragraph",
      "passage": "Motor milestones follow a relatively predictable sequence, though the exact timing varies across individuals and cultures. The sequence reflects the maturation of the nervous system and the cephalocaudal/proximodistal principles",
      "id": "LDEV-0272"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "physical-development.html",
      "chapter_title": "Physical Development",
      "section": "Myelination",
      "passage_type": "paragraph",
      "passage": "Myelination is the process of coating neural axons with myelin (a fatty sheath produced by oligodendrocytes in the CNS and Schwann cells in the PNS), which dramatically increases the speed and efficiency of neural transmission. Myelination follows a predictable sequence:",
      "id": "LDEV-0273"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "physical-development.html",
      "chapter_title": "Physical Development",
      "section": "Brain Plasticity",
      "passage_type": "paragraph",
      "passage": "Brain plasticity (neuroplasticity) refers to the brain's ability to change in response to experience. Two types are distinguished:",
      "id": "LDEV-0274"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "physical-development.html",
      "chapter_title": "Physical Development",
      "section": "Brain Plasticity",
      "passage_type": "paragraph",
      "passage": "Plasticity is generally greater in younger brains, which is why children often recover from brain injuries more fully than adults -- a concept known as the Kennard principle , though it has important limitations (early damage can also be more devastating because it disrupts the development of subsequent skills that build on affected areas)",
      "id": "LDEV-0275"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "physical-development.html",
      "chapter_title": "Physical Development",
      "section": "Puberty",
      "passage_type": "paragraph",
      "passage": "Puberty is the period of rapid physical maturation during which the body becomes capable of sexual reproduction. It is triggered by the activation of the hypothalamic-pituitary-gonadal (HPG) axis , which stimulates the gonads (ovaries and testes) to produce sex hormones (estrogen and testosterone)",
      "id": "LDEV-0276"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "physical-development.html",
      "chapter_title": "Physical Development",
      "section": "Menopause",
      "passage_type": "paragraph",
      "passage": "Menopause is the permanent cessation of menstruation, occurring at an average age of 51 (range: 45-55). It results from the depletion of ovarian follicles and the resulting decline in estrogen and progesterone production. Perimenopause (the transition period) typically begins 2-8 years before the last menstrual period and is characterized by irregular cycles, hot flashes, sleep disturbances, and mood changes",
      "id": "LDEV-0277"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "physical-development.html",
      "chapter_title": "Physical Development",
      "section": "Menopause",
      "passage_type": "paragraph",
      "passage": "Cross-cultural research reveals that the experience of menopause varies considerably across cultures. In cultures where aging women gain status (e.g., traditional Indian society), fewer negative symptoms are reported , suggesting significant psychosocial influences on menopausal experience",
      "id": "LDEV-0278"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "prenatal-development.html",
      "chapter_title": "Prenatal Development",
      "section": "Embryonic Period (~2 to 8 Weeks)",
      "passage_type": "definition",
      "passage": "Embryonic Cell Layers Ectoderm (outer layer): Develops into the nervous system, sensory organs, and skin. Mesoderm (middle layer): Develops into muscles, bones, circulatory system, and other internal organs. Endoderm (inner layer): Develops into the digestive system, lungs, urinary tract, and glands",
      "id": "LDEV-0279"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "prenatal-development.html",
      "chapter_title": "Prenatal Development",
      "section": "Alcohol: Fetal Alcohol Spectrum Disorders (FASD)",
      "passage_type": "definition",
      "passage": "Fetal Alcohol Syndrome (FAS) -- Diagnostic Features Facial dysmorphology: Short palpebral fissures, smooth philtrum (groove between nose and upper lip), thin upper lip. Growth deficiency: Prenatal and/or postnatal growth restriction (height and/or weight at or below the 10th percentile). CNS abnormalities: Structural brain abnormalities, microcephaly, and/or neurological problems. Intellectual disability is common (mean IQ ~70), along with deficits in executive function, attention, learning, and social judgment. Confirmed prenatal alcohol exposure",
      "id": "LDEV-0280"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "prenatal-development.html",
      "chapter_title": "Prenatal Development",
      "section": "Fetal Period (~9 Weeks to Birth)",
      "passage_type": "clinical_note",
      "passage": "Clinical Implications The concept of critical periods (also called sensitive periods) is essential: specific organ systems are most vulnerable to disruption during the time they are actively forming. The embryonic period is the time of greatest vulnerability to structural birth defects because organogenesis is occurring. However, the brain continues to develop throughout the fetal period and into postnatal life, making it vulnerable to insult across a longer window than other organs",
      "id": "LDEV-0281"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "prenatal-development.html",
      "chapter_title": "Prenatal Development",
      "section": "Overview of Prenatal Development",
      "passage_type": "paragraph",
      "passage": "Prenatal development spans approximately 38 weeks from conception to birth and is divided into three major periods: germinal, embryonic, and fetal. During this time, a single fertilized cell develops into a complex organism with functioning organ systems. Understanding prenatal development is essential for the EPPP because many developmental abnormalities, genetic disorders, and environmental hazards have their origins during this period",
      "id": "LDEV-0282"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "prenatal-development.html",
      "chapter_title": "Prenatal Development",
      "section": "Overview of Prenatal Development",
      "passage_type": "paragraph",
      "passage": "Clinicians must understand the timing and mechanisms of prenatal risk factors to provide accurate psychoeducation, conduct informed assessments, and develop appropriate treatment plans for individuals affected by prenatal insults",
      "id": "LDEV-0283"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "prenatal-development.html",
      "chapter_title": "Prenatal Development",
      "section": "Germinal Period (Conception to ~2 Weeks)",
      "passage_type": "paragraph",
      "passage": "The germinal period begins with fertilization (the union of sperm and ovum forming a zygote) and ends with implantation of the developing organism in the uterine wall. During this period:",
      "id": "LDEV-0284"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "prenatal-development.html",
      "chapter_title": "Prenatal Development",
      "section": "Embryonic Period (~2 to 8 Weeks)",
      "passage_type": "paragraph",
      "passage": "This is the most critical period for structural development. All major organ systems begin to form through a process called organogenesis . Three embryonic cell layers differentiate:",
      "id": "LDEV-0285"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "prenatal-development.html",
      "chapter_title": "Prenatal Development",
      "section": "Embryonic Period (~2 to 8 Weeks)",
      "passage_type": "paragraph",
      "passage": "By the end of the embryonic period (8 weeks), the embryo is approximately 1 inch long and has recognizable features including rudimentary eyes, ears, limbs, and a beating heart. The neural tube (precursor to the brain and spinal cord) forms during weeks 3-4, making this period particularly critical for nervous system development. Failure of neural tube closure results in conditions such as spina bifida (incomplete closure of the spinal column) or anencephaly (absence of major portions of the brain)",
      "id": "LDEV-0286"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "prenatal-development.html",
      "chapter_title": "Prenatal Development",
      "section": "Fetal Period (~9 Weeks to Birth)",
      "passage_type": "paragraph",
      "passage": "The fetal period is characterized by rapid growth, refinement of organ systems, and increasing behavioral complexity. Key milestones include:",
      "id": "LDEV-0287"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "prenatal-development.html",
      "chapter_title": "Prenatal Development",
      "section": "Teratogens",
      "passage_type": "paragraph",
      "passage": "A teratogen is any environmental agent that can cause damage to the developing organism during prenatal development. The effects of teratogens depend on several principles:",
      "id": "LDEV-0288"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "prenatal-development.html",
      "chapter_title": "Prenatal Development",
      "section": "Alcohol: Fetal Alcohol Spectrum Disorders (FASD)",
      "passage_type": "paragraph",
      "passage": "Alcohol is the most well-studied and one of the most damaging teratogens. Prenatal alcohol exposure can produce a range of effects collectively called Fetal Alcohol Spectrum Disorders (FASD) , with Fetal Alcohol Syndrome (FAS) representing the most severe end of the spectrum",
      "id": "LDEV-0289"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "prenatal-development.html",
      "chapter_title": "Prenatal Development",
      "section": "Alcohol: Fetal Alcohol Spectrum Disorders (FASD)",
      "passage_type": "paragraph",
      "passage": "FAS is the leading preventable cause of intellectual disability in the Western world. No safe threshold of alcohol consumption during pregnancy has been established, which is why major health organizations recommend complete abstinence during pregnancy (AAP, 2000)",
      "id": "LDEV-0290"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "prenatal-development.html",
      "chapter_title": "Prenatal Development",
      "section": "Infectious Teratogens",
      "passage_type": "paragraph",
      "passage": "Several maternal infections can cross the placenta and damage the developing fetus. The acronym TORCH represents the major infectious teratogens:",
      "id": "LDEV-0291"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "prenatal-development.html",
      "chapter_title": "Prenatal Development",
      "section": "Chromosomal Abnormalities",
      "passage_type": "paragraph",
      "passage": "Down syndrome (Trisomy 21) is the most common chromosomal disorder, occurring in approximately 1 in 700 live births. It results from an extra copy of chromosome 21, typically due to nondisjunction during meiosis. Characteristics include:",
      "id": "LDEV-0292"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "prenatal-development.html",
      "chapter_title": "Prenatal Development",
      "section": "Chromosomal Abnormalities",
      "passage_type": "paragraph",
      "passage": "Other chromosomal abnormalities tested on the EPPP include Turner syndrome (45,X -- females with only one X chromosome; short stature, infertility, possible spatial processing deficits) and Klinefelter syndrome (47,XXY -- males with an extra X; tall stature, possible language delays, infertility)",
      "id": "LDEV-0293"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "prenatal-development.html",
      "chapter_title": "Prenatal Development",
      "section": "Single-Gene Disorders",
      "passage_type": "paragraph",
      "passage": "Other important single-gene disorders include Tay-Sachs disease (autosomal recessive; progressive neurological deterioration, typically fatal by age 5; most common in Ashkenazi Jewish populations), Huntington's disease (autosomal dominant; progressive motor and cognitive deterioration with onset typically in the 30s-40s), and sickle cell disease (autosomal recessive; carriers have resistance to malaria, illustrating heterozygote advantage)",
      "id": "LDEV-0294"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "temperament.html",
      "chapter_title": "Temperament & Personality",
      "section": "Overview of Temperament and Personality Development",
      "passage_type": "paragraph",
      "passage": "Temperament refers to constitutionally based individual differences in emotional reactivity and self-regulation that appear early in life and show moderate stability across development. Personality development, particularly as conceptualized by Erikson's psychosocial stages and Marcia's identity statuses, describes how the self evolves across the lifespan in response to both biological maturation and social experience",
      "id": "LDEV-0295"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "temperament.html",
      "chapter_title": "Temperament & Personality",
      "section": "Overview of Temperament and Personality Development",
      "passage_type": "paragraph",
      "passage": "For the EPPP, candidates must understand the major temperament classification systems (Thomas & Chess, Kagan), how temperament interacts with environment to shape developmental outcomes, and Erikson's eight psychosocial stages in detail. These topics appear frequently and have direct relevance to clinical assessment and intervention",
      "id": "LDEV-0296"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "temperament.html",
      "chapter_title": "Temperament & Personality",
      "section": "Thomas and Chess: The New York Longitudinal Study",
      "passage_type": "paragraph",
      "passage": "Alexander Thomas and Stella Chess (1977) conducted the landmark New York Longitudinal Study (NYLS) , following 133 children from infancy into adulthood. They identified nine dimensions of temperament and classified children into three broad temperament types, plus a mixed category",
      "id": "LDEV-0297"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "temperament.html",
      "chapter_title": "Temperament & Personality",
      "section": "Goodness of Fit",
      "passage_type": "paragraph",
      "passage": "Thomas and Chess's most important clinical contribution was the concept of goodness of fit -- the match between a child's temperament and the demands and expectations of the environment (particularly the parents). When there is a good fit, development proceeds smoothly; when there is a poor fit, the child is at increased risk for behavioral and emotional problems",
      "id": "LDEV-0298"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "temperament.html",
      "chapter_title": "Temperament & Personality",
      "section": "Kagan's Behavioral Inhibition",
      "passage_type": "paragraph",
      "passage": "Jerome Kagan (1994) conducted extensive longitudinal research on behavioral inhibition -- a temperamental trait characterized by heightened vigilance and fearfulness in response to unfamiliar people, objects, and situations. Approximately 15-20% of infants show consistently high reactivity (vigorous limb movements, crying, arching of back) to novel stimuli at 4 months of age",
      "id": "LDEV-0299"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "temperament.html",
      "chapter_title": "Temperament & Personality",
      "section": "Biological Basis",
      "passage_type": "paragraph",
      "passage": "Kagan proposed that behavioral inhibition has a biological basis in a low threshold for arousal in the amygdala and associated limbic circuits. Behaviorally inhibited children show:",
      "id": "LDEV-0300"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "temperament.html",
      "chapter_title": "Temperament & Personality",
      "section": "Developmental Trajectory",
      "passage_type": "paragraph",
      "passage": "Approximately two-thirds of highly reactive 4-month-olds become behaviorally inhibited toddlers, and roughly one-third to one-half of behaviorally inhibited toddlers go on to develop social anxiety disorder in adolescence (Kagan & Snidman, 2004). However, the trajectory is not deterministic:",
      "id": "LDEV-0301"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "temperament.html",
      "chapter_title": "Temperament & Personality",
      "section": "Erikson's Psychosocial Stages",
      "passage_type": "paragraph",
      "passage": "Erik Erikson (1902-1994) proposed eight stages of psychosocial development spanning the entire lifespan. Each stage presents a central psychosocial crisis -- a conflict between two opposing tendencies that must be resolved for healthy development. Successful resolution results in a basic virtue or strength; unsuccessful resolution results in maladaptive tendencies",
      "id": "LDEV-0302"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "temperament.html",
      "chapter_title": "Temperament & Personality",
      "section": "Identity Development: Marcia's Identity Statuses",
      "passage_type": "paragraph",
      "passage": "James Marcia (1966) operationalized Erikson's identity concept by proposing four identity statuses based on two dimensions: whether the individual has experienced an identity crisis (a period of active exploration of alternatives) and whether they have made a commitment (a firm decision about identity elements such as occupation, ideology, and relationships)",
      "id": "LDEV-0303"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "transformation-adolescence.html",
      "chapter_title": "Transformation — Adolescence",
      "section": "Elkind's Adolescent Egocentrism",
      "passage_type": "definition",
      "passage": "Imaginary Audience The adolescent's belief that others are as preoccupied with their appearance and behavior as they are themselves. This belief leads to heightened self-consciousness, feeling constantly \"on stage,\" and behaviors like spending excessive time in front of the mirror or feeling mortified by minor embarrassments",
      "id": "LDEV-0304"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "transformation-adolescence.html",
      "chapter_title": "Transformation — Adolescence",
      "section": "Elkind's Adolescent Egocentrism",
      "passage_type": "definition",
      "passage": "Personal Fable The belief that one's experiences and feelings are unique and that one is somehow special or invulnerable. This cognitive distortion contributes to risk-taking behavior (\"It won't happen to me\") and can manifest as a sense that no one else could possibly understand what the adolescent is going through",
      "id": "LDEV-0305"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "transformation-adolescence.html",
      "chapter_title": "Transformation — Adolescence",
      "section": "Identity Development",
      "passage_type": "definition",
      "passage": "Marcia's Identity Statuses Identity statuses are not fixed stages—individuals can move between statuses over time. However, the general developmental trajectory moves from diffusion and foreclosure toward moratorium and eventually achievement. Identity achievement is associated with higher self-esteem, better stress management, and more mature interpersonal relationships",
      "id": "LDEV-0306"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "transformation-adolescence.html",
      "chapter_title": "Transformation — Adolescence",
      "section": "The Dual Systems Model",
      "passage_type": "definition",
      "passage": "Dual Systems Model Adolescent risk-taking is not due to a failure to perceive risk (adolescents generally know that dangerous activities are dangerous) but to an imbalance between a hyper-responsive reward system and an immature regulatory system. This imbalance is greatest in the presence of peers, who amplify reward sensitivity",
      "id": "LDEV-0307"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "transformation-adolescence.html",
      "chapter_title": "Transformation — Adolescence",
      "section": "Effects of Pubertal Timing",
      "passage_type": "clinical_note",
      "passage": "Clinical Note The secular trend toward earlier pubertal onset (the average age of menarche has decreased by approximately 3–4 years over the past 150 years in Western nations) has implications for clinical practice. Earlier physical maturation without corresponding cognitive and emotional development may increase vulnerability to psychosocial stressors and risky behaviors",
      "id": "LDEV-0308"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "transformation-adolescence.html",
      "chapter_title": "Transformation — Adolescence",
      "section": "Identity Development",
      "passage_type": "clinical_note",
      "passage": "Clinical Consideration Identity diffusion is the status most associated with psychological distress, including depression, substance use, and interpersonal difficulties. In clinical settings, adolescents in diffusion may present as disengaged, unmotivated, or oppositional. Therapeutic work may involve supporting the exploration process—helping the adolescent engage with moratorium rather than remaining diffused",
      "id": "LDEV-0309"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "transformation-adolescence.html",
      "chapter_title": "Transformation — Adolescence",
      "section": "The Dual Systems Model",
      "passage_type": "clinical_note",
      "passage": "Legal and Clinical Implications Neuroscience evidence on adolescent brain development has been cited in landmark U.S. Supreme Court decisions, including Roper v. Simmons (2005, abolishing the juvenile death penalty), Graham v. Florida (2010, banning life without parole for non-homicide juvenile offenses), and Miller v. Alabama (2012, prohibiting mandatory life without parole for juveniles). Clinicians working with adolescents should understand that impulsive or risky behavior may reflect neurodevelopmental immaturity rather than fixed character traits",
      "id": "LDEV-0310"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "transformation-adolescence.html",
      "chapter_title": "Transformation — Adolescence",
      "section": "Key Cognitive Achievements",
      "passage_type": "example",
      "passage": "Exam Example When asked \"If dogs are bigger than elephants, and elephants are bigger than mice, are dogs bigger than mice?\" a concrete operational child may protest that dogs are not bigger than elephants. A formal operational adolescent can set aside real-world knowledge and evaluate the logical structure of the argument, correctly answering \"yes.\"",
      "id": "LDEV-0311"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "transformation-adolescence.html",
      "chapter_title": "Transformation — Adolescence",
      "section": "Elkind's Adolescent Egocentrism",
      "passage_type": "example",
      "passage": "Exam Example A 15-year-old refuses to wear a coat on a cold day because \"everyone will stare at me.\" This reflects the imaginary audience. The same teen engages in reckless driving, believing \"I'm a great driver; accidents happen to other people.\" This reflects the personal fable",
      "id": "LDEV-0312"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "transformation-adolescence.html",
      "chapter_title": "Transformation — Adolescence",
      "section": "Identity Development",
      "passage_type": "example",
      "passage": "Exam Example A college freshman who declares pre-med because \"my parents are both doctors and expect me to be one too,\" without having explored other career options, is in identity foreclosure. A classmate who is taking courses in multiple departments, debating between psychology and philosophy, and feeling anxious about the decision is in moratorium",
      "id": "LDEV-0313"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "transformation-adolescence.html",
      "chapter_title": "Transformation — Adolescence",
      "section": "Risk-Taking Behavior",
      "passage_type": "example",
      "passage": "Exam Example A driving simulation study finds that adolescents run significantly more yellow lights and have more crashes when a peer is present in the room, compared to when they are alone. Adults show no difference. This finding is best explained by the dual systems model, which posits that peers activate the socioemotional reward system, overwhelming the not-yet-mature cognitive control system",
      "id": "LDEV-0314"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "transformation-adolescence.html",
      "chapter_title": "Transformation — Adolescence",
      "section": "Puberty and Physical Development",
      "passage_type": "paragraph",
      "passage": "Puberty is the biological process of sexual maturation that transforms a child's body into an adult body capable of reproduction. It is initiated by the activation of the hypothalamic-pituitary-gonadal (HPG) axis , which triggers increased production of sex hormones—primarily estrogen in females and testosterone in males",
      "id": "LDEV-0315"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "transformation-adolescence.html",
      "chapter_title": "Transformation — Adolescence",
      "section": "Sequence and Timing",
      "passage_type": "paragraph",
      "passage": "Puberty follows a predictable sequence of physical changes, though the timing of onset varies widely. For girls, the first visible sign is typically breast development (thelarche), followed by pubic hair growth, a growth spurt, and menarche (first menstruation, typically around age 12–13). For boys, the sequence begins with testicular enlargement, followed by penile growth, pubic hair, the growth spurt (which peaks about 2 years later than in girls), and deepening of the voice",
      "id": "LDEV-0316"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "transformation-adolescence.html",
      "chapter_title": "Transformation — Adolescence",
      "section": "Formal Operational Thought",
      "passage_type": "paragraph",
      "passage": "Piaget's formal operational stage (approximately age 11 and beyond) represents the pinnacle of cognitive development in his theory. Adolescents become capable of abstract, systematic, and scientific thinking that goes beyond the here-and-now world of concrete operations",
      "id": "LDEV-0317"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "transformation-adolescence.html",
      "chapter_title": "Transformation — Adolescence",
      "section": "Key Cognitive Achievements",
      "passage_type": "paragraph",
      "passage": "Piaget acknowledged that not all adolescents (or adults) achieve full formal operational thought, and that its application may be domain-specific. Subsequent research has confirmed that formal operations are reached by only about 40–60% of college students in Western samples when tested across multiple task domains",
      "id": "LDEV-0318"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "transformation-adolescence.html",
      "chapter_title": "Transformation — Adolescence",
      "section": "Elkind's Adolescent Egocentrism",
      "passage_type": "paragraph",
      "passage": "David Elkind (1967) proposed that the emergence of abstract thinking in adolescence gives rise to a new form of egocentrism manifested in two cognitive distortions:",
      "id": "LDEV-0319"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "transformation-adolescence.html",
      "chapter_title": "Transformation — Adolescence",
      "section": "Identity Development",
      "passage_type": "paragraph",
      "passage": "The central psychosocial task of adolescence, according to Erikson, is resolving the crisis of Identity vs. Role Confusion . Adolescents must integrate their various roles, values, and self-perceptions into a coherent sense of who they are and who they want to become. James Marcia (1966) operationalized Erikson's identity theory by proposing four identity statuses based on two dimensions: exploration (crisis) and commitment",
      "id": "LDEV-0320"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "transformation-adolescence.html",
      "chapter_title": "Transformation — Adolescence",
      "section": "The Adolescent Brain",
      "passage_type": "paragraph",
      "passage": "Neuroscience has fundamentally reshaped our understanding of adolescence by revealing that the brain continues to develop well into the mid-20s. Two key findings dominate this literature and have direct clinical and legal implications",
      "id": "LDEV-0321"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "transformation-adolescence.html",
      "chapter_title": "Transformation — Adolescence",
      "section": "Prefrontal Cortex Maturation",
      "passage_type": "paragraph",
      "passage": "The prefrontal cortex (PFC) —the brain region responsible for executive functions including planning, impulse control, decision-making, and considering consequences—is among the last regions to fully mature. Myelination and synaptic pruning in the PFC continue through the early to mid-20s. This protracted development explains why adolescents may show adult-like cognitive abilities in calm, low-arousal situations but revert to impulsive decision-making under emotional arousal or peer pressure",
      "id": "LDEV-0322"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "transformation-adolescence.html",
      "chapter_title": "Transformation — Adolescence",
      "section": "The Dual Systems Model",
      "passage_type": "paragraph",
      "passage": "The dual systems model  posits that the mismatch between the early maturation of the socioemotional system (centered on the limbic system, particularly the nucleus accumbens and amygdala) and the later maturation of the cognitive control system (centered on the prefrontal cortex) creates a developmental window of heightened vulnerability to risk-taking. The limbic system, which processes reward and emotional arousal, matures rapidly during puberty, while the PFC lags behind",
      "id": "LDEV-0323"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "transformation-adolescence.html",
      "chapter_title": "Transformation — Adolescence",
      "section": "Peer Influence and Risk-Taking",
      "passage_type": "paragraph",
      "passage": "Peer relationships reach peak importance during adolescence. The influence of peers on behavior—both positive and negative—intensifies, driven in part by the neurobiological changes described above",
      "id": "LDEV-0324"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "transformation-adolescence.html",
      "chapter_title": "Transformation — Adolescence",
      "section": "Peer Conformity",
      "passage_type": "paragraph",
      "passage": "Susceptibility to peer pressure peaks around ages 14–15 and then gradually declines as cognitive maturity increases. Research by Steinberg and Monahan (2007) demonstrates that resistance to peer influence increases linearly from ages 14 to 18 and then stabilizes in early adulthood. Importantly, peers can also exert positive influence, supporting academic achievement, prosocial behavior, and healthy identity exploration",
      "id": "LDEV-0325"
    },
    {
      "domain_code": "LDEV",
      "domain_name": "Lifespan & Developmental Stages",
      "chapter_file": "transformation-adolescence.html",
      "chapter_title": "Transformation — Adolescence",
      "section": "Risk-Taking Behavior",
      "passage_type": "paragraph",
      "passage": "Adolescence is characterized by increased rates of reckless driving, substance experimentation, unprotected sex, and delinquent behavior. Experimental research using driving simulation tasks shows that the presence of peers increases risk-taking in adolescents but not in adults, consistent with the dual systems model's prediction that peers amplify reward sensitivity in the context of an immature regulatory system",
      "id": "LDEV-0326"
    }
  ]
}