{
  "domain_code": "PTHE",
  "domain_name": "Psychotherapy Models, Interventions & Prevention",
  "total_passages": 162,
  "passages": [
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "acceptance.html",
      "chapter_title": "Through Acceptance",
      "section": "Acceptance and Commitment Therapy (ACT)",
      "passage_type": "definition",
      "passage": "Psychological Flexibility The central goal of ACT is to increase psychological flexibility -- the ability to contact the present moment fully as a conscious human being and to change or persist in behavior when doing so serves valued ends. Psychological inflexibility (the opposite) is viewed as the root of psychopathology",
      "id": "PTHE-0001"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "acceptance.html",
      "chapter_title": "Through Acceptance",
      "section": "Dialectical Behavior Therapy (DBT)",
      "passage_type": "definition",
      "passage": "The Biosocial Theory DBT is grounded in the biosocial theory , which proposes that BPD is primarily a disorder of emotion dysregulation resulting from the transaction between (1) a biological vulnerability to emotional sensitivity/reactivity and (2) an invalidating environment -- one that pervasively negates, dismisses, or punishes the child's emotional experiences",
      "id": "PTHE-0002"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "acceptance.html",
      "chapter_title": "Through Acceptance",
      "section": "Yalom's Four Ultimate Concerns",
      "passage_type": "definition",
      "passage": "Viktor Frankl and Logotherapy Frankl developed logotherapy (\"therapy through meaning\"), influenced by his experiences in Nazi concentration camps. Frankl proposed that the primary human motivation is a will to meaning , and that an existential vacuum (a sense of meaninglessness) is the source of much psychopathology. His technique of paradoxical intention involves instructing clients to intentionally engage in the feared behavior, thereby breaking the anticipatory anxiety cycle",
      "id": "PTHE-0003"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "acceptance.html",
      "chapter_title": "Through Acceptance",
      "section": "Treatment Modes and Structure",
      "passage_type": "clinical_note",
      "passage": "The Dialectical Stance The core dialectic in DBT is the balance between acceptance and change . The therapist simultaneously validates the client's experience (acceptance) while pushing for behavioral change. This balancing act is reflected in specific strategies: validation strategies (acceptance) and problem-solving strategies (change). The synthesis of these opposites drives therapeutic progress",
      "id": "PTHE-0004"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "acceptance.html",
      "chapter_title": "Through Acceptance",
      "section": "Acceptance and Commitment Therapy (ACT)",
      "passage_type": "paragraph",
      "passage": "ACT (pronounced as the word \"act\") was developed by Steven C. Hayes and is rooted in Relational Frame Theory (RFT) , a behavioral account of language and cognition. ACT is considered a \"third-wave\" cognitive-behavioral therapy that emphasizes acceptance rather than thought modification",
      "id": "PTHE-0005"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "acceptance.html",
      "chapter_title": "Through Acceptance",
      "section": "Dialectical Behavior Therapy (DBT)",
      "passage_type": "paragraph",
      "passage": "DBT was developed by Marsha Linehan originally for the treatment of borderline personality disorder (BPD) and chronically suicidal individuals. DBT combines standard cognitive-behavioral techniques with Eastern mindfulness practices and dialectical philosophy",
      "id": "PTHE-0006"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "acceptance.html",
      "chapter_title": "Through Acceptance",
      "section": "Mindfulness-Based Stress Reduction (MBSR)",
      "passage_type": "paragraph",
      "passage": "Developed by Jon Kabat-Zinn at the University of Massachusetts Medical Center, MBSR is an 8-week group program originally designed for chronic pain and stress-related conditions. The program includes body scan meditation, sitting meditation, gentle yoga, and informal mindfulness practices applied to daily activities",
      "id": "PTHE-0007"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "acceptance.html",
      "chapter_title": "Through Acceptance",
      "section": "Mindfulness-Based Cognitive Therapy (MBCT)",
      "passage_type": "paragraph",
      "passage": "Developed by Zindel Segal, Mark Williams, and John Teasdale , MBCT integrates MBSR with elements of CBT specifically for the prevention of depressive relapse. MBCT teaches patients to recognize early warning signs of depression and to disengage from ruminative thought patterns by relating differently to their thoughts. Research demonstrates that MBCT reduces relapse rates for patients with three or more prior depressive episodes",
      "id": "PTHE-0008"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "acceptance.html",
      "chapter_title": "Through Acceptance",
      "section": "Existential Therapy",
      "passage_type": "paragraph",
      "passage": "Existential therapy draws on existential philosophy (Kierkegaard, Heidegger, Sartre) and focuses on universal human concerns. Major contributors include Rollo May , Irvin Yalom , Viktor Frankl , and Ludwig Binswanger",
      "id": "PTHE-0009"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "cognition.html",
      "chapter_title": "Through Thoughts",
      "section": "Beck's Cognitive Therapy",
      "passage_type": "definition",
      "passage": "Levels of Cognition Beck identified three levels of cognition: (1) Automatic thoughts -- spontaneous, rapid cognitions that arise in response to situations (e.g., \"I'm going to fail\"); (2) Intermediate beliefs -- conditional rules and assumptions (e.g., \"If I don't get an A, I'm worthless\"); and (3) Core beliefs (schemas) -- deep, fundamental beliefs about self, others, and the world (e.g., \"I am incompetent\"). Therapy works from the surface level inward",
      "id": "PTHE-0010"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "cognition.html",
      "chapter_title": "Through Thoughts",
      "section": "Ellis's Rational Emotive Behavior Therapy (REBT)",
      "passage_type": "definition",
      "passage": "The ABC Model A (Activating event) -- The situation or trigger. B (Belief) -- The rational or irrational interpretation. C (Consequence) -- The emotional and behavioral result. Ellis added D (Disputing) -- Challenging the irrational belief, and E (Effective new belief) -- The rational replacement. The core insight: A does not cause C; B causes C",
      "id": "PTHE-0011"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "cognition.html",
      "chapter_title": "Through Thoughts",
      "section": "Irrational Beliefs",
      "passage_type": "clinical_note",
      "passage": "Beck vs. Ellis: Key Distinctions for the EPPP While both are cognitive approaches, there are important differences. Ellis is more directive and confrontational , actively disputing irrational beliefs. Beck uses Socratic questioning and guided discovery. Ellis focuses on irrational beliefs (musts/shoulds) ; Beck focuses on automatic thoughts, intermediate beliefs, and schemas . Ellis's approach is more philosophical; Beck's is more empirical and research-driven. Both are considered founders of the cognitive-behavioral tradition",
      "id": "PTHE-0012"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "cognition.html",
      "chapter_title": "Through Thoughts",
      "section": "CBT Techniques",
      "passage_type": "example",
      "passage": "Thought Record Example Situation: Gave a presentation at work. Automatic Thought: \"Everyone thought I was terrible.\" Emotion: Anxiety (85%). Evidence For: One person was on their phone. Evidence Against: Several people asked good questions; boss said \"nice job.\" Balanced Thought: \"Most people seemed engaged. One person being distracted doesn't mean I was terrible.\" Emotion after: Anxiety (35%)",
      "id": "PTHE-0013"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "cognition.html",
      "chapter_title": "Through Thoughts",
      "section": "Beck's Cognitive Therapy",
      "passage_type": "paragraph",
      "passage": "Aaron T. Beck developed cognitive therapy in the 1960s, originally for depression. Beck proposed that psychological distress results not from events themselves but from individuals' interpretations of those events. The cognitive model holds that distorted thinking influences mood and behavior, and that modifying dysfunctional cognitions produces improvements in affect and functioning",
      "id": "PTHE-0014"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "cognition.html",
      "chapter_title": "Through Thoughts",
      "section": "Cognitive Distortions",
      "passage_type": "paragraph",
      "passage": "Beck and his colleagues identified systematic errors in thinking called cognitive distortions . These are habitual patterns of biased information processing:",
      "id": "PTHE-0015"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "cognition.html",
      "chapter_title": "Through Thoughts",
      "section": "Beck's Cognitive Triad of Depression",
      "passage_type": "paragraph",
      "passage": "Beck proposed that depression involves a negative cognitive triad : negative views of (1) the self (\"I'm worthless\"), (2) the world (\"Everything is terrible\"), and (3) the future (\"Things will never get better\"). These negative schemas are activated by stressful events and maintained through systematic cognitive distortions",
      "id": "PTHE-0016"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "cognition.html",
      "chapter_title": "Through Thoughts",
      "section": "Ellis's Rational Emotive Behavior Therapy (REBT)",
      "passage_type": "paragraph",
      "passage": "Albert Ellis developed REBT (originally called Rational Emotive Therapy) in 1955, making it one of the earliest cognitive-behavioral approaches. REBT is based on the premise that emotional disturbance is largely caused by irrational beliefs about events, not by the events themselves",
      "id": "PTHE-0017"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "cognition.html",
      "chapter_title": "Through Thoughts",
      "section": "Irrational Beliefs",
      "passage_type": "paragraph",
      "passage": "Ellis identified several categories of irrational beliefs characterized by rigid, absolutistic demands (musts, shoulds, oughts):",
      "id": "PTHE-0018"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "cognition.html",
      "chapter_title": "Through Thoughts",
      "section": "Stress Inoculation Training (SIT)",
      "passage_type": "paragraph",
      "passage": "Stress Inoculation Training was developed by Donald Meichenbaum as a cognitive-behavioral approach to help clients build resilience to stress by developing coping skills before, during, and after stressful events. SIT follows a medical inoculation analogy -- exposure to manageable doses of stress builds resistance to future stress",
      "id": "PTHE-0019"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "cognition.html",
      "chapter_title": "Through Thoughts",
      "section": "Problem-Solving Therapy",
      "passage_type": "paragraph",
      "passage": "Problem-solving therapy (PST) , developed by Thomas D'Zurilla and Marvin Goldfried , is a cognitive-behavioral intervention that teaches clients a structured approach to identifying and implementing effective solutions to everyday problems. PST is based on the premise that psychopathology is often related to ineffective problem-solving skills or a negative problem orientation",
      "id": "PTHE-0020"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "conditioning.html",
      "chapter_title": "Through Conditioning",
      "section": "Systematic Desensitization",
      "passage_type": "definition",
      "passage": "Reciprocal Inhibition Wolpe's principle of reciprocal inhibition states: \"If a response inhibitory of anxiety can be made to occur in the presence of anxiety-evoking stimuli, it will weaken the bond between these stimuli and the anxiety response.\" Relaxation and anxiety are mutually exclusive autonomic nervous system states -- one cannot be deeply relaxed and intensely anxious at the same time",
      "id": "PTHE-0021"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "conditioning.html",
      "chapter_title": "Through Conditioning",
      "section": "Flooding and Implosive Therapy",
      "passage_type": "definition",
      "passage": "Flooding vs. Implosive Therapy Flooding involves exposure to the actual feared stimulus (in vivo) or vivid imaginal presentation at full intensity. Implosive therapy , developed by Thomas Stampfl , is an imaginal technique that incorporates psychodynamic themes (e.g., guilt, aggression, sexual content) into the anxiety scenes, often exaggerating the stimulus beyond realistic proportions to maximize anxiety arousal and subsequent extinction",
      "id": "PTHE-0022"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "conditioning.html",
      "chapter_title": "Through Conditioning",
      "section": "Two Components",
      "passage_type": "definition",
      "passage": "Why Both Components Are Necessary Exposure alone activates the obsessional anxiety, but without response prevention, the compulsion reduces anxiety through negative reinforcement, maintaining the OCD cycle. Response prevention alone does not provide sufficient exposure to trigger and extinguish the conditioned anxiety. Together, they allow the anxiety to habituate without the maladaptive compulsive relief, breaking the obsession-compulsion cycle",
      "id": "PTHE-0023"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "conditioning.html",
      "chapter_title": "Through Conditioning",
      "section": "Operant Conditioning Review",
      "passage_type": "definition",
      "passage": "Four Consequences of Behavior Positive reinforcement -- Adding a desirable stimulus to increase behavior. Negative reinforcement -- Removing an aversive stimulus to increase behavior. Positive punishment -- Adding an aversive stimulus to decrease behavior. Negative punishment -- Removing a desirable stimulus to decrease behavior. Remember: \"positive\" and \"negative\" refer to adding or removing, not to whether the experience is good or bad",
      "id": "PTHE-0024"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "conditioning.html",
      "chapter_title": "Through Conditioning",
      "section": "Contingency Contracts",
      "passage_type": "definition",
      "passage": "Quid Pro Quo vs. Good Faith Contracts In couples therapy, a quid pro quo contract links one partner's behavior change to the other's (\"If you do X, I'll do Y\"). A good faith contract provides reinforcement for each partner's behavior change independent of the other's (\"If you do X, you earn Y, regardless of what your partner does\"). Good faith contracts are generally preferred because they avoid creating a \"hostage\" dynamic",
      "id": "PTHE-0025"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "conditioning.html",
      "chapter_title": "Through Conditioning",
      "section": "Extinction and Extinction Burst",
      "passage_type": "definition",
      "passage": "Extinction Burst When a behavior that previously \"worked\" (was reinforced) no longer produces the expected consequence, the organism initially tries harder. A child who previously received attention for tantrums may throw a more intense tantrum when the parents first begin ignoring the behavior. Understanding the extinction burst is critical -- if the caregiver gives in during the burst, they inadvertently reinforce a more intense version of the behavior through intermittent reinforcement , making it even more resistant to extinction",
      "id": "PTHE-0026"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "conditioning.html",
      "chapter_title": "Through Conditioning",
      "section": "Mechanism of Action",
      "passage_type": "clinical_note",
      "passage": "Clinical Caution Flooding carries a risk of sensitization -- if the exposure session is terminated before habituation occurs, the anxiety may actually increase. This makes flooding potentially iatrogenic if not conducted properly. Clients must be fully informed and consent to the procedure, and therapists must ensure sessions are long enough (typically 60-90 minutes) for habituation to occur. Flooding is contraindicated for some clients, including those with serious cardiac conditions or fragile psychological states",
      "id": "PTHE-0027"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "conditioning.html",
      "chapter_title": "Through Conditioning",
      "section": "Types of Aversive Stimuli",
      "passage_type": "clinical_note",
      "passage": "Covert Sensitization Developed by Joseph Cautela , covert sensitization is a purely imaginal form of aversion therapy. The client imagines approaching the target behavior (e.g., reaching for a drink) and then vividly imagines an aversive consequence (e.g., becoming violently ill). Relief is imagined when the client turns away from the behavior. This is considered more ethically acceptable than physical aversion methods and is entirely \"covert\" (occurring in the imagination)",
      "id": "PTHE-0028"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "conditioning.html",
      "chapter_title": "Through Conditioning",
      "section": "Implications for Exposure Practice",
      "passage_type": "clinical_note",
      "passage": "Habituation vs. Inhibitory Learning Under the traditional habituation model , successful exposure is marked by within-session and between-session fear reduction. Under the inhibitory learning model , fear reduction during a session is neither necessary nor sufficient for learning. What matters is whether the client's feared prediction was violated. This has shifted clinical practice: therapists now focus on designing exposures that maximally disconfirm threat beliefs, rather than simply waiting for SUDs to decline",
      "id": "PTHE-0029"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "conditioning.html",
      "chapter_title": "Through Conditioning",
      "section": "Key Components",
      "passage_type": "clinical_note",
      "passage": "Advantages and Limitations Token economies are effective because they provide immediate reinforcement for desired behavior and bridge the delay to larger rewards. However, concerns include: (1) difficulty with generalization -- behaviors may not transfer outside the token economy setting; (2) ethical issues regarding the use of reinforcement programs with captive populations; and (3) the need for consistent staff training and implementation fidelity",
      "id": "PTHE-0030"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "conditioning.html",
      "chapter_title": "Through Conditioning",
      "section": "Three Steps of Systematic Desensitization",
      "passage_type": "example",
      "passage": "Anxiety Hierarchy Example: Fear of Dogs SUD 10: Looking at a photo of a small puppy. SUD 25: Seeing a dog on a leash across the street. SUD 40: Being in the same room as a small, calm dog on a leash. SUD 55: Standing 5 feet from a medium-sized dog. SUD 70: A dog walking past within arm's reach. SUD 85: Touching a calm dog briefly. SUD 100: A large unfamiliar dog approaching off-leash",
      "id": "PTHE-0031"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "conditioning.html",
      "chapter_title": "Through Conditioning",
      "section": "Biofeedback",
      "passage_type": "example",
      "passage": "Biofeedback for Tension Headache A client with chronic tension headaches is connected to an EMG sensor on the frontalis (forehead) muscle. The machine emits a tone that gets louder as muscle tension increases and quieter as it decreases. Through repeated sessions, the client learns to recognize and reduce excessive muscle tension, eventually gaining the ability to relax the frontalis muscle without the feedback device. This operant learning process (using biofeedback signals as reinforcement) is layered onto classical conditioning-based relaxation",
      "id": "PTHE-0032"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "conditioning.html",
      "chapter_title": "Through Conditioning",
      "section": "Key Components",
      "passage_type": "example",
      "passage": "Clinical Example On an inpatient psychiatric unit, patients earn tokens for attending group therapy (5 tokens), making their bed (2 tokens), and completing medication rounds on time (3 tokens). Tokens can be exchanged for TV time (10 tokens), a phone call (15 tokens), or an off-unit outing (50 tokens). A posted menu makes the system transparent and predictable",
      "id": "PTHE-0033"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "conditioning.html",
      "chapter_title": "Through Conditioning",
      "section": "Shaping (Successive Approximations)",
      "passage_type": "example",
      "passage": "Shaping Example Teaching a nonverbal child with autism to request items verbally: First, reinforce any vocalization. Then reinforce only sounds approximating the target word. Then reinforce only recognizable words. Then reinforce only complete requests (\"I want juice, please\"). Each step requires a closer approximation before reinforcement is delivered",
      "id": "PTHE-0034"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "conditioning.html",
      "chapter_title": "Through Conditioning",
      "section": "The Premack Principle",
      "passage_type": "example",
      "passage": "Premack Principle Examples \"You can play video games (high-probability behavior) after you finish your homework (low-probability behavior).\" / \"You can go to recess after completing the math worksheet.\" The more preferred activity serves as the reinforcer for the less preferred activity. This is one of the most intuitive and widely used behavioral principles in everyday life",
      "id": "PTHE-0035"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "conditioning.html",
      "chapter_title": "Through Conditioning",
      "section": "Systematic Desensitization",
      "passage_type": "paragraph",
      "passage": "Systematic desensitization was developed by Joseph Wolpe in the 1950s and is based on the principle of reciprocal inhibition -- the idea that an anxiety response can be inhibited by a simultaneously occurring response that is incompatible with anxiety (typically deep muscle relaxation). It is one of the earliest and most well-researched behavioral interventions for phobias and anxiety disorders",
      "id": "PTHE-0036"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "conditioning.html",
      "chapter_title": "Through Conditioning",
      "section": "In Vivo vs. Imaginal Desensitization",
      "passage_type": "paragraph",
      "passage": "In vivo desensitization involves real-life exposure to the feared stimuli (e.g., actually approaching a dog). Imaginal desensitization uses mental imagery. Research generally shows that in vivo desensitization is more effective, but imaginal methods are useful when in vivo exposure is impractical (e.g., fear of flying, fear of storms). Virtual reality exposure therapy combines elements of both approaches",
      "id": "PTHE-0037"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "conditioning.html",
      "chapter_title": "Through Conditioning",
      "section": "Flooding and Implosive Therapy",
      "passage_type": "paragraph",
      "passage": "In contrast to the gradual approach of systematic desensitization, flooding involves prolonged, intense exposure to the most anxiety-provoking stimulus without relaxation. The theoretical basis is extinction : sustained exposure in the absence of the feared consequence leads to a reduction in the conditioned anxiety response",
      "id": "PTHE-0038"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "conditioning.html",
      "chapter_title": "Through Conditioning",
      "section": "Mechanism of Action",
      "passage_type": "paragraph",
      "passage": "During flooding, the client's anxiety rises dramatically. However, because the feared catastrophic outcome does not occur and because the autonomic nervous system cannot sustain peak arousal indefinitely, anxiety eventually habituates. This process, called within-session habituation , is followed by between-session habituation across multiple sessions. The key requirement is that the client remain in the anxiety-provoking situation long enough for the anxiety to diminish -- premature escape can actually reinforce the fear through negative reinforcement",
      "id": "PTHE-0039"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "conditioning.html",
      "chapter_title": "Through Conditioning",
      "section": "Exposure and Response Prevention (ERP)",
      "passage_type": "paragraph",
      "passage": "Exposure and Response Prevention is the gold standard behavioral treatment for obsessive-compulsive disorder (OCD) . Developed by Victor Meyer and later systematized by Edna Foa , ERP combines exposure to obsession-triggering stimuli with prevention of the compulsive rituals that normally follow",
      "id": "PTHE-0040"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "conditioning.html",
      "chapter_title": "Through Conditioning",
      "section": "Aversion Therapy",
      "passage_type": "paragraph",
      "passage": "Aversion therapy uses classical conditioning principles to reduce the attractiveness of a stimulus by pairing it with an aversive experience. The goal is to create a conditioned aversion to a previously desired stimulus, such as alcohol, cigarettes, or deviant sexual arousal",
      "id": "PTHE-0041"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "conditioning.html",
      "chapter_title": "Through Conditioning",
      "section": "Counterconditioning",
      "passage_type": "paragraph",
      "passage": "Counterconditioning is the general principle underlying many classical conditioning treatments. It involves replacing a conditioned response (e.g., fear) with a new, incompatible response (e.g., relaxation) to the same stimulus. Systematic desensitization is the most well-known application of counterconditioning",
      "id": "PTHE-0042"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "conditioning.html",
      "chapter_title": "Through Conditioning",
      "section": "Inhibitory Learning Model of Exposure",
      "passage_type": "paragraph",
      "passage": "Recent theoretical developments have proposed the inhibitory learning model  as an alternative to the traditional habituation model for understanding how exposure therapy works. Rather than viewing anxiety reduction within a session as the key mechanism, the inhibitory learning model proposes that exposure creates a new, competing association (CS-no US) that inhibits, but does not erase, the original fear association (CS-US)",
      "id": "PTHE-0043"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "conditioning.html",
      "chapter_title": "Through Conditioning",
      "section": "Applied Relaxation",
      "passage_type": "paragraph",
      "passage": "Applied relaxation , developed by Lars-Goran Ost , teaches clients to rapidly apply relaxation skills in anxiety-provoking situations. The training progresses through stages: (1) progressive muscle relaxation, (2) release-only relaxation (without initial tension), (3) cue-controlled relaxation (pairing relaxation with a cue word), (4) differential relaxation (relaxing in various postures), and (5) rapid relaxation (achieving relaxation in 20-30 seconds). The final stage involves application in real-world anxiety situations",
      "id": "PTHE-0044"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "conditioning.html",
      "chapter_title": "Through Conditioning",
      "section": "Biofeedback",
      "passage_type": "paragraph",
      "passage": "Biofeedback uses electronic instruments to provide real-time information about physiological processes (e.g., muscle tension via EMG, skin temperature, heart rate, EEG brain waves). By observing these signals, clients learn to gain voluntary control over typically automatic physiological functions. Common applications include tension headaches (EMG biofeedback of frontalis muscle), Raynaud's disease (thermal biofeedback), and anxiety disorders. Neurofeedback (EEG biofeedback) has been applied to ADHD, though its evidence base remains debated",
      "id": "PTHE-0045"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "conditioning.html",
      "chapter_title": "Through Conditioning",
      "section": "Eye Movement Desensitization and Reprocessing (EMDR)",
      "passage_type": "paragraph",
      "passage": "EMDR was developed by Francine Shapiro in 1987 as a treatment for trauma and PTSD. While its theoretical basis is debated and it does not fit neatly into classical conditioning, it shares exposure-based elements and is frequently tested on the EPPP alongside classical conditioning treatments",
      "id": "PTHE-0046"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "conditioning.html",
      "chapter_title": "Through Conditioning",
      "section": "Operant Conditioning Review",
      "passage_type": "paragraph",
      "passage": "Operant conditioning treatments are based on B.F. Skinner's principles of learning, in which behavior is shaped by its consequences. Unlike classical conditioning (which pairs stimuli), operant procedures modify behavior by manipulating the antecedents (what comes before the behavior) and consequences (what follows the behavior)",
      "id": "PTHE-0047"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "conditioning.html",
      "chapter_title": "Through Conditioning",
      "section": "Token Economies",
      "passage_type": "paragraph",
      "passage": "A token economy is a systematic reinforcement program in which individuals earn tokens (conditioned/secondary reinforcers) for performing specified target behaviors. Tokens can later be exchanged for backup reinforcers (items, privileges, activities). Token economies are used extensively in institutional settings such as psychiatric hospitals, schools, and residential treatment facilities",
      "id": "PTHE-0048"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "conditioning.html",
      "chapter_title": "Through Conditioning",
      "section": "Contingency Management",
      "passage_type": "paragraph",
      "passage": "Contingency management (CM) refers to the systematic application of reinforcement contingencies to increase desired behavior or decrease undesired behavior. In clinical settings, CM has been particularly effective for substance use disorders",
      "id": "PTHE-0049"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "conditioning.html",
      "chapter_title": "Through Conditioning",
      "section": "Voucher-Based Reinforcement",
      "passage_type": "paragraph",
      "passage": "In the voucher-based reinforcement approach (developed by Stephen Higgins for cocaine dependence), patients earn vouchers with monetary value for each drug-negative urine sample. Voucher values escalate with consecutive negative samples, providing an increasing incentive for sustained abstinence. A positive sample resets the voucher value to baseline",
      "id": "PTHE-0050"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "conditioning.html",
      "chapter_title": "Through Conditioning",
      "section": "Contingency Contracts",
      "passage_type": "paragraph",
      "passage": "A contingency contract (or behavioral contract) is a written agreement between two or more parties specifying: (1) the target behavior, (2) the reinforcement contingencies (rewards for compliance, consequences for non-compliance), and (3) the monitoring method. Contracts are used in family therapy, couples therapy, schools, and substance abuse treatment",
      "id": "PTHE-0051"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "conditioning.html",
      "chapter_title": "Through Conditioning",
      "section": "Behavioral Activation",
      "passage_type": "paragraph",
      "passage": "Behavioral activation (BA) is an operant treatment for depression based on the behavioral model that depression is maintained by a cycle of avoidance and withdrawal that reduces access to positive reinforcement. As the depressed person withdraws from activities, they experience fewer rewarding interactions, which worsens depression, leading to further withdrawal",
      "id": "PTHE-0052"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "conditioning.html",
      "chapter_title": "Through Conditioning",
      "section": "Shaping (Successive Approximations)",
      "passage_type": "paragraph",
      "passage": "Shaping involves reinforcing successive approximations of a target behavior that is not currently in the individual's repertoire. Rather than waiting for the final behavior to occur, the therapist reinforces behaviors that increasingly resemble the goal",
      "id": "PTHE-0053"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "conditioning.html",
      "chapter_title": "Through Conditioning",
      "section": "Chaining",
      "passage_type": "paragraph",
      "passage": "Chaining is used to teach complex behaviors that consist of a sequence of discrete steps. Each step serves as a discriminative stimulus (SD) for the next step and a conditioned reinforcer for the previous step",
      "id": "PTHE-0054"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "conditioning.html",
      "chapter_title": "Through Conditioning",
      "section": "Differential Reinforcement",
      "passage_type": "paragraph",
      "passage": "Differential reinforcement procedures are used to decrease undesirable behaviors without using punishment, by selectively reinforcing alternative or incompatible behaviors:",
      "id": "PTHE-0055"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "conditioning.html",
      "chapter_title": "Through Conditioning",
      "section": "The Premack Principle",
      "passage_type": "paragraph",
      "passage": "The Premack Principle (also known as \"Grandma's Rule\") states that a high-probability behavior can be used to reinforce a low-probability behavior. Formally: access to a more preferred activity is contingent upon completing a less preferred activity",
      "id": "PTHE-0056"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "conditioning.html",
      "chapter_title": "Through Conditioning",
      "section": "Extinction and Extinction Burst",
      "passage_type": "paragraph",
      "passage": "Extinction in operant conditioning involves withholding reinforcement for a previously reinforced behavior. When reinforcement is discontinued, the behavior will eventually decrease. However, the initial effect is often an extinction burst -- a temporary increase in the frequency, intensity, or variability of the behavior before it declines",
      "id": "PTHE-0057"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "conditioning.html",
      "chapter_title": "Through Conditioning",
      "section": "Spontaneous Recovery",
      "passage_type": "paragraph",
      "passage": "After extinction, the behavior may temporarily reappear after a period of time -- a phenomenon called spontaneous recovery . This does not mean extinction has failed; continued non-reinforcement will lead to re-extinction. Clinicians must educate caregivers and staff about both extinction bursts and spontaneous recovery to prevent premature abandonment of the intervention",
      "id": "PTHE-0058"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "conditioning.html",
      "chapter_title": "Through Conditioning",
      "section": "Schedule Effects on Extinction",
      "passage_type": "paragraph",
      "passage": "Behaviors maintained on continuous reinforcement (CRF) schedules extinguish more quickly than those on intermittent (partial) reinforcement schedules. This is known as the partial reinforcement extinction effect (PREE) . Clinically, this means that behaviors which have been intermittently reinforced (e.g., a child who sometimes gets what they want by whining) will be harder to extinguish and will show more pronounced extinction bursts",
      "id": "PTHE-0059"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "conditioning.html",
      "chapter_title": "Through Conditioning",
      "section": "Functional Behavior Assessment (FBA)",
      "passage_type": "paragraph",
      "passage": "Before implementing any operant intervention, best practice requires conducting a functional behavior assessment (FBA) to identify the function (purpose) of the problem behavior. The four primary functions of behavior are:",
      "id": "PTHE-0060"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "conditioning.html",
      "chapter_title": "Through Conditioning",
      "section": "Time-Out from Positive Reinforcement",
      "passage_type": "paragraph",
      "passage": "Time-out is a form of negative punishment -- it decreases behavior by temporarily removing access to reinforcement. There are two types: exclusionary time-out (removing the child from the reinforcing environment) and non-exclusionary time-out (removing reinforcement while the child remains in the environment, e.g., putting a toy in a \"rest\" box)",
      "id": "PTHE-0061"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "conditioning.html",
      "chapter_title": "Through Conditioning",
      "section": "Response Cost",
      "passage_type": "paragraph",
      "passage": "Response cost is another form of negative punishment in which a specific amount of reinforcement is removed contingent on an undesired behavior. It is often used in conjunction with token economies (e.g., losing tokens for rule violations)",
      "id": "PTHE-0062"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "conditioning.html",
      "chapter_title": "Through Conditioning",
      "section": "Overcorrection",
      "passage_type": "paragraph",
      "passage": "Overcorrection requires the individual to correct the effects of the misbehavior and then practice an appropriate alternative. It has two components: restitutional overcorrection (restoring the environment to a better-than-original state, e.g., cleaning up the mess and the rest of the room) and positive practice overcorrection (repeatedly practicing the correct behavior)",
      "id": "PTHE-0063"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "conditioning.html",
      "chapter_title": "Through Conditioning",
      "section": "Stimulus Generalization and Discrimination Training",
      "passage_type": "paragraph",
      "passage": "Stimulus generalization occurs when a behavior reinforced in one context spreads to similar contexts. While sometimes desirable (e.g., a child using polite language at school and at home), it can also be problematic (e.g., a child who learns to tantrum at home also tantrums at school). Discrimination training teaches the individual to respond differently in different contexts by reinforcing behavior in the presence of one stimulus (SD) and not reinforcing it in the presence of another (S-delta)",
      "id": "PTHE-0064"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "conditioning.html",
      "chapter_title": "Through Conditioning",
      "section": "Programming for Generalization",
      "passage_type": "paragraph",
      "passage": "One of the primary challenges with operant interventions is ensuring that behavior changes generalize beyond the training environment. Stokes and Baer (1977) identified strategies for promoting generalization:",
      "id": "PTHE-0065"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "evidence.html",
      "chapter_title": "Through Evidence",
      "section": "Subsequent Key Meta-Analytic Findings",
      "passage_type": "definition",
      "passage": "Effect Size Interpretation Cohen's d: 0.2 = small , 0.5 = medium , 0.8 = large . The overall effect of psychotherapy (d = 0.80-0.85) is considered a large effect -- comparable to many well-accepted medical interventions. This means the average person receiving therapy is better off than approximately 80% of those who do not receive therapy",
      "id": "PTHE-0066"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "evidence.html",
      "chapter_title": "Through Evidence",
      "section": "Evidence-Based Practice (EBP)",
      "passage_type": "definition",
      "passage": "Three Components of EBPP (1) Best available research evidence -- Including but not limited to RCTs; also systematic case studies, qualitative research, process research, and clinical observation. (2) Clinical expertise -- The clinician's judgment, skill, and experience in applying treatments, including the ability to form a strong therapeutic alliance, assess patient needs, and adapt interventions. (3) Patient characteristics, culture, and preferences -- Individual differences in values, beliefs, cultural background, and treatment preferences that must guide clinical decision-making",
      "id": "PTHE-0067"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "evidence.html",
      "chapter_title": "Through Evidence",
      "section": "Levels of Prevention",
      "passage_type": "definition",
      "passage": "Caplan's Three Levels of Prevention Primary prevention -- Interventions directed at the general population or at-risk groups before a disorder develops. Goal: reduce the incidence (new cases) of disorder. Secondary prevention -- Early identification and treatment of a disorder in its initial stages . Goal: reduce the prevalence (total cases) and severity by catching problems early. Tertiary prevention -- Interventions aimed at reducing the disability, relapse, and complications associated with an already-established disorder. Goal: reduce residual effects and prevent recurrence",
      "id": "PTHE-0068"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "evidence.html",
      "chapter_title": "Through Evidence",
      "section": "Caplan's Consultation Model",
      "passage_type": "definition",
      "passage": "Core Principles of Caplan's Model The consultant works indirectly -- improving the consultee's ability to handle current and future similar cases, rather than directly treating the client. The consultee retains full responsibility for the client. The consultation relationship is coordinate (non-hierarchical), voluntary , and confidential . The goal is to enhance the consultee's professional functioning, not to provide personal therapy",
      "id": "PTHE-0069"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "evidence.html",
      "chapter_title": "Through Evidence",
      "section": "Key Community Psychology Concepts",
      "passage_type": "definition",
      "passage": "The Community Mental Health Movement The Community Mental Health Centers Act (1963) , signed by President Kennedy, established federally funded community mental health centers (CMHCs). These centers were required to provide five essential services: (1) inpatient care, (2) outpatient care, (3) partial hospitalization, (4) emergency services, and (5) consultation and education. This legislation was a cornerstone of deinstitutionalization -- the movement to shift care from large state hospitals to community-based settings",
      "id": "PTHE-0070"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "evidence.html",
      "chapter_title": "Through Evidence",
      "section": "The Dodo Bird Verdict",
      "passage_type": "clinical_note",
      "passage": "The Debate Supporters of the Dodo bird verdict (e.g., Wampold, Luborsky) argue that when bona fide treatments are compared, effect size differences are minimal, and that common factors (shared by all therapies) account for most therapeutic change. Critics (e.g., Chambless, Beutler) argue that specific treatments do outperform others for specific disorders (e.g., ERP for OCD, CBT for panic disorder) and that lumping all therapies together obscures meaningful differences. This debate remains one of the most important in the field",
      "id": "PTHE-0071"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "evidence.html",
      "chapter_title": "Through Evidence",
      "section": "Notable Prevention Programs",
      "passage_type": "clinical_note",
      "passage": "Primary Prevention vs. Psychotherapy A critical distinction for the EPPP: primary prevention targets populations before disorder onset and aims to reduce incidence (new cases). Psychotherapy is a form of tertiary prevention that treats existing disorders. Screening programs (e.g., PHQ-9 for depression in primary care) are secondary prevention because they aim for early detection. The EPPP frequently asks examinees to classify interventions into the correct prevention level based on the target population and timing",
      "id": "PTHE-0072"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "evidence.html",
      "chapter_title": "Through Evidence",
      "section": "Principles of Crisis Intervention",
      "passage_type": "clinical_note",
      "passage": "Psychological First Aid vs. Critical Incident Stress Debriefing Psychological First Aid (PFA) is the current evidence-informed approach to immediate post-disaster/crisis support. It emphasizes safety, calming, self-efficacy, connectedness, and hope. Critical Incident Stress Debriefing (CISD) -- a structured group intervention conducted within 24-72 hours of a traumatic event -- was once widely used but is no longer recommended. Research (including a Cochrane review) found that CISD does not prevent PTSD and may actually interfere with natural recovery processes",
      "id": "PTHE-0073"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "evidence.html",
      "chapter_title": "Through Evidence",
      "section": "Examples and Characteristics",
      "passage_type": "clinical_note",
      "passage": "Professional Role with Self-Help Groups Psychologists can serve as consultants to self-help groups, provide referrals, and collaborate with these organizations. However, it is important to recognize that self-help groups are not a substitute for professional treatment in all cases. Research on AA and 12-step facilitation therapy (TSF) suggests that active involvement in AA is associated with improved abstinence outcomes. The Project MATCH study found TSF to be as effective as CBT and motivational enhancement therapy for alcohol use disorder",
      "id": "PTHE-0074"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "evidence.html",
      "chapter_title": "Through Evidence",
      "section": "Criteria for EST Designation",
      "passage_type": "example",
      "passage": "Examples of Well-Established ESTs CBT for depression and anxiety disorders. ERP for OCD. Behavioral couples therapy for relationship distress. CBT for bulimia nervosa. Interpersonal therapy for depression. Prolonged exposure for PTSD. These treatments have the strongest evidence bases, supported by multiple RCTs from independent research groups",
      "id": "PTHE-0075"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "evidence.html",
      "chapter_title": "Through Evidence",
      "section": "IOM Classification (Alternative Framework)",
      "passage_type": "example",
      "passage": "Distinguishing Prevention Levels A schoolwide social-emotional learning curriculum delivered to all students = primary/universal prevention . Screening all students for depression and referring those who score high = secondary prevention . A cognitive-behavioral group for students already diagnosed with anxiety = tertiary prevention . The EPPP frequently tests the ability to correctly classify interventions into these levels",
      "id": "PTHE-0076"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "evidence.html",
      "chapter_title": "Through Evidence",
      "section": "Efficacy vs. Effectiveness",
      "passage_type": "paragraph",
      "passage": "A fundamental distinction in psychotherapy outcome research is between efficacy and effectiveness studies. Understanding this distinction is critical for evaluating the evidence base for psychological treatments",
      "id": "PTHE-0077"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "evidence.html",
      "chapter_title": "Through Evidence",
      "section": "The Dodo Bird Verdict",
      "passage_type": "paragraph",
      "passage": "The Dodo bird verdict refers to the controversial conclusion that all bona fide psychotherapies produce roughly equivalent outcomes. The name derives from the Dodo bird in Alice's Adventures in Wonderland , who declared after a race: \"Everybody has won, and all must have prizes.\"",
      "id": "PTHE-0078"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "evidence.html",
      "chapter_title": "Through Evidence",
      "section": "The Dodo Bird Verdict",
      "passage_type": "paragraph",
      "passage": "Saul Rosenzweig (1936) first suggested this idea, and Lester Luborsky and colleagues (1975) provided the first empirical support through a review of comparative outcome studies. Their frequently cited conclusion: \"Everyone has won and all must have prizes.\"",
      "id": "PTHE-0079"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "evidence.html",
      "chapter_title": "Through Evidence",
      "section": "Common Factors",
      "passage_type": "paragraph",
      "passage": "The common factors model holds that ingredients shared across all effective therapies are the primary drivers of therapeutic change, rather than technique-specific factors unique to each orientation. Research suggests the following approximate breakdown of outcome variance:",
      "id": "PTHE-0080"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "evidence.html",
      "chapter_title": "Through Evidence",
      "section": "Empirically Supported Treatments (ESTs)",
      "passage_type": "paragraph",
      "passage": "The Empirically Supported Treatment (EST) movement, led by the APA Division 12 (Society of Clinical Psychology) Task Force, aimed to identify specific treatments with demonstrated efficacy for specific disorders",
      "id": "PTHE-0081"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "evidence.html",
      "chapter_title": "Through Evidence",
      "section": "Dose-Response Research",
      "passage_type": "paragraph",
      "passage": "The dose-response model examines the relationship between the \"dose\" of therapy (typically measured in number of sessions) and therapeutic outcome",
      "id": "PTHE-0082"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "evidence.html",
      "chapter_title": "Through Evidence",
      "section": "Howard's Dose-Response Curve",
      "passage_type": "paragraph",
      "passage": "Kenneth Howard and colleagues (1986) found a negatively accelerating (log-linear) relationship between number of sessions and improvement:",
      "id": "PTHE-0083"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "evidence.html",
      "chapter_title": "Through Evidence",
      "section": "Howard's Dose-Response Curve",
      "passage_type": "paragraph",
      "passage": "The curve shows diminishing returns -- the largest gains occur earliest in treatment, with progressively smaller incremental gains per additional session. This has significant implications for managed care and session limits",
      "id": "PTHE-0084"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "evidence.html",
      "chapter_title": "Through Evidence",
      "section": "Meta-Analysis Findings",
      "passage_type": "paragraph",
      "passage": "Meta-analysis is a statistical technique for combining results across multiple studies to estimate an overall effect size. It has been transformative for psychotherapy outcome research",
      "id": "PTHE-0085"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "evidence.html",
      "chapter_title": "Through Evidence",
      "section": "The Smith and Glass (1977) Meta-Analysis",
      "passage_type": "paragraph",
      "passage": "Mary Lee Smith and Gene Glass conducted the landmark first meta-analysis of psychotherapy outcomes, combining 375 studies. Their key findings:",
      "id": "PTHE-0086"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "evidence.html",
      "chapter_title": "Through Evidence",
      "section": "Evidence-Based Practice (EBP)",
      "passage_type": "paragraph",
      "passage": "In response to criticisms of the EST movement, the APA Presidential Task Force on Evidence-Based Practice adopted a broader framework. Evidence-based practice in psychology (EBPP) is defined as \"the integration of the best available research with clinical expertise in the context of patient characteristics, culture, and preferences\" (APA, 2006)",
      "id": "PTHE-0087"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "evidence.html",
      "chapter_title": "Through Evidence",
      "section": "Therapist Effects",
      "passage_type": "paragraph",
      "passage": "Research consistently shows that there is significant variability in outcomes across therapists, even when delivering the same manualized treatment. Therapist effects account for approximately 5-9% of outcome variance -- comparable to or larger than the effects of specific treatment techniques. Factors associated with more effective therapists include:",
      "id": "PTHE-0088"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "evidence.html",
      "chapter_title": "Through Evidence",
      "section": "Client Variables as Predictors",
      "passage_type": "paragraph",
      "passage": "Client characteristics are the single largest predictor of therapy outcome (accounting for roughly 40% of variance per Lambert's model). Key client variables include:",
      "id": "PTHE-0089"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "evidence.html",
      "chapter_title": "Through Evidence",
      "section": "Deterioration and Negative Effects",
      "passage_type": "paragraph",
      "passage": "While therapy is generally effective, research indicates that approximately 5-10% of adult clients and 14-24% of child clients deteriorate during treatment. Lambert developed an early warning system (OQ-45) that tracks client progress session-by-session and alerts therapists when clients are not improving or are deteriorating, allowing for mid-course corrections",
      "id": "PTHE-0090"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "evidence.html",
      "chapter_title": "Through Evidence",
      "section": "Levels of Prevention",
      "passage_type": "paragraph",
      "passage": "The prevention framework, originally developed in public health and adapted for mental health by Gerald Caplan , organizes prevention efforts into three levels based on when the intervention occurs relative to the onset of disorder",
      "id": "PTHE-0091"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "evidence.html",
      "chapter_title": "Through Evidence",
      "section": "Caplan's Consultation Model",
      "passage_type": "paragraph",
      "passage": "Gerald Caplan developed the most influential model of mental health consultation , which he defined as a process between a professional helper (consultant) and a help-seeker (consultee) who has responsibility for a client or program. The consultant has no direct authority over the consultee, and the relationship is non-hierarchical and voluntary",
      "id": "PTHE-0092"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "evidence.html",
      "chapter_title": "Through Evidence",
      "section": "Consultee-Centered Case Consultation in Detail",
      "passage_type": "paragraph",
      "passage": "Caplan regarded consultee-centered case consultation as the most unique and important type. He identified four reasons a consultee may have difficulty with a case:",
      "id": "PTHE-0093"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "evidence.html",
      "chapter_title": "Through Evidence",
      "section": "Behavioral Consultation",
      "passage_type": "paragraph",
      "passage": "Behavioral consultation applies behavioral principles (functional analysis, reinforcement, environmental modification) to consultation. The consultant helps the consultee conduct a functional behavioral assessment, identify antecedents and consequences maintaining problem behavior, and design a behavior intervention plan. Common in school settings",
      "id": "PTHE-0094"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "evidence.html",
      "chapter_title": "Through Evidence",
      "section": "Organizational Consultation",
      "passage_type": "paragraph",
      "passage": "Organizational consultation focuses on the system level, addressing organizational culture, structure, communication, and processes rather than individual cases. Approaches include process consultation (Edgar Schein), where the consultant helps the organization diagnose and solve its own problems rather than providing expert recommendations",
      "id": "PTHE-0095"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "evidence.html",
      "chapter_title": "Through Evidence",
      "section": "Community Psychology",
      "passage_type": "paragraph",
      "passage": "Community psychology emerged in the 1960s (formalized at the Swampscott Conference in 1965) as a reaction against the limitations of the individual-treatment model. Community psychology shifts the focus from treating individuals to changing systems, environments, and social conditions that contribute to psychological problems",
      "id": "PTHE-0096"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "evidence.html",
      "chapter_title": "Through Evidence",
      "section": "Resilience and Protective Factors",
      "passage_type": "paragraph",
      "passage": "Prevention research has increasingly focused on identifying protective factors that buffer individuals against developing psychological disorders, even in the presence of significant risk factors. Key protective factors include:",
      "id": "PTHE-0097"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "evidence.html",
      "chapter_title": "Through Evidence",
      "section": "Crisis Intervention",
      "passage_type": "paragraph",
      "passage": "Crisis intervention is a form of secondary prevention that provides immediate, short-term assistance to individuals experiencing acute psychological distress. Grounded in crisis theory (developed by Erich Lindemann and Gerald Caplan), it assumes that crises are time-limited (typically resolving within 4-6 weeks) and that individuals in crisis are more amenable to change",
      "id": "PTHE-0098"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "evidence.html",
      "chapter_title": "Through Evidence",
      "section": "Self-Help and Mutual Support Groups",
      "passage_type": "paragraph",
      "passage": "Self-help groups (also called mutual support or peer support groups) are voluntary organizations of people who share a common condition or experience. They differ from professionally led group therapy in that they are typically peer-facilitated and free of charge",
      "id": "PTHE-0099"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "insight.html",
      "chapter_title": "Through the Unconscious",
      "section": "Freud and Classical Psychoanalysis",
      "passage_type": "definition",
      "passage": "Structural Model of the Mind Freud's structural model posits three mental structures: (1) Id -- operates on the pleasure principle; contains instinctual drives (Eros/life and Thanatos/death); entirely unconscious. (2) Ego -- operates on the reality principle; mediates between id impulses, superego demands, and external reality; spans conscious, preconscious, and unconscious. (3) Superego -- the moral component, incorporating parental and societal standards; includes the conscience (punitive) and the ego-ideal (aspirational)",
      "id": "PTHE-0100"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "insight.html",
      "chapter_title": "Through the Unconscious",
      "section": "Ego Psychology",
      "passage_type": "definition",
      "passage": "Key Ego Psychology Concepts Ego autonomy -- The ego has its own energy source and can function independently of the id. Adaptation -- The ego's primary function is to facilitate adaptation to the environment. Erik Erikson extended ego psychology across the lifespan with his eight psychosocial stages, emphasizing social and cultural influences on ego development. Erikson's stages emphasize ego identity crises at each developmental period",
      "id": "PTHE-0101"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "insight.html",
      "chapter_title": "Through the Unconscious",
      "section": "Selfobject Needs",
      "passage_type": "definition",
      "passage": "Therapeutic Approach in Self Psychology The therapist functions as an empathic selfobject who provides the mirroring and idealization the client missed in development. Inevitable empathic failures ( optimal frustrations ) by the therapist, when repaired through empathic understanding, allow the client to develop internal self-soothing capacities through a process called transmuting internalization . The therapist uses empathic immersion (experiencing the world from the client's perspective) as the primary therapeutic stance",
      "id": "PTHE-0102"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "insight.html",
      "chapter_title": "Through the Unconscious",
      "section": "Defense Mechanisms",
      "passage_type": "clinical_note",
      "passage": "Defense Mechanism Hierarchy Defenses range from immature/primitive (denial, projection, splitting) to mature (sublimation, humor, suppression). Sublimation is considered the most mature defense. Repression is considered the most fundamental defense -- the cornerstone of all other defenses. For the EPPP, be able to distinguish between similar defenses: projection vs. displacement, repression vs. suppression (suppression is conscious), rationalization vs. intellectualization",
      "id": "PTHE-0103"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "insight.html",
      "chapter_title": "Through the Unconscious",
      "section": "Notable Brief Psychodynamic Approaches",
      "passage_type": "clinical_note",
      "passage": "Core Conflictual Relationship Theme (CCRT) Luborsky's CCRT method identifies recurring relationship patterns across the client's narratives. Each episode is coded for three components: (1) the client's wish or need (e.g., \"I want to be accepted\"), (2) the response of the other (e.g., \"Others reject me\"), and (3) the response of the self (e.g., \"I feel depressed and withdraw\"). The most frequently occurring pattern becomes the therapeutic focus. This method has been widely used in psychotherapy process research",
      "id": "PTHE-0104"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "insight.html",
      "chapter_title": "Through the Unconscious",
      "section": "Donald Winnicott",
      "passage_type": "example",
      "passage": "Clinical Application A client with borderline personality features frequently sees the therapist as either \"the best therapist ever\" or \"completely useless.\" This splitting reflects a failure to achieve Klein's depressive position -- the inability to integrate good and bad qualities into a coherent whole-object representation. Object relations therapy would help the client develop the capacity for ambivalence (holding contradictory feelings simultaneously)",
      "id": "PTHE-0105"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "insight.html",
      "chapter_title": "Through the Unconscious",
      "section": "Freud and Classical Psychoanalysis",
      "passage_type": "paragraph",
      "passage": "Sigmund Freud developed psychoanalysis in the late 19th century, creating the first comprehensive theory of personality and the first systematic psychotherapy. Psychoanalysis is based on the premise that unconscious conflicts, often originating in childhood, drive psychological symptoms and maladaptive behavior",
      "id": "PTHE-0106"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "insight.html",
      "chapter_title": "Through the Unconscious",
      "section": "Defense Mechanisms",
      "passage_type": "paragraph",
      "passage": "Defense mechanisms are unconscious ego strategies for managing anxiety arising from conflicts between the id, superego, and reality. Key defenses include:",
      "id": "PTHE-0107"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "insight.html",
      "chapter_title": "Through the Unconscious",
      "section": "Transference and Countertransference",
      "passage_type": "paragraph",
      "passage": "Transference occurs when the client unconsciously redirects feelings and attitudes from past relationships (especially with parents) onto the therapist. The analysis of transference is considered the central vehicle of change in psychoanalysis. Countertransference refers to the therapist's emotional reactions to the client, which may reflect the therapist's own unresolved conflicts or provide clinically useful information about the client's interpersonal impact",
      "id": "PTHE-0108"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "insight.html",
      "chapter_title": "Through the Unconscious",
      "section": "Ego Psychology",
      "passage_type": "paragraph",
      "passage": "Ego psychology shifted the emphasis from the id to the adaptive functions of the ego. Anna Freud systematized the defense mechanisms in The Ego and the Mechanisms of Defense (1936). Heinz Hartmann proposed the concept of the conflict-free ego sphere -- autonomous ego functions (perception, memory, learning) that operate independently of instinctual drives",
      "id": "PTHE-0109"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "insight.html",
      "chapter_title": "Through the Unconscious",
      "section": "Object Relations Theory",
      "passage_type": "paragraph",
      "passage": "Object relations theory focuses on how early relationships (especially with the mother) are internalized as mental representations (\"objects\") that shape personality and later relationships. The term \"object\" refers to significant people in the individual's life",
      "id": "PTHE-0110"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "insight.html",
      "chapter_title": "Through the Unconscious",
      "section": "Otto Kernberg",
      "passage_type": "paragraph",
      "passage": "Otto Kernberg integrated object relations theory with ego psychology, creating a comprehensive framework for understanding personality pathology -- particularly borderline and narcissistic personality organization. Kernberg's central construct is the object relations unit : a mental structure consisting of a self-representation, an object-representation, and the affect linking them. These internalized units, formed through early relational experiences, become the building blocks of personality structure",
      "id": "PTHE-0111"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "insight.html",
      "chapter_title": "Through the Unconscious",
      "section": "Otto Kernberg",
      "passage_type": "paragraph",
      "passage": "Kernberg developed Transference-Focused Psychotherapy (TFP) , a manualized, psychodynamic treatment designed primarily for borderline personality disorder. TFP uses the therapeutic relationship as the primary vehicle of change, with particular emphasis on:",
      "id": "PTHE-0112"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "insight.html",
      "chapter_title": "Through the Unconscious",
      "section": "Self Psychology (Kohut)",
      "passage_type": "paragraph",
      "passage": "Heinz Kohut developed self psychology, focusing on the development and maintenance of a cohesive sense of self. Kohut argued that narcissistic needs are normal developmental requirements, not pathological. Psychopathology arises from empathic failures by caregivers",
      "id": "PTHE-0113"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "insight.html",
      "chapter_title": "Through the Unconscious",
      "section": "Brief Psychodynamic Therapy",
      "passage_type": "paragraph",
      "passage": "Several clinicians adapted psychoanalytic principles into time-limited formats. These brief psychodynamic therapies typically involve 12-40 sessions and share key features:",
      "id": "PTHE-0114"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "motivation.html",
      "chapter_title": "Through Motivation",
      "section": "Solution-Focused Brief Therapy (SFBT)",
      "passage_type": "definition",
      "passage": "Core Philosophy SFBT operates on several key assumptions: (1) if it isn't broken, don't fix it; (2) if something works, do more of it; (3) if something doesn't work, do something different; (4) small steps can lead to large changes; and (5) the solution is not necessarily related to the problem",
      "id": "PTHE-0115"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "motivation.html",
      "chapter_title": "Through Motivation",
      "section": "Motivational Interviewing (MI)",
      "passage_type": "definition",
      "passage": "The Spirit of MI MI is characterized by four interrelated elements: (1) Partnership -- MI is done \"with\" and \"for\" the client, not \"to\" or \"on\" the client; (2) Acceptance -- including absolute worth, autonomy support, accurate empathy, and affirmation; (3) Compassion -- actively promoting the client's welfare; and (4) Evocation -- drawing out the client's own motivations and resources rather than installing them",
      "id": "PTHE-0116"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "motivation.html",
      "chapter_title": "Through Motivation",
      "section": "Brief Therapy: Common Principles",
      "passage_type": "definition",
      "passage": "Who Is Suitable for Brief Therapy? Brief therapy tends to be most appropriate for clients who present with: (1) a circumscribed, clearly defined problem; (2) at least one prior experience of a meaningful relationship (suggesting capacity for alliance); (3) adequate ego strength; (4) motivation for change; and (5) the ability to engage quickly with the therapist. Clients with chronic personality disorders, severe trauma histories, or active psychosis may require longer-term treatment, though brief interventions can be useful as part of a stepped-care model",
      "id": "PTHE-0117"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "motivation.html",
      "chapter_title": "Through Motivation",
      "section": "The Transtheoretical Model (Stages of Change)",
      "passage_type": "clinical_note",
      "passage": "EPPP Clinical Application A key principle of MI is to avoid the righting reflex -- the therapist's natural tendency to try to fix the client's problem or persuade them to change. When clinicians argue for change, clients are pushed toward arguing against it (sustain talk). MI posits that the client, not the therapist, should be the one voicing the arguments for change. Rolling with resistance, rather than confronting it, is a core MI strategy",
      "id": "PTHE-0118"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "motivation.html",
      "chapter_title": "Through Motivation",
      "section": "Phases of IPT",
      "passage_type": "clinical_note",
      "passage": "Evidence Base for IPT IPT is one of the most well-researched psychotherapies. It has demonstrated efficacy for major depression (comparable to CBT and medication), bulimia nervosa, and is recommended in treatment guidelines by the American Psychiatric Association. The NIMH Treatment of Depression Collaborative Research Program found IPT and CBT were both effective for mild to moderate depression, with IPT showing particular advantages for patients with severe interpersonal difficulties",
      "id": "PTHE-0119"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "motivation.html",
      "chapter_title": "Through Motivation",
      "section": "IPT and the Medical Model",
      "passage_type": "clinical_note",
      "passage": "Decisional Balance in MI The decisional balance exercise is a technique in which the client explores four quadrants: (1) benefits of the status quo, (2) costs of the status quo, (3) benefits of change, and (4) costs of change. This structured exploration of ambivalence helps the client articulate their own reasons for change without the therapist arguing for it. The decisional balance is particularly useful in the contemplation stage, where the person is actively weighing pros and cons",
      "id": "PTHE-0120"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "motivation.html",
      "chapter_title": "Through Motivation",
      "section": "Scaling Questions",
      "passage_type": "example",
      "passage": "Clinical Example Therapist: \"You said you're at a 4 today. What are you doing that has you at a 4 rather than a 1?\" Client: \"Well, I have been going on walks and calling my sister more.\" Therapist: \"That's impressive. What would be different at a 5?\" This questioning identifies existing strengths and generates incremental, achievable goals",
      "id": "PTHE-0121"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "motivation.html",
      "chapter_title": "Through Motivation",
      "section": "Solution-Focused Brief Therapy (SFBT)",
      "passage_type": "paragraph",
      "passage": "Developed by Steve de Shazer and Insoo Kim Berg at the Brief Family Therapy Center in Milwaukee, Solution-Focused Brief Therapy represents a radical departure from traditional problem-focused approaches. Rather than exploring the origins or maintenance of problems, SFBT directs attention toward constructing solutions by identifying what clients already do well and amplifying those successes",
      "id": "PTHE-0122"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "motivation.html",
      "chapter_title": "Through Motivation",
      "section": "The Miracle Question",
      "passage_type": "paragraph",
      "passage": "The miracle question is the hallmark technique of SFBT. The therapist asks: \"Suppose tonight, while you are sleeping, a miracle happens and the problem that brought you here is solved. When you wake up tomorrow morning, what will be different that will tell you a miracle has happened?\" This question serves multiple functions:",
      "id": "PTHE-0123"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "motivation.html",
      "chapter_title": "Through Motivation",
      "section": "Scaling Questions",
      "passage_type": "paragraph",
      "passage": "Scaling questions ask clients to rate their current experience on a scale of 1 to 10. For example: \"On a scale of 1 to 10, where 10 means you are handling your anxiety as well as you ever could, where would you say you are today?\" Follow-up questions explore what has helped the client reach their current number and what a one-point improvement would look like",
      "id": "PTHE-0124"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "motivation.html",
      "chapter_title": "Through Motivation",
      "section": "Exception Questions and Coping Questions",
      "passage_type": "paragraph",
      "passage": "Exception questions explore times when the problem could have occurred but did not: \"Tell me about a time recently when you expected the panic to happen but it didn't.\" These questions highlight client competencies and suggest that solutions are already partially in place",
      "id": "PTHE-0125"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "motivation.html",
      "chapter_title": "Through Motivation",
      "section": "Exception Questions and Coping Questions",
      "passage_type": "paragraph",
      "passage": "Coping questions are used when clients feel overwhelmed and cannot identify exceptions: \"Given how difficult things have been, how have you managed to keep going?\" This validates the client's struggle while simultaneously identifying resilience",
      "id": "PTHE-0126"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "motivation.html",
      "chapter_title": "Through Motivation",
      "section": "SFBT Session Structure",
      "passage_type": "paragraph",
      "passage": "A typical SFBT session includes: (1) establishing what the client wants from the session, (2) exploring exceptions and competencies, (3) using the miracle question or scaling, (4) a consultation break where the therapist reflects, and (5) delivering feedback that includes compliments and a therapeutic task. Sessions are typically limited to 5-8 meetings",
      "id": "PTHE-0127"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "motivation.html",
      "chapter_title": "Through Motivation",
      "section": "Motivational Interviewing (MI)",
      "passage_type": "paragraph",
      "passage": "Motivational Interviewing was developed by William R. Miller and Stephen Rollnick as a directive, client-centered counseling style for eliciting behavior change by helping clients explore and resolve ambivalence . MI was originally developed for substance use treatment but has since been applied to a wide range of health behaviors",
      "id": "PTHE-0128"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "motivation.html",
      "chapter_title": "Through Motivation",
      "section": "Change Talk and Sustain Talk",
      "passage_type": "paragraph",
      "passage": "Change talk is any client speech that favors movement toward a target behavior change. It is organized by the mnemonic DARN-CAT :",
      "id": "PTHE-0129"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "motivation.html",
      "chapter_title": "Through Motivation",
      "section": "Change Talk and Sustain Talk",
      "passage_type": "paragraph",
      "passage": "Sustain talk is client speech favoring the status quo. The MI therapist does not argue against sustain talk but responds with reflections and explores the ambivalence",
      "id": "PTHE-0130"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "motivation.html",
      "chapter_title": "Through Motivation",
      "section": "The Transtheoretical Model (Stages of Change)",
      "passage_type": "paragraph",
      "passage": "MI is closely associated with Prochaska and DiClemente's Transtheoretical Model, which proposes that behavior change unfolds through stages:",
      "id": "PTHE-0131"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "motivation.html",
      "chapter_title": "Through Motivation",
      "section": "Interpersonal Therapy (IPT)",
      "passage_type": "paragraph",
      "passage": "Interpersonal Therapy was developed by Gerald Klerman and Myrna Weissman in the 1970s, originally as a time-limited treatment for major depression. IPT focuses on resolving interpersonal problems and improving interpersonal functioning, based on the premise that psychiatric symptoms arise in an interpersonal context and that improving relationships will alleviate symptoms",
      "id": "PTHE-0132"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "motivation.html",
      "chapter_title": "Through Motivation",
      "section": "SFBT: Compliments and First-Session Tasks",
      "passage_type": "paragraph",
      "passage": "At the end of each SFBT session, the therapist delivers carefully constructed compliments that validate the client's existing strengths and coping strategies. Following compliments, the therapist may assign a first-session task -- most famously the formula first-session task : \"Between now and next time we meet, I'd like you to observe what happens in your life that you want to continue to have happen.\" This observation task shifts attention from problems to strengths",
      "id": "PTHE-0133"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "motivation.html",
      "chapter_title": "Through Motivation",
      "section": "IPT and the Medical Model",
      "passage_type": "paragraph",
      "passage": "IPT is unique among psychotherapies in its deliberate use of a medical model . Depression is conceptualized as a medical illness, and the therapist explicitly assigns the patient to a sick role during the initial phase. This serves to: (1) reduce guilt and self-blame; (2) legitimize the need for help; and (3) provide temporary relief from overwhelming role expectations. However, the sick role is time-limited -- a key therapeutic goal is helping the patient gradually resume normal role functioning",
      "id": "PTHE-0134"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "motivation.html",
      "chapter_title": "Through Motivation",
      "section": "Brief Therapy: Common Principles",
      "passage_type": "paragraph",
      "passage": "Despite their different theoretical backgrounds, brief therapies share several principles that distinguish them from longer-term approaches:",
      "id": "PTHE-0135"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "relationship.html",
      "chapter_title": "Through the Relationship",
      "section": "Deficiency Needs vs. Growth Needs",
      "passage_type": "definition",
      "passage": "Prepotency Principle Maslow proposed that lower-level needs are prepotent -- they must be at least partially satisfied before higher-level needs become salient motivators. A person struggling with hunger and physical safety will not be primarily motivated by esteem or self-actualization. However, Maslow acknowledged that the hierarchy is not rigidly fixed: some individuals pursue higher needs despite unmet lower needs (e.g., artists who sacrifice material comfort for creative expression)",
      "id": "PTHE-0136"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "relationship.html",
      "chapter_title": "Through the Relationship",
      "section": "The Therapeutic Alliance as a Common Factor",
      "passage_type": "definition",
      "passage": "Alliance Research Findings Meta-analyses consistently show a moderate but robust correlation (r = .28) between alliance quality and therapy outcome . The alliance accounts for approximately 5-8% of outcome variance. While this may seem small, it is comparable to or larger than the effect of specific treatment techniques. The alliance is predictive of outcomes across diverse theoretical orientations, populations, and settings",
      "id": "PTHE-0137"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "relationship.html",
      "chapter_title": "Through the Relationship",
      "section": "Core Conditions for Therapeutic Change",
      "passage_type": "clinical_note",
      "passage": "Rogers' Non-Directive Stance Rogers believed that the therapeutic relationship itself, characterized by the core conditions, is sufficient for change. The therapist does not direct, interpret, or advise. The primary technique is reflection of feelings -- mirroring back the client's emotional experience to deepen self-understanding. Rogers rejected the term \"patient\" in favor of \"client\" and emphasized the egalitarian nature of the therapeutic relationship",
      "id": "PTHE-0138"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "relationship.html",
      "chapter_title": "Through the Relationship",
      "section": "Self-Actualization",
      "passage_type": "example",
      "passage": "Maslow's Later Addition: Self-Transcendence In his later writings, Maslow added a level beyond self-actualization: self-transcendence -- the need to connect to something beyond the self, such as altruistic service, spirituality, or identification with a cause greater than one's own existence. This addition is less commonly tested on the EPPP but reflects the evolution of Maslow's thinking and his interest in what he called transpersonal psychology",
      "id": "PTHE-0139"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "relationship.html",
      "chapter_title": "Through the Relationship",
      "section": "Person-Centered Therapy (Rogers)",
      "passage_type": "paragraph",
      "passage": "Carl Rogers developed person-centered (originally client-centered) therapy, a humanistic approach based on the belief that individuals have an innate tendency toward growth and self-actualization. Rogers proposed that psychopathology results from conditions of worth -- learning that one is valued only when meeting others' expectations, leading to incongruence between the self-concept and organismic experience",
      "id": "PTHE-0140"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "relationship.html",
      "chapter_title": "Through the Relationship",
      "section": "Maslow's Humanistic Psychology",
      "passage_type": "paragraph",
      "passage": "Abraham Maslow is often considered alongside Rogers as a founder of the humanistic \"third force\" in psychology. While Rogers focused on therapeutic conditions for growth, Maslow developed a comprehensive theory of human motivation organized around a hierarchy of needs . Maslow argued that human behavior is driven by the progressive satisfaction of needs, from basic survival to the highest levels of psychological fulfillment",
      "id": "PTHE-0141"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "relationship.html",
      "chapter_title": "Through the Relationship",
      "section": "Self-Actualization",
      "passage_type": "paragraph",
      "passage": "Maslow studied individuals he considered self-actualized -- including Abraham Lincoln, Albert Einstein, Eleanor Roosevelt, and others -- through biographical analysis . He identified several characteristics of self-actualized people:",
      "id": "PTHE-0142"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "relationship.html",
      "chapter_title": "Through the Relationship",
      "section": "Self-Actualization",
      "passage_type": "paragraph",
      "passage": "Maslow estimated that only approximately 1% of the population fully achieves self-actualization, viewing it as a rare but universally available potential",
      "id": "PTHE-0143"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "relationship.html",
      "chapter_title": "Through the Relationship",
      "section": "Gestalt Therapy (Perls)",
      "passage_type": "paragraph",
      "passage": "Fritz Perls , along with Laura Perls and Paul Goodman, developed Gestalt therapy, an experiential approach emphasizing present-moment awareness, personal responsibility, and the integration of fragmented aspects of the self",
      "id": "PTHE-0144"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "relationship.html",
      "chapter_title": "Through the Relationship",
      "section": "The Therapeutic Alliance as a Common Factor",
      "passage_type": "paragraph",
      "passage": "The therapeutic alliance (or working alliance) is the most extensively researched common factor and one of the most robust predictors of therapy outcome across all orientations. Edward Bordin defined the alliance as consisting of three components:",
      "id": "PTHE-0145"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "systems.html",
      "chapter_title": "Through the System",
      "section": "Systems Theory Foundation",
      "passage_type": "definition",
      "passage": "First-Order vs. Second-Order Change First-order change involves surface-level modifications within the existing system structure (e.g., a family changes which parent enforces rules, but the dysfunctional pattern continues). Second-order change involves a fundamental transformation of the system's structure or rules themselves (e.g., the family reorganizes its hierarchy entirely). Most family therapies aim for second-order change",
      "id": "PTHE-0146"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "systems.html",
      "chapter_title": "Through the System",
      "section": "Core Philosophy",
      "passage_type": "definition",
      "passage": "\"The Person Is Not the Problem; the Problem Is the Problem\" This foundational axiom of narrative therapy rejects the idea that pathology resides within the individual. Instead, problems are understood as separate entities that influence people's lives. This philosophical stance shifts the therapeutic conversation from diagnosis and internal deficits to the relationship between the person and the problem, opening space for agency and resistance",
      "id": "PTHE-0147"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "systems.html",
      "chapter_title": "Through the System",
      "section": "Types of Group Therapy",
      "passage_type": "definition",
      "passage": "Open vs. Closed Groups Open groups allow new members to join at any time (e.g., drop-in support groups). They provide ongoing accessibility but may disrupt cohesion with each new member. Closed groups have a fixed membership from the start and do not admit new members once the group begins. They tend to develop stronger cohesion and allow for deeper interpersonal work, but a member dropping out can significantly impact group dynamics. Slow-open groups replace departing members gradually, maintaining a balance between stability and accessibility",
      "id": "PTHE-0148"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "systems.html",
      "chapter_title": "Through the System",
      "section": "Key Concepts and Techniques",
      "passage_type": "clinical_note",
      "passage": "The MRI Group The Mental Research Institute (MRI) in Palo Alto (Watzlawick, Weakland, Fisch) is closely associated with strategic/brief therapy. Their key concept: problems are maintained by the very attempted solutions people use. Therapy focuses on interrupting the cycle of failed solutions. The MRI group also contributed foundational communication theory, including the axiom that \"one cannot not communicate.\"",
      "id": "PTHE-0149"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "systems.html",
      "chapter_title": "Through the System",
      "section": "Stages of Group Development",
      "passage_type": "clinical_note",
      "passage": "Group Leadership Styles Research suggests that the most effective group leaders balance emotional stimulation (challenging, confronting) with caring (warmth, support). Leaders who are too confrontational without sufficient caring produce casualties. Leaders must also manage group dynamics such as scapegoating (targeting one member), monopolizing (one member dominating), and subgrouping (cliques forming within the group)",
      "id": "PTHE-0150"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "systems.html",
      "chapter_title": "Through the System",
      "section": "Structural Techniques",
      "passage_type": "example",
      "passage": "Clinical Example A mother and her 14-year-old daughter are enmeshed -- they share everything, the daughter sleeps in the mother's bed, and the father is disengaged from the family. The structural therapist would work to strengthen the parental subsystem boundary (bringing the parents together as a team), create appropriate distance in the mother-daughter subsystem, and draw the father back into the family. The daughter's presenting problem (e.g., school refusal) is understood as reflecting the dysfunctional structure",
      "id": "PTHE-0151"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "systems.html",
      "chapter_title": "Through the System",
      "section": "Key Concepts and Techniques",
      "passage_type": "example",
      "passage": "Externalizing Conversation Rather than asking \"Why are you so anxious?\" a narrative therapist might ask: \"When does Anxiety visit you? What tricks does Anxiety use to convince you that you can't cope? Have there been times when you stood up to Anxiety and didn't let it push you around?\" This language externalizes the problem (Anxiety) as a separate agent, preserves the client's sense of self as competent, and opens space for identifying moments of agency",
      "id": "PTHE-0152"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "systems.html",
      "chapter_title": "Through the System",
      "section": "Systems Theory Foundation",
      "passage_type": "paragraph",
      "passage": "Family therapy approaches share a foundation in general systems theory , which views the family as an interconnected system rather than a collection of individuals. Key systems concepts include:",
      "id": "PTHE-0153"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "systems.html",
      "chapter_title": "Through the System",
      "section": "Structural Family Therapy (Minuchin)",
      "passage_type": "paragraph",
      "passage": "Salvador Minuchin developed structural family therapy, which focuses on the organization of the family system -- its structure . The therapist actively intervenes to reorganize dysfunctional family structures, particularly boundaries and hierarchies",
      "id": "PTHE-0154"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "systems.html",
      "chapter_title": "Through the System",
      "section": "Strategic Family Therapy (Haley)",
      "passage_type": "paragraph",
      "passage": "Jay Haley and Cloe Madanes developed strategic family therapy, which focuses on solving the presenting problem through specific directives and interventions. Strategic therapists are less concerned with insight and more focused on changing the behavioral sequences that maintain symptoms",
      "id": "PTHE-0155"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "systems.html",
      "chapter_title": "Through the System",
      "section": "Bowenian Family Therapy",
      "passage_type": "paragraph",
      "passage": "Murray Bowen developed one of the most comprehensive family systems theories, emphasizing multigenerational transmission of emotional patterns and the centrality of differentiation of self",
      "id": "PTHE-0156"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "systems.html",
      "chapter_title": "Through the System",
      "section": "Narrative Therapy (White & Epston)",
      "passage_type": "paragraph",
      "passage": "Michael White and David Epston developed narrative therapy, a postmodern approach grounded in social constructionist epistemology . Narrative therapy holds that people make meaning of their lives through stories, and that problems arise when individuals become dominated by oppressive, deficit-saturated narratives about themselves. The central therapeutic task is to help clients separate themselves from problem-saturated stories and construct new, preferred narratives",
      "id": "PTHE-0157"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "systems.html",
      "chapter_title": "Through the System",
      "section": "Application in Family Therapy",
      "passage_type": "paragraph",
      "passage": "In family contexts, narrative therapy externalizes problems that the family has internalized as belonging to one member (often the identified patient). By positioning the problem as external to all family members, the entire family can collaborate against it rather than blaming a single individual. Family members are invited to share their own unique outcomes and to serve as witnesses to each other's preferred stories, strengthening new narratives through collective acknowledgment",
      "id": "PTHE-0158"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "systems.html",
      "chapter_title": "Through the System",
      "section": "Milan Systemic Family Therapy",
      "passage_type": "paragraph",
      "passage": "The Milan group (Selvini Palazzoli, Boscolo, Cecchin, and Prata) developed a systemic approach that uses specific interviewing and intervention techniques:",
      "id": "PTHE-0159"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "systems.html",
      "chapter_title": "Through the System",
      "section": "Virginia Satir",
      "passage_type": "paragraph",
      "passage": "Satir emphasized emotional experience and communication patterns. She identified four dysfunctional communication stances people adopt under stress:",
      "id": "PTHE-0160"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "systems.html",
      "chapter_title": "Through the System",
      "section": "Virginia Satir",
      "passage_type": "paragraph",
      "passage": "The healthy alternative is the congruent communicator , who expresses feelings directly and honestly while respecting others. Satir used techniques such as family sculpting (having members physically position themselves to represent family dynamics) and family reconstruction",
      "id": "PTHE-0161"
    },
    {
      "domain_code": "PTHE",
      "domain_name": "Psychotherapy Models, Interventions & Prevention",
      "chapter_file": "systems.html",
      "chapter_title": "Through the System",
      "section": "Carl Whitaker",
      "passage_type": "paragraph",
      "passage": "Whitaker practiced experiential/symbolic family therapy , an intuitive, provocative approach that used humor, absurdity, and the therapist's own emotional reactions. Whitaker believed that growth occurs through emotional experience in the session rather than through insight or education. He often used co-therapy and insisted on treating the entire family",
      "id": "PTHE-0162"
    }
  ]
}