{
  "domain_code": "WDEV",
  "domain_name": "Workforce Development & Leadership",
  "total_passages": 290,
  "passages": [
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "career-development.html",
      "chapter_title": "Career Development",
      "section": "Dawis & Lofquist's Theory of Work Adjustment (TWA)",
      "passage_type": "definition",
      "passage": "Six Work Values in TWA TWA identifies six fundamental work values that individuals seek to fulfill through their work: Achievement: Using abilities and seeing results Comfort: Pleasant working conditions, low stress Status: Recognition, prestige, and advancement Altruism: Helping others, contributing to social welfare Safety: Predictable, stable work environment Autonomy: Independence, personal control, creativity",
      "id": "WDEV-0001"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "career-development.html",
      "chapter_title": "Career Development",
      "section": "Gottfredson's Theory of Circumscription and Compromise",
      "passage_type": "definition",
      "passage": "Stages of Circumscription Orientation to size and power (ages 3-5): Children recognize that adults have occupations; begin sorting occupations by adult vs. child Orientation to sex roles (ages 6-8): Children eliminate occupations perceived as inappropriate for their gender -- this is the most resistant to change Orientation to social valuation (ages 9-13): Children become aware of social class and prestige; eliminate occupations below their acceptable level Orientation to internal, unique self (ages 14+): Adolescents consider personal interests, abilities, and values in making career choices",
      "id": "WDEV-0002"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "career-development.html",
      "chapter_title": "Career Development",
      "section": "Social Cognitive Career Theory (SCCT)",
      "passage_type": "definition",
      "passage": "Three SCCT Variables Self-efficacy beliefs: Confidence in one's ability to successfully perform specific tasks. Self-efficacy influences which career options people consider, how much effort they invest, and how they persist in the face of obstacles. Outcome expectations: Beliefs about the consequences of particular actions (e.g., \"If I study engineering, I will have a well-paying career\") Personal goals: The intention to engage in a particular activity or produce a particular outcome. Goals organize and sustain career-related behavior",
      "id": "WDEV-0003"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "career-development.html",
      "chapter_title": "Career Development",
      "section": "Dawis & Lofquist's Theory of Work Adjustment (TWA)",
      "passage_type": "clinical_note",
      "passage": "EPPP Key Concept TWA differs from Holland in its emphasis on the reciprocal nature of fit. While Holland focuses primarily on the person's fit with the environment (congruence), TWA explicitly considers both directions: the person's satisfaction with the job and the employer's satisfactoriness with the person. The key outcome variable in TWA is tenure -- predicted jointly by satisfaction and satisfactoriness",
      "id": "WDEV-0004"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "career-development.html",
      "chapter_title": "Career Development",
      "section": "Career Development Stages",
      "passage_type": "clinical_note",
      "passage": "EPPP Key Concept: Career Maturity Career maturity (for adolescents) and career adaptability (for adults) refer to readiness to make appropriate career decisions. Super's Career Development Inventory (CDI) measures career maturity. Higher career maturity is associated with more realistic career choices and greater satisfaction with decisions made",
      "id": "WDEV-0005"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "career-development.html",
      "chapter_title": "Career Development",
      "section": "Krumboltz's Learning Theory of Career Counseling",
      "passage_type": "clinical_note",
      "passage": "EPPP Key Concept Krumboltz's planned happenstance challenges traditional career counseling models that assume clients should arrive at a single \"right\" career decision. Instead, it promotes open-mindedness and the ability to transform unexpected events into career opportunities. This perspective is increasingly relevant in a rapidly changing labor market",
      "id": "WDEV-0006"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "career-development.html",
      "chapter_title": "Career Development",
      "section": "Key Concepts in Holland's Theory",
      "passage_type": "example",
      "passage": "The Hexagonal Model Holland arranged the six types in a hexagon: R-I-A-S-E-C. Types that are adjacent (e.g., R and I) are most similar; types that are opposite (e.g., R and S) are most dissimilar. This arrangement predicts that a person with a Realistic-Investigative profile will be more satisfied in an engineering job than in a social work position (Social environment)",
      "id": "WDEV-0007"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "career-development.html",
      "chapter_title": "Career Development",
      "section": "Social Cognitive Career Theory (SCCT)",
      "passage_type": "example",
      "passage": "Example: SCCT in Practice A woman from a low-income background has strong math ability (ability) but low confidence in STEM (self-efficacy) due to limited exposure and gender stereotypes (contextual barriers). SCCT predicts she will not develop strong STEM interests despite her ability. Career counseling interventions might focus on building self-efficacy through vicarious learning (role models), performance accomplishments (mastery experiences), and addressing barrier perceptions",
      "id": "WDEV-0008"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "career-development.html",
      "chapter_title": "Career Development",
      "section": "Introduction to Career Development Theories",
      "passage_type": "paragraph",
      "passage": "Career development theories explain how individuals make vocational choices, develop career paths, and adapt to work across the lifespan. The EPPP heavily tests these theories, particularly Holland's RIASEC model, Super's life-span theory, and more recent constructivist approaches",
      "id": "WDEV-0009"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "career-development.html",
      "chapter_title": "Career Development",
      "section": "Holland's RIASEC Theory",
      "passage_type": "paragraph",
      "passage": "John Holland (1959, 1997) proposed that both people and work environments can be classified into six types. Career satisfaction and stability are maximized when there is a good fit (congruence) between an individual's personality type and their work environment",
      "id": "WDEV-0010"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "career-development.html",
      "chapter_title": "Career Development",
      "section": "Key Concepts in Holland's Theory",
      "passage_type": "paragraph",
      "passage": "Holland's theory is assessed using the Self-Directed Search (SDS) , which Holland developed, and is also the framework underlying the Strong Interest Inventory (SII)",
      "id": "WDEV-0011"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "career-development.html",
      "chapter_title": "Career Development",
      "section": "Dawis & Lofquist's Theory of Work Adjustment (TWA)",
      "passage_type": "paragraph",
      "passage": "Rene Dawis and Lloyd Lofquist (1964, 1984) developed the Theory of Work Adjustment (TWA) , a person-environment fit theory that focuses on the correspondence between the individual and the work environment. Like Holland's theory, TWA is a P-E fit model, but it emphasizes the reciprocal nature of the person-environment relationship",
      "id": "WDEV-0012"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "career-development.html",
      "chapter_title": "Career Development",
      "section": "Dawis & Lofquist's Theory of Work Adjustment (TWA)",
      "passage_type": "paragraph",
      "passage": "TWA introduces two important adjustment styles that individuals use when there is discorrespondence (mismatch) between person and environment:",
      "id": "WDEV-0013"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "career-development.html",
      "chapter_title": "Career Development",
      "section": "Dawis & Lofquist's Theory of Work Adjustment (TWA)",
      "passage_type": "paragraph",
      "passage": "The primary assessment instruments associated with TWA are the Minnesota Importance Questionnaire (MIQ) , which measures work values/needs, and the Minnesota Satisfaction Questionnaire (MSQ) , which measures satisfaction with specific job facets",
      "id": "WDEV-0014"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "career-development.html",
      "chapter_title": "Career Development",
      "section": "Super's Life-Span, Life-Space Theory",
      "passage_type": "paragraph",
      "passage": "Donald Super (1953, 1980, 1990) developed a comprehensive developmental theory proposing that career development is a lifelong process of implementing one's self-concept through vocational choices",
      "id": "WDEV-0015"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "career-development.html",
      "chapter_title": "Career Development",
      "section": "Career Development Stages",
      "passage_type": "paragraph",
      "passage": "Super later introduced the concept of recycling -- individuals may move through these stages multiple times as they change careers. He also emphasized the life-space dimension, recognizing that people occupy multiple roles simultaneously (child, student, worker, citizen, homemaker, leisurite) across different life theaters",
      "id": "WDEV-0016"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "career-development.html",
      "chapter_title": "Career Development",
      "section": "Gottfredson's Theory of Circumscription and Compromise",
      "passage_type": "paragraph",
      "passage": "Linda Gottfredson (1981, 2002) proposed a developmental theory emphasizing how self-concept and social identity constrain career choices from early childhood through a process of circumscription (eliminating unacceptable alternatives) and compromise (adjusting aspirations to fit reality)",
      "id": "WDEV-0017"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "career-development.html",
      "chapter_title": "Career Development",
      "section": "Gottfredson's Theory of Circumscription and Compromise",
      "passage_type": "paragraph",
      "passage": "When individuals must compromise (accept less than their ideal), Gottfredson proposed they sacrifice interests first, then prestige, and last sex-type. Gender-type boundaries are the most resistant to change because they are established earliest and are most closely tied to self-concept",
      "id": "WDEV-0018"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "career-development.html",
      "chapter_title": "Career Development",
      "section": "Social Cognitive Career Theory (SCCT)",
      "passage_type": "paragraph",
      "passage": "Social Cognitive Career Theory , developed by Robert Lent, Steven Brown, and Gail Hackett (1994, 2002), applies Bandura's social cognitive theory to career development. It focuses on three central cognitive-person variables:",
      "id": "WDEV-0019"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "career-development.html",
      "chapter_title": "Career Development",
      "section": "Krumboltz's Learning Theory of Career Counseling",
      "passage_type": "paragraph",
      "passage": "John Krumboltz (1979, 1996) applied social learning theory to career development, emphasizing that career decisions result from learning experiences. Four factors influence career choice:",
      "id": "WDEV-0020"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "career-development.html",
      "chapter_title": "Career Development",
      "section": "Krumboltz's Learning Theory of Career Counseling",
      "passage_type": "paragraph",
      "passage": "Krumboltz later developed the concept of planned happenstance , arguing that unplanned events (chance encounters, unexpected opportunities) play a major role in career development. Rather than viewing indecision negatively, career counselors should help clients develop skills to recognize, create, and capitalize on chance events: curiosity, persistence, flexibility, optimism, and risk-taking",
      "id": "WDEV-0021"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "decision-making.html",
      "chapter_title": "Decision Making",
      "section": "Bounded Rationality",
      "passage_type": "clinical_note",
      "passage": "EPPP Key Concept Simon distinguished between programmed decisions (routine, repetitive problems handled by established procedures, rules, or algorithms) and nonprogrammed decisions (novel, complex, unstructured problems requiring creativity and judgment). Organizations should develop standard procedures for programmed decisions and reserve executive judgment for nonprogrammed decisions",
      "id": "WDEV-0022"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "decision-making.html",
      "chapter_title": "Decision Making",
      "section": "Vroom-Yetton-Jago Decision Model",
      "passage_type": "clinical_note",
      "passage": "EPPP Key Concept The Vroom-Yetton-Jago model is a normative (prescriptive) model -- it tells leaders what they should do, not what they typically do. The model demonstrates that no single leadership decision style is universally best: sometimes autocratic decisions are optimal (when the leader has expertise and acceptance is not critical), and sometimes participative decisions are needed (when acceptance is essential and the leader lacks information)",
      "id": "WDEV-0023"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "decision-making.html",
      "chapter_title": "Decision Making",
      "section": "Group Decision-Making Techniques",
      "passage_type": "clinical_note",
      "passage": "EPPP Key Concept Research consistently shows that nominal groups (individuals working alone whose ideas are pooled) outperform interacting groups (face-to-face brainstorming) in both quantity and quality of ideas. This is due to production blocking (waiting to speak), evaluation apprehension (fear of criticism), and social loafing (reduced effort in groups). The Nominal Group Technique and Delphi Technique were designed to address these problems",
      "id": "WDEV-0024"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "decision-making.html",
      "chapter_title": "Decision Making",
      "section": "Group Polarization and Risky Shift",
      "passage_type": "clinical_note",
      "passage": "EPPP Key Concept Group polarization is distinct from groupthink. Groupthink involves suppression of dissent and defective decision processes in highly cohesive groups. Group polarization is a general tendency for group discussion to amplify pre-existing preferences, regardless of cohesion. Both can lead to poor decisions, but through different mechanisms. Know that the risky shift was the original finding  and that group polarization is the broader, more accurate concept -- groups shift toward extremity, not necessarily toward risk",
      "id": "WDEV-0025"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "decision-making.html",
      "chapter_title": "Decision Making",
      "section": "Bounded Rationality",
      "passage_type": "example",
      "passage": "Example: Satisficing vs. Optimizing A hiring manager using the rational/optimizing approach would interview every qualified candidate, systematically compare all on every dimension, and select the objectively best one. A satisficing manager would interview candidates sequentially and hire the first one who meets predetermined minimum qualifications. Given real-world time and resource constraints, satisficing is often the more practical strategy",
      "id": "WDEV-0026"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "decision-making.html",
      "chapter_title": "Decision Making",
      "section": "Symptoms of Groupthink",
      "passage_type": "example",
      "passage": "Classic Examples of Groupthink Janis analyzed several historical decision-making fiascoes as examples of groupthink: the Bay of Pigs invasion (1961), the failure to anticipate the attack on Pearl Harbor (1941), and the escalation of the Vietnam War. In each case, highly cohesive advisory groups failed to critically evaluate alternatives or consider risks, leading to disastrous outcomes",
      "id": "WDEV-0027"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "decision-making.html",
      "chapter_title": "Decision Making",
      "section": "Escalation of Commitment",
      "passage_type": "example",
      "passage": "Example: Escalation in Organizations A company has invested $50 million in developing a new product. Market research now shows minimal consumer interest, but executives authorize another $20 million to \"see it through.\" Their reasoning focuses on the $50 million already spent (sunk cost) rather than the realistic prospects of future returns. Rational decision making would focus only on whether the additional $20 million investment is justified by expected future returns",
      "id": "WDEV-0028"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "decision-making.html",
      "chapter_title": "Decision Making",
      "section": "Introduction to Organizational Decision Making",
      "passage_type": "paragraph",
      "passage": "Decision making in organizations involves both individual and group processes for identifying problems, generating alternatives, evaluating options, and selecting courses of action. The EPPP tests knowledge of bounded rationality, group decision-making phenomena (especially groupthink), participative decision models, and cognitive biases that affect organizational decisions",
      "id": "WDEV-0029"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "decision-making.html",
      "chapter_title": "Decision Making",
      "section": "Bounded Rationality",
      "passage_type": "paragraph",
      "passage": "Herbert Simon (1957, Nobel Prize 1978) challenged the classical economic assumption that decision makers are fully rational. He proposed that human rationality is bounded -- limited by cognitive capacity, available information, and time constraints",
      "id": "WDEV-0030"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "decision-making.html",
      "chapter_title": "Decision Making",
      "section": "Groupthink",
      "passage_type": "paragraph",
      "passage": "Irving Janis (1972, 1982) developed the concept of groupthink -- a mode of thinking that occurs in highly cohesive groups when the desire for unanimity and conformity overrides realistic appraisal of alternatives. Groupthink leads to defective decision making",
      "id": "WDEV-0031"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "decision-making.html",
      "chapter_title": "Decision Making",
      "section": "Vroom-Yetton-Jago Decision Model",
      "passage_type": "paragraph",
      "passage": "Victor Vroom and Philip Yetton (1973), later revised with Arthur Jago (Vroom & Jago, 1988), developed a normative model that prescribes how much participation leaders should allow subordinates in making decisions. The model identifies five decision-making styles:",
      "id": "WDEV-0032"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "decision-making.html",
      "chapter_title": "Decision Making",
      "section": "Escalation of Commitment",
      "passage_type": "paragraph",
      "passage": "Escalation of commitment  refers to the tendency to continue investing in a failing course of action despite mounting evidence that the decision is not working. Also called the \"sunk cost fallacy\" or \"throwing good money after bad.\"",
      "id": "WDEV-0033"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "decision-making.html",
      "chapter_title": "Decision Making",
      "section": "Escalation of Commitment",
      "passage_type": "paragraph",
      "passage": "Strategies to reduce escalation include: setting advance limits on investment, separating initial and continuation decisions (different decision makers), establishing clear criteria for abandoning a project, and creating a culture that does not punish failure",
      "id": "WDEV-0034"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "decision-making.html",
      "chapter_title": "Decision Making",
      "section": "Prospect Theory in Organizations",
      "passage_type": "paragraph",
      "passage": "Prospect theory , developed by Daniel Kahneman and Amos Tversky (1979, Nobel Prize 2002), describes how people make decisions under conditions of risk and uncertainty. It challenges classical expected utility theory with several key insights:",
      "id": "WDEV-0035"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "decision-making.html",
      "chapter_title": "Decision Making",
      "section": "Group Polarization and Risky Shift",
      "passage_type": "paragraph",
      "passage": "James Stoner (1961) made the surprising discovery that groups tend to make riskier decisions than the average of individual members' pre-discussion preferences. This phenomenon was initially called the risky shift",
      "id": "WDEV-0036"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "decision-making.html",
      "chapter_title": "Decision Making",
      "section": "Group Polarization and Risky Shift",
      "passage_type": "paragraph",
      "passage": "Subsequent research revealed that groups do not always shift toward greater risk. Sometimes groups shift toward greater caution ( cautious shift ). The broader phenomenon was reconceptualized as group polarization (Moscovici & Zavalloni, 1969): after group discussion, the group's position tends to become more extreme in the direction of the pre-discussion tendency . If members initially lean toward risk, the group becomes riskier; if members initially lean toward caution, the group becomes more cautious",
      "id": "WDEV-0037"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "job-analysis.html",
      "chapter_title": "Job Analysis",
      "section": "Job Descriptions and Job Specifications",
      "passage_type": "definition",
      "passage": "Job Description vs. Job Specification Job description: A written summary of the tasks, duties, responsibilities, and working conditions of a job. It describes what is done. Used for recruitment, orientation, and defining role expectations. Job specification: A written summary of the minimum qualifications (KSAOs) a person must possess to perform the job successfully. It describes who can do the job. Used for selection and placement decisions",
      "id": "WDEV-0038"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "job-analysis.html",
      "chapter_title": "Job Analysis",
      "section": "Rating Scale Methods",
      "passage_type": "definition",
      "passage": "Behaviorally Anchored Rating Scales (BARS) Developed by Smith and Kendall (1963), BARS use specific behavioral examples (critical incidents) as anchors for each point on the rating scale. Each performance dimension has its own scale with behavioral descriptions at different effectiveness levels. Advantages: Reduces ambiguity, provides clear behavioral standards, involves employees in development Disadvantages: Time-consuming and expensive to develop, specific to each job",
      "id": "WDEV-0039"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "job-analysis.html",
      "chapter_title": "Job Analysis",
      "section": "Rating Scale Methods",
      "passage_type": "definition",
      "passage": "Behavioral Observation Scales (BOS) Developed by Latham and Wexley (1977), BOS ask raters to indicate the frequency with which an employee exhibits specific behaviors, using a 5-point frequency scale (Almost Never to Almost Always). Unlike BARS, which rates typical performance level, BOS measures the frequency of desired behaviors",
      "id": "WDEV-0040"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "job-analysis.html",
      "chapter_title": "Job Analysis",
      "section": "Competency Modeling",
      "passage_type": "clinical_note",
      "passage": "EPPP Key Distinction Traditional job analysis is more detailed, legally defensible, and task-specific. Competency modeling is broader, more future-oriented, and aligned with organizational strategy. Both approaches have value, but for legal defensibility in selection contexts, traditional job analysis is preferred because of its specificity and established methodology",
      "id": "WDEV-0041"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "job-analysis.html",
      "chapter_title": "Job Analysis",
      "section": "Job Descriptions and Job Specifications",
      "passage_type": "example",
      "passage": "Example: Distinguishing Description from Specification Job description excerpt (Clinical Psychologist): \"Conducts psychological assessments, provides individual and group psychotherapy, develops treatment plans, and participates in multidisciplinary treatment team meetings.\" Job specification excerpt: \"Doctoral degree in clinical psychology from an APA-accredited program, state licensure as a psychologist, minimum 2 years post-licensure clinical experience, knowledge of evidence-based treatments.\"",
      "id": "WDEV-0042"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "job-analysis.html",
      "chapter_title": "Job Analysis",
      "section": "360-Degree Feedback",
      "passage_type": "example",
      "passage": "Example: 360-Degree Feedback Sources A manager receives feedback from: (1) their supervisor on strategic thinking, (2) peers on collaboration, (3) direct reports on coaching and communication, (4) customers on responsiveness, and (5) self-assessment on all dimensions. Discrepancies between self and others' ratings can highlight blind spots",
      "id": "WDEV-0043"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "job-analysis.html",
      "chapter_title": "Job Analysis",
      "section": "Introduction to Job Analysis",
      "passage_type": "paragraph",
      "passage": "Job analysis is the systematic process of collecting and analyzing information about the content, context, and requirements of a job. It serves as the foundation for virtually all human resource functions, including selection, training, performance appraisal, compensation, and legal compliance",
      "id": "WDEV-0044"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "job-analysis.html",
      "chapter_title": "Job Analysis",
      "section": "Introduction to Job Analysis",
      "passage_type": "paragraph",
      "passage": "For the EPPP, you must understand the distinction between different approaches to job analysis, the concept of KSAOs, and how job analysis information feeds into performance appraisal systems",
      "id": "WDEV-0045"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "job-analysis.html",
      "chapter_title": "Job Analysis",
      "section": "Task-Oriented Job Analysis",
      "passage_type": "paragraph",
      "passage": "Task-oriented analysis focuses on what the worker does -- the specific tasks, duties, and responsibilities that comprise the job. This approach produces detailed descriptions of work activities",
      "id": "WDEV-0046"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "job-analysis.html",
      "chapter_title": "Job Analysis",
      "section": "Worker-Oriented Job Analysis",
      "passage_type": "paragraph",
      "passage": "Worker-oriented analysis focuses on the human attributes and behaviors needed to perform the job, rather than the tasks themselves. This approach emphasizes what the worker brings to the job",
      "id": "WDEV-0047"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "job-analysis.html",
      "chapter_title": "Job Analysis",
      "section": "O*NET and Modern Job Analysis",
      "passage_type": "paragraph",
      "passage": "The Occupational Information Network (O*NET) is the U.S. Department of Labor's comprehensive online database that replaced the Dictionary of Occupational Titles (DOT). O*NET uses a content model organized around six domains:",
      "id": "WDEV-0048"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "job-analysis.html",
      "chapter_title": "Job Analysis",
      "section": "Competency Modeling",
      "passage_type": "paragraph",
      "passage": "Competency modeling is a newer, more strategic approach that identifies the broader competencies (integrated sets of knowledge, skills, abilities, and personal attributes) needed for effective performance across a role, job family, or entire organization. Unlike traditional job analysis, which focuses on specific tasks, competency modeling emphasizes organizational strategy and culture",
      "id": "WDEV-0049"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "job-analysis.html",
      "chapter_title": "Job Analysis",
      "section": "Performance Appraisal Methods",
      "passage_type": "paragraph",
      "passage": "Performance appraisal is the systematic evaluation of employee job performance. Job analysis directly informs the development of performance criteria. Methods vary in their focus on traits, behaviors, or results",
      "id": "WDEV-0050"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "job-analysis.html",
      "chapter_title": "Job Analysis",
      "section": "360-Degree Feedback",
      "passage_type": "paragraph",
      "passage": "360-degree feedback (multi-source assessment) collects performance evaluations from multiple perspectives: supervisors, peers, subordinates, and sometimes customers and the employee themselves. This comprehensive approach provides a more complete picture of performance",
      "id": "WDEV-0051"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "job-analysis.html",
      "chapter_title": "Job Analysis",
      "section": "Common Rating Errors",
      "passage_type": "paragraph",
      "passage": "Frame-of-reference (FOR) training has been shown to be one of the most effective methods for reducing rating errors. FOR training teaches raters to use common standards and behavioral examples when evaluating performance",
      "id": "WDEV-0052"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "leadership.html",
      "chapter_title": "Leadership",
      "section": "Trait Theories of Leadership",
      "passage_type": "definition",
      "passage": "Key Leadership Traits Identified in Research Intelligence: Effective leaders tend to be somewhat more intelligent than their followers, but not excessively so  Self-confidence: Belief in one's own abilities and judgments Determination: Drive, persistence, and initiative Integrity: Honesty and trustworthiness Sociability: Tendency to seek pleasant social relationships",
      "id": "WDEV-0053"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "leadership.html",
      "chapter_title": "Leadership",
      "section": "Ohio State Leadership Studies",
      "passage_type": "definition",
      "passage": "Ohio State Leadership Dimensions Initiating structure: The degree to which a leader defines roles, establishes goals, organizes tasks, and establishes communication channels. This is task-oriented behavior focused on getting the job done. Consideration: The degree to which a leader shows concern for followers' welfare, builds mutual trust, respects followers' ideas, and maintains warm interpersonal relationships. This is relationship-oriented behavior",
      "id": "WDEV-0054"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "leadership.html",
      "chapter_title": "Leadership",
      "section": "Hersey-Blanchard Situational Leadership Theory",
      "passage_type": "definition",
      "passage": "Four Leadership Styles Style Behavior Task Orientation Relationship Orientation S1: Telling/Directing Leader provides specific instructions and closely supervises High Low S2: Selling/Coaching Leader explains decisions and provides opportunity for clarification High High S3: Participating/Supporting Leader shares ideas and facilitates follower decision making Low High S4: Delegating Leader turns over responsibility for decisions and implementation Low Low",
      "id": "WDEV-0055"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "leadership.html",
      "chapter_title": "Leadership",
      "section": "Hersey-Blanchard Situational Leadership Theory",
      "passage_type": "definition",
      "passage": "Four Follower Readiness/Maturity Levels Level Ability Willingness/Confidence Matched Style R1 Unable Unwilling or insecure S1 (Telling) R2 Unable Willing or confident S2 (Selling) R3 Able Unwilling or insecure S3 (Participating) R4 Able Willing and confident S4 (Delegating)",
      "id": "WDEV-0056"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "leadership.html",
      "chapter_title": "Leadership",
      "section": "Leader-Member Exchange (LMX) Theory",
      "passage_type": "definition",
      "passage": "LMX Key Concepts In-group: Followers who have high-quality exchange relationships with the leader, characterized by trust, loyalty, and mutual obligation. They receive more attention, resources, and opportunities. Out-group: Followers who have low-quality exchange relationships, limited to the formal employment contract. Interactions are more transactional. Research shows that high-quality LMX relationships are associated with greater job satisfaction, organizational commitment, and performance for followers",
      "id": "WDEV-0057"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "leadership.html",
      "chapter_title": "Leadership",
      "section": "Transformational Leadership (Bass's Four I's)",
      "passage_type": "definition",
      "passage": "The Four I's of Transformational Leadership Idealized influence (charisma): The leader serves as a role model, demonstrating high ethical standards and earning trust and respect Inspirational motivation: The leader articulates a compelling vision, communicates optimism, and provides meaning and challenge Intellectual stimulation: The leader encourages creativity, challenges assumptions, and reframes problems Individualized consideration: The leader attends to each follower's unique needs, acts as a mentor, and promotes development",
      "id": "WDEV-0058"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "leadership.html",
      "chapter_title": "Leadership",
      "section": "Trait Theories of Leadership",
      "passage_type": "clinical_note",
      "passage": "EPPP Key Concept Modern meta-analyses  have found that Big Five personality traits do predict leadership: Extraversion is the strongest correlate of leadership emergence, followed by Conscientiousness and Openness to Experience. Neuroticism is negatively related, while Agreeableness shows the weakest relationship. Know that trait approaches are not \"dead\" but are now seen as one piece of the leadership puzzle",
      "id": "WDEV-0059"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "leadership.html",
      "chapter_title": "Leadership",
      "section": "Hersey-Blanchard Situational Leadership Theory",
      "passage_type": "clinical_note",
      "passage": "EPPP Key Concept Despite its widespread popularity in leadership training programs, the Hersey-Blanchard model has received limited empirical support . Critics note that the readiness construct is ambiguously defined (combining ability and willingness into a single dimension is problematic) and that the prescribed style-readiness matches have not been consistently validated by research. However, the theory's intuitive appeal makes it one of the most widely used leadership training models in organizations",
      "id": "WDEV-0060"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "leadership.html",
      "chapter_title": "Leadership",
      "section": "Transformational Leadership (Bass's Four I's)",
      "passage_type": "clinical_note",
      "passage": "EPPP Key Distinction Burns (1978) originally conceptualized transformational and transactional leadership as opposite ends of a continuum. Bass (1985) reconceptualized them as separate but complementary dimensions -- effective leaders use both, but transformational leadership \"augments\" the effects of transactional leadership (the augmentation effect ). The EPPP may test this distinction",
      "id": "WDEV-0061"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "leadership.html",
      "chapter_title": "Leadership",
      "section": "Fiedler's Contingency Model",
      "passage_type": "example",
      "passage": "Fiedler's Central Prediction Task-motivated (low-LPC) leaders are most effective in situations of very high or very low situational control. Relationship-motivated (high-LPC) leaders are most effective in situations of moderate situational control. Crucially, Fiedler argued that leadership style is relatively fixed -- rather than trying to change the leader, organizations should change the situation to match the leader (called \"job engineering\")",
      "id": "WDEV-0062"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "leadership.html",
      "chapter_title": "Leadership",
      "section": "Hersey-Blanchard Situational Leadership Theory",
      "passage_type": "example",
      "passage": "Key Insight The central proposition is that effective leaders adapt their style to match the follower's developmental level on a specific task. As followers develop from R1 to R4, the leader should shift from telling to selling to participating to delegating. Unlike Fiedler, Hersey and Blanchard assumed leaders can and should flexibly change their style",
      "id": "WDEV-0063"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "leadership.html",
      "chapter_title": "Leadership",
      "section": "Introduction to Leadership Theories",
      "passage_type": "paragraph",
      "passage": "Leadership is one of the most extensively studied topics in organizational psychology. The EPPP tests knowledge of the major theoretical approaches to understanding leadership effectiveness, from early trait-based perspectives to contemporary models emphasizing situational factors and transformational processes",
      "id": "WDEV-0064"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "leadership.html",
      "chapter_title": "Leadership",
      "section": "Introduction to Leadership Theories",
      "passage_type": "paragraph",
      "passage": "The evolution of leadership theory reflects a progression from asking \"Who are leaders?\" (trait theories) to \"What do leaders do?\" (behavioral theories) to \"When does a particular style work best?\" (contingency theories) to \"How do leaders transform organizations?\" (transformational theories)",
      "id": "WDEV-0065"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "leadership.html",
      "chapter_title": "Leadership",
      "section": "Trait Theories of Leadership",
      "passage_type": "paragraph",
      "passage": "Trait theories represent the earliest systematic approach to studying leadership, based on the assumption that effective leaders possess certain innate personal characteristics that distinguish them from non-leaders. This \"Great Man\" approach dominated leadership research through the 1940s",
      "id": "WDEV-0066"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "leadership.html",
      "chapter_title": "Leadership",
      "section": "Trait Theories of Leadership",
      "passage_type": "paragraph",
      "passage": "Ralph Stogdill's (1948) influential review concluded that no single trait or set of traits consistently predicted leadership across situations. However, his later review (1974) was more positive, finding that traits combined with situational factors could predict leadership emergence and effectiveness",
      "id": "WDEV-0067"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "leadership.html",
      "chapter_title": "Leadership",
      "section": "Behavioral Theories of Leadership",
      "passage_type": "paragraph",
      "passage": "Behavioral theories shifted focus from who leaders are to what leaders do, attempting to identify specific behaviors associated with effective leadership. Two major research programs dominated this era",
      "id": "WDEV-0068"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "leadership.html",
      "chapter_title": "Leadership",
      "section": "Ohio State Leadership Studies",
      "passage_type": "paragraph",
      "passage": "Researchers at Ohio State University  used factor analysis of the Leader Behavior Description Questionnaire (LBDQ) to identify two independent dimensions of leadership behavior:",
      "id": "WDEV-0069"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "leadership.html",
      "chapter_title": "Leadership",
      "section": "Ohio State Leadership Studies",
      "passage_type": "paragraph",
      "passage": "A critical finding was that these two dimensions are independent , meaning a leader can be high on both, low on both, or high on one and low on the other. Research generally found that leaders high on both dimensions were most effective",
      "id": "WDEV-0070"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "leadership.html",
      "chapter_title": "Leadership",
      "section": "University of Michigan Leadership Studies",
      "passage_type": "paragraph",
      "passage": "Unlike the Ohio State studies, the Michigan researchers initially conceptualized these as opposite ends of a single continuum, though later research supported the two-factor model. Michigan studies generally found that employee-oriented leadership was associated with higher group productivity and job satisfaction",
      "id": "WDEV-0071"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "leadership.html",
      "chapter_title": "Leadership",
      "section": "Blake and Mouton's Managerial Grid",
      "passage_type": "paragraph",
      "passage": "Robert Blake and Jane Mouton (1964) extended the behavioral approach with their Managerial Grid (later called the Leadership Grid), plotting concern for production (x-axis) against concern for people (y-axis), each rated from 1-9:",
      "id": "WDEV-0072"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "leadership.html",
      "chapter_title": "Leadership",
      "section": "Contingency Theories of Leadership",
      "passage_type": "paragraph",
      "passage": "Contingency theories propose that leadership effectiveness depends on the interaction between leader characteristics and situational factors. No single leadership style is universally best",
      "id": "WDEV-0073"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "leadership.html",
      "chapter_title": "Leadership",
      "section": "Fiedler's Contingency Model",
      "passage_type": "paragraph",
      "passage": "Fred Fiedler (1967) developed the first comprehensive contingency model of leadership. His model measures leader style using the Least Preferred Coworker (LPC) scale , which asks leaders to describe the person they have worked with least effectively",
      "id": "WDEV-0074"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "leadership.html",
      "chapter_title": "Leadership",
      "section": "Hersey-Blanchard Situational Leadership Theory",
      "passage_type": "paragraph",
      "passage": "Paul Hersey and Kenneth Blanchard (1969, 1977) developed the Situational Leadership Theory (originally called the \"Life Cycle Theory of Leadership\"), which proposes that effective leaders adapt their style to the readiness level (also called maturity) of their followers for a given task",
      "id": "WDEV-0075"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "leadership.html",
      "chapter_title": "Leadership",
      "section": "House's Path-Goal Theory",
      "passage_type": "paragraph",
      "passage": "Robert House (1971, 1996) developed path-goal theory, which draws on expectancy theory of motivation. The leader's job is to help followers achieve their goals by clarifying the path to rewards and removing obstacles",
      "id": "WDEV-0076"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "leadership.html",
      "chapter_title": "Leadership",
      "section": "House's Path-Goal Theory",
      "passage_type": "paragraph",
      "passage": "Unlike Fiedler, House assumed leaders can flexibly adapt their style. The optimal style depends on two contingency factors: subordinate characteristics (ability, locus of control, needs) and task/environmental characteristics (task structure, formal authority, work group)",
      "id": "WDEV-0077"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "leadership.html",
      "chapter_title": "Leadership",
      "section": "Leader-Member Exchange (LMX) Theory",
      "passage_type": "paragraph",
      "passage": "LMX theory (Graen & Uhl-Bien, 1995) focuses on the dyadic relationship between a leader and each individual follower, rather than treating all followers the same",
      "id": "WDEV-0078"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "leadership.html",
      "chapter_title": "Leadership",
      "section": "Transformational and Transactional Leadership",
      "passage_type": "paragraph",
      "passage": "The distinction between transformational and transactional leadership, first proposed by James MacGregor Burns (1978) and elaborated by Bernard Bass (1985), has become one of the most influential frameworks in contemporary leadership research",
      "id": "WDEV-0079"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "leadership.html",
      "chapter_title": "Leadership",
      "section": "Transactional Leadership",
      "passage_type": "paragraph",
      "passage": "Transactional leaders focus on exchanges between leader and follower -- rewards for compliance, punishment for deviation:",
      "id": "WDEV-0080"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "leadership.html",
      "chapter_title": "Leadership",
      "section": "Transformational Leadership (Bass's Four I's)",
      "passage_type": "paragraph",
      "passage": "Transformational leaders inspire followers to transcend their self-interest for the good of the organization. Bass identified four components, known as the Four I's :",
      "id": "WDEV-0081"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "leadership.html",
      "chapter_title": "Leadership",
      "section": "Transformational Leadership (Bass's Four I's)",
      "passage_type": "paragraph",
      "passage": "These components are measured by the Multifactor Leadership Questionnaire (MLQ) (Bass & Avolio, 1995). Meta-analyses consistently show that transformational leadership is positively associated with follower satisfaction, motivation, and performance across cultures and organizational types (Judge & Piccolo, 2004)",
      "id": "WDEV-0082"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "leadership.html",
      "chapter_title": "Leadership",
      "section": "Servant Leadership",
      "passage_type": "paragraph",
      "passage": "Servant leadership  inverts the traditional hierarchy: the leader's primary role is to serve followers. Key characteristics include listening, empathy, healing, awareness, persuasion (rather than coercion), conceptualization, foresight, stewardship, commitment to growth of people, and building community",
      "id": "WDEV-0083"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "leadership.html",
      "chapter_title": "Leadership",
      "section": "Servant Leadership",
      "passage_type": "paragraph",
      "passage": "Research supports associations between servant leadership and increased organizational citizenship behaviors, job satisfaction, and team effectiveness",
      "id": "WDEV-0084"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "motivation.html",
      "chapter_title": "Motivation",
      "section": "Herzberg's Two-Factor Theory",
      "passage_type": "definition",
      "passage": "Herzberg's Two Factors Motivator factors (intrinsic): Related to the content of the work itself. When present, they produce satisfaction and motivation; when absent, they produce a neutral state (not dissatisfaction). Achievement, recognition, the work itself, responsibility, advancement, growth Hygiene factors (extrinsic): Related to the context or environment of work. When inadequate, they produce dissatisfaction; when adequate, they produce a neutral state (not satisfaction). Company policy, supervision quality, salary, interpersonal relations, working conditions, job security",
      "id": "WDEV-0085"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "motivation.html",
      "chapter_title": "Motivation",
      "section": "McClelland's Acquired Needs Theory",
      "passage_type": "definition",
      "passage": "McClelland's Three Needs Need for Achievement (nAch): Drive to excel, accomplish challenging goals, and meet high standards of success. High-nAch individuals prefer moderate-risk tasks, want personal responsibility, and seek feedback on performance. Need for Power (nPow): Drive to influence, control, or direct others. Personalized power is self-serving; socialized power benefits the organization. Need for Affiliation (nAff): Drive for close interpersonal relationships, approval, and social belonging. High-nAff individuals prioritize harmony and may avoid conflict",
      "id": "WDEV-0086"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "motivation.html",
      "chapter_title": "Motivation",
      "section": "Vroom's Expectancy Theory",
      "passage_type": "definition",
      "passage": "Expectancy Theory Components Motivation = Expectancy x Instrumentality x Valence Expectancy (E): The belief that effort will lead to acceptable performance (effort-to-performance link). Ranges from 0 to 1. Instrumentality (I): The belief that performance will lead to a specific outcome or reward (performance-to-outcome link). Ranges from 0 to 1. Valence (V): The value or attractiveness of the outcome to the individual. Can be positive, negative, or zero. If any component is zero, motivation will be zero. All three must be positive for motivation to exist",
      "id": "WDEV-0087"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "motivation.html",
      "chapter_title": "Motivation",
      "section": "Adams's Equity Theory",
      "passage_type": "definition",
      "passage": "Equity Theory Formula My Outcomes / My Inputs = Other's Outcomes / Other's Inputs Inputs: Effort, skills, education, experience, time Outcomes: Pay, benefits, recognition, promotions, status When the ratios are unequal, individuals experience inequity distress and are motivated to restore equity through behavioral or cognitive adjustments",
      "id": "WDEV-0088"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "motivation.html",
      "chapter_title": "Motivation",
      "section": "Locke's Goal-Setting Theory",
      "passage_type": "definition",
      "passage": "Key Principles of Goal-Setting Theory Specificity: Specific goals (\"increase sales by 10%\") outperform vague goals (\"do your best\") Difficulty: Difficult but attainable goals lead to higher performance than easy goals, up to the limits of ability Commitment: Goals must be accepted and committed to -- participation in goal setting can enhance commitment Feedback: Goals combined with feedback are more effective than goals alone Self-efficacy: Belief in one's ability to achieve goals mediates the goal-performance relationship",
      "id": "WDEV-0089"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "motivation.html",
      "chapter_title": "Motivation",
      "section": "Self-Determination Theory",
      "passage_type": "definition",
      "passage": "SDT Motivation Continuum Amotivation: Complete lack of intention or motivation Extrinsic motivation: Behavior driven by external contingencies, ranging from: External regulation: Acting to obtain rewards or avoid punishments Introjected regulation: Acting to avoid guilt or enhance ego Identified regulation: Acting because the activity is personally important Integrated regulation: Acting because the activity aligns with core values Intrinsic motivation: Engaging in an activity for its inherent interest and enjoyment",
      "id": "WDEV-0090"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "motivation.html",
      "chapter_title": "Motivation",
      "section": "Maslow's Hierarchy of Needs",
      "passage_type": "clinical_note",
      "passage": "EPPP Key Concept Despite its intuitive appeal and widespread influence, Maslow's hierarchy has limited empirical support. Research has not consistently supported the strict hierarchical ordering of needs or the prepotency principle (Wahba & Bridwell, 1976). Nevertheless, the theory remains widely taught and tested on the EPPP due to its historical significance",
      "id": "WDEV-0091"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "motivation.html",
      "chapter_title": "Motivation",
      "section": "Locke's Goal-Setting Theory",
      "passage_type": "clinical_note",
      "passage": "EPPP Key Concept Goal-setting theory has exceptionally strong empirical support across hundreds of studies. For the EPPP, know that: (1) specific difficult goals produce the highest performance, (2) \"do your best\" goals are no better than no goals, (3) goals affect performance through four mechanisms -- directing attention, energizing effort, increasing persistence, and prompting strategy development, and (4) assigned goals can be as effective as participatively set goals, provided the person accepts them",
      "id": "WDEV-0092"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "motivation.html",
      "chapter_title": "Motivation",
      "section": "Herzberg's Two-Factor Theory",
      "passage_type": "example",
      "passage": "Example: Applying Herzberg's Theory A company improves its cafeteria, parking, and office space (hygiene factors). Employees stop complaining, but they are not more motivated. To actually increase motivation, the company would need to redesign jobs to include more challenging work, greater responsibility, and opportunities for achievement (motivators). This insight led to the concept of job enrichment",
      "id": "WDEV-0093"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "motivation.html",
      "chapter_title": "Motivation",
      "section": "Vroom's Expectancy Theory",
      "passage_type": "example",
      "passage": "Example: Applying Expectancy Theory An employee considering whether to work overtime: (1) \"Can I actually finish this project on time?\" (expectancy), (2) \"If I finish, will I get the promised bonus?\" (instrumentality), (3) \"How much do I value that bonus?\" (valence). If the employee doubts any of these, motivation to work overtime decreases",
      "id": "WDEV-0094"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "motivation.html",
      "chapter_title": "Motivation",
      "section": "Introduction to Work Motivation",
      "passage_type": "paragraph",
      "passage": "Work motivation refers to the psychological forces that determine the direction, intensity, and persistence of work-related behavior. Understanding motivation is essential for the EPPP, as it underpins management practices related to job design, compensation, goal setting, and employee engagement",
      "id": "WDEV-0095"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "motivation.html",
      "chapter_title": "Motivation",
      "section": "Introduction to Work Motivation",
      "passage_type": "paragraph",
      "passage": "Motivation theories are broadly categorized as content theories (what motivates people -- identifying specific needs or drives) and process theories (how motivation occurs -- explaining the cognitive mechanisms of motivation)",
      "id": "WDEV-0096"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "motivation.html",
      "chapter_title": "Motivation",
      "section": "Maslow's Hierarchy of Needs",
      "passage_type": "paragraph",
      "passage": "Abraham Maslow (1943, 1954) proposed that human needs are arranged in a hierarchy, with lower-level needs generally requiring satisfaction before higher-level needs become motivating",
      "id": "WDEV-0097"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "motivation.html",
      "chapter_title": "Motivation",
      "section": "Maslow's Hierarchy of Needs",
      "passage_type": "paragraph",
      "passage": "Key principles include the prepotency principle (lower needs must be substantially satisfied before higher needs become active motivators) and the deficit principle (a satisfied need is no longer a motivator). Maslow later added cognitive needs (knowledge, understanding) and aesthetic needs (beauty, order) between esteem and self-actualization, and transcendence above self-actualization",
      "id": "WDEV-0098"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "motivation.html",
      "chapter_title": "Motivation",
      "section": "Herzberg's Two-Factor Theory",
      "passage_type": "paragraph",
      "passage": "Frederick Herzberg (1959, 1966) proposed that job satisfaction and dissatisfaction are not opposite ends of a single continuum but rather are influenced by two separate sets of factors",
      "id": "WDEV-0099"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "motivation.html",
      "chapter_title": "Motivation",
      "section": "Herzberg's Two-Factor Theory",
      "passage_type": "paragraph",
      "passage": "Herzberg's theory has been criticized for being method-dependent (findings replicate best when using his critical incident technique), and for the assumption that salary is solely a hygiene factor. However, the distinction between intrinsic and extrinsic factors and the concept of job enrichment remain influential",
      "id": "WDEV-0100"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "motivation.html",
      "chapter_title": "Motivation",
      "section": "McClelland's Acquired Needs Theory",
      "passage_type": "paragraph",
      "passage": "David McClelland (1961) proposed that three learned (acquired) needs drive behavior in the workplace, with individuals varying in the relative strength of each:",
      "id": "WDEV-0101"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "motivation.html",
      "chapter_title": "Motivation",
      "section": "McClelland's Acquired Needs Theory",
      "passage_type": "paragraph",
      "passage": "McClelland measured these needs using the Thematic Apperception Test (TAT) , coding stories for achievement, power, and affiliation themes. His research found that effective leaders typically have high socialized need for power, moderate need for achievement, and lower need for affiliation. High-nAch individuals make good entrepreneurs but not necessarily good managers of large organizations",
      "id": "WDEV-0102"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "motivation.html",
      "chapter_title": "Motivation",
      "section": "Vroom's Expectancy Theory",
      "passage_type": "paragraph",
      "passage": "Victor Vroom (1964) proposed that motivation is a function of three cognitive variables, and that individuals make rational choices about the effort they expend at work:",
      "id": "WDEV-0103"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "motivation.html",
      "chapter_title": "Motivation",
      "section": "Adams's Equity Theory",
      "passage_type": "paragraph",
      "passage": "J. Stacy Adams (1963, 1965) proposed that individuals are motivated to maintain a sense of fairness by comparing their input-to-outcome ratio with that of a relevant comparison other",
      "id": "WDEV-0104"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "motivation.html",
      "chapter_title": "Motivation",
      "section": "Adams's Equity Theory",
      "passage_type": "paragraph",
      "passage": "Research generally supports that underpayment inequity (being underrewarded) leads to decreased effort or quality. Overpayment inequity (being overrewarded) may temporarily increase effort, though people more quickly rationalize overpayment",
      "id": "WDEV-0105"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "motivation.html",
      "chapter_title": "Motivation",
      "section": "Locke's Goal-Setting Theory",
      "passage_type": "paragraph",
      "passage": "Edwin Locke (1968; Locke & Latham, 1990, 2002) developed one of the most empirically supported theories of work motivation. The core finding is that specific, difficult goals lead to higher performance than vague or easy goals",
      "id": "WDEV-0106"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "motivation.html",
      "chapter_title": "Motivation",
      "section": "Self-Determination Theory",
      "passage_type": "paragraph",
      "passage": "Self-determination theory (SDT) , developed by Edward Deci and Richard Ryan (1985, 2000), distinguishes between different types of motivation based on the degree to which behavior is self-determined",
      "id": "WDEV-0107"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "motivation.html",
      "chapter_title": "Motivation",
      "section": "Self-Determination Theory",
      "passage_type": "paragraph",
      "passage": "A key finding of SDT research is the overjustification effect : providing extrinsic rewards for intrinsically motivated behavior can undermine intrinsic motivation, particularly when rewards are perceived as controlling rather than informational",
      "id": "WDEV-0108"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "org-change.html",
      "chapter_title": "Organizational Change",
      "section": "Organizational Culture",
      "passage_type": "definition",
      "passage": "Schein's Three Levels of Organizational Culture Artifacts: Visible, tangible elements (physical layout, dress code, rituals, logos, published values) -- easy to observe but difficult to interpret Espoused values: Stated strategies, goals, and philosophies -- what the organization says it values (may or may not align with actual behavior) Basic underlying assumptions: Unconscious, taken-for-granted beliefs about human nature, relationships, and reality -- the deepest and most difficult to change level, but the essence of culture",
      "id": "WDEV-0109"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "org-change.html",
      "chapter_title": "Organizational Change",
      "section": "Lewin's Force Field Analysis",
      "passage_type": "clinical_note",
      "passage": "EPPP Key Concept Lewin argued that reducing restraining forces is generally more effective than increasing driving forces for producing lasting change. Increasing driving forces without addressing restraining forces can create tension and instability. This insight has important implications for managing resistance -- work to understand and reduce resistance rather than simply pushing harder for change",
      "id": "WDEV-0110"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "org-change.html",
      "chapter_title": "Organizational Change",
      "section": "Appreciative Inquiry",
      "passage_type": "clinical_note",
      "passage": "EPPP Key Concept For the EPPP, know that Appreciative Inquiry is a strengths-based OD intervention that contrasts with traditional problem-solving approaches. The 4D cycle (Discovery, Dream, Design, Destiny) is the key framework. AI is rooted in social constructionism -- the idea that organizations are socially constructed and can be reimagined through positive dialogue",
      "id": "WDEV-0111"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "org-change.html",
      "chapter_title": "Organizational Change",
      "section": "Appreciative Inquiry",
      "passage_type": "example",
      "passage": "Strengths-Based vs. Deficit-Based Approaches Traditional OD follows a deficit-based model: identify a problem, diagnose causes, develop solutions, and implement fixes. Appreciative Inquiry inverts this by asking \"What is working?\" rather than \"What is broken?\" The assumption is that organizations grow in the direction of what they study -- focusing on problems generates more problem-finding, while focusing on strengths generates energy, innovation, and positive change. This makes AI particularly useful when organizations need to build morale and engagement during transformational change",
      "id": "WDEV-0112"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "org-change.html",
      "chapter_title": "Organizational Change",
      "section": "Resistance to Change",
      "passage_type": "example",
      "passage": "Strategies for Overcoming Resistance Kotter and Schlesinger (1979) identified six strategies, ranging from collaborative to coercive: (1) Education and communication -- explain the rationale; (2) Participation and involvement -- involve resistors in planning; (3) Facilitation and support -- provide training and resources; (4) Negotiation and agreement -- offer incentives; (5) Manipulation and co-optation -- give resistors a symbolic role; (6) Explicit and implicit coercion -- use authority to force compliance (last resort)",
      "id": "WDEV-0113"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "org-change.html",
      "chapter_title": "Organizational Change",
      "section": "Introduction to Organizational Change",
      "passage_type": "paragraph",
      "passage": "Organizational change encompasses the processes, strategies, and models used to transition organizations from their current state to a desired future state. The EPPP tests knowledge of classic change models, organizational development interventions, resistance to change, and the role of organizational culture",
      "id": "WDEV-0114"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "org-change.html",
      "chapter_title": "Organizational Change",
      "section": "Introduction to Organizational Change",
      "passage_type": "paragraph",
      "passage": "Understanding change is critical because most organizational interventions -- whether involving restructuring, culture change, or new technology implementation -- require systematic change management to succeed",
      "id": "WDEV-0115"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "org-change.html",
      "chapter_title": "Organizational Change",
      "section": "Lewin's Change Model",
      "passage_type": "paragraph",
      "passage": "Kurt Lewin (1947) developed one of the most influential models of planned change, conceptualizing the change process as moving through three sequential stages",
      "id": "WDEV-0116"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "org-change.html",
      "chapter_title": "Organizational Change",
      "section": "Lewin's Force Field Analysis",
      "passage_type": "paragraph",
      "passage": "Force field analysis is Lewin's diagnostic tool for understanding the forces that support and resist change. The current state is maintained by an equilibrium between:",
      "id": "WDEV-0117"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "org-change.html",
      "chapter_title": "Organizational Change",
      "section": "Kotter's Eight-Step Model",
      "passage_type": "paragraph",
      "passage": "John Kotter (1996) expanded on Lewin's model to provide a more detailed, practical framework for leading organizational change:",
      "id": "WDEV-0118"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "org-change.html",
      "chapter_title": "Organizational Change",
      "section": "Kotter's Eight-Step Model",
      "passage_type": "paragraph",
      "passage": "Kotter emphasized that the stages should be followed sequentially and that the most common errors include failing to establish sufficient urgency (Step 1) and declaring victory too early before changes are anchored in the culture (Step 8)",
      "id": "WDEV-0119"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "org-change.html",
      "chapter_title": "Organizational Change",
      "section": "Organizational Development (OD)",
      "passage_type": "paragraph",
      "passage": "Organizational development is a planned, systematic approach to improving organizational effectiveness through the application of behavioral science knowledge. OD is distinguished by its emphasis on humanistic values, collaboration, and long-term change",
      "id": "WDEV-0120"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "org-change.html",
      "chapter_title": "Organizational Change",
      "section": "Action Research",
      "passage_type": "paragraph",
      "passage": "Action research , developed by Kurt Lewin, is both a research approach and a change methodology. It involves a cyclical process:",
      "id": "WDEV-0121"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "org-change.html",
      "chapter_title": "Organizational Change",
      "section": "Appreciative Inquiry",
      "passage_type": "paragraph",
      "passage": "Appreciative Inquiry (AI) , developed by David Cooperrider and Suresh Srivastva (1987), represents a fundamental departure from traditional organizational development approaches. Rather than identifying problems and deficits to fix, AI focuses on discovering what works well in an organization and amplifying those strengths",
      "id": "WDEV-0122"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "org-change.html",
      "chapter_title": "Organizational Change",
      "section": "Resistance to Change",
      "passage_type": "paragraph",
      "passage": "Resistance to change is a natural response that can stem from individual and organizational factors. Understanding the sources of resistance is essential for managing change effectively",
      "id": "WDEV-0123"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "org-change.html",
      "chapter_title": "Organizational Change",
      "section": "Organizational Culture",
      "passage_type": "paragraph",
      "passage": "Organizational culture refers to the shared assumptions, values, beliefs, and norms that shape behavior within an organization. Edgar Schein (1985, 2010) proposed three levels of culture:",
      "id": "WDEV-0124"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "org-change.html",
      "chapter_title": "Organizational Change",
      "section": "Organizational Culture",
      "passage_type": "paragraph",
      "passage": "Culture change is among the most challenging forms of organizational change because basic assumptions are deeply embedded and often unconscious. Successful culture change typically requires leadership modeling, alignment of reward systems, hiring for cultural fit, and sustained attention over years rather than months",
      "id": "WDEV-0125"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "organizational-theories.html",
      "chapter_title": "Organizational Theories",
      "section": "Scientific Management (Frederick Taylor)",
      "passage_type": "definition",
      "passage": "Core Principles of Scientific Management Scientific study of tasks: Use time-and-motion studies to determine the most efficient method for each task Scientific selection of workers: Match workers to jobs based on their abilities and training them systematically Cooperation between management and workers: Management plans and supervises; workers execute Equal division of work: Responsibility is shared between management (planning) and workers (execution)",
      "id": "WDEV-0126"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "organizational-theories.html",
      "chapter_title": "Organizational Theories",
      "section": "Bureaucratic Theory (Max Weber)",
      "passage_type": "definition",
      "passage": "Key Features of Weber's Ideal Bureaucracy Division of labor: Specialized roles with clearly defined responsibilities Hierarchy of authority: Clear chain of command from top to bottom Formal rules and procedures: Written policies governing behavior and decisions Impersonality: Decisions based on rules, not personal relationships or feelings Merit-based selection: Hiring and promotion based on qualifications and performance Career orientation: Employment as a long-term career with advancement opportunities",
      "id": "WDEV-0127"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "organizational-theories.html",
      "chapter_title": "Organizational Theories",
      "section": "Administrative Management (Henri Fayol)",
      "passage_type": "definition",
      "passage": "Fayol's Five Functions of Management Planning: Forecasting future conditions and establishing objectives Organizing: Arranging resources and tasks to achieve objectives Commanding: Directing and motivating employees Coordinating: Harmonizing activities across departments Controlling: Monitoring performance against plans and correcting deviations",
      "id": "WDEV-0128"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "organizational-theories.html",
      "chapter_title": "Organizational Theories",
      "section": "The Hawthorne Studies",
      "passage_type": "clinical_note",
      "passage": "EPPP Key Concept: The Hawthorne Effect The Hawthorne effect refers to the tendency for people to change their behavior simply because they know they are being observed or are receiving special attention. While the original interpretation of the Hawthorne studies has been debated and critiqued (Levitt & List, 2011), the term remains widely used in research methodology. On the EPPP, know that the Hawthorne effect represents a threat to internal validity in research design",
      "id": "WDEV-0129"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "organizational-theories.html",
      "chapter_title": "Organizational Theories",
      "section": "Lawrence and Lorsch: Differentiation and Integration",
      "passage_type": "clinical_note",
      "passage": "EPPP Key Concept The key insight of contingency theory is that there is no single best way to organize. Effectiveness depends on the fit between organizational characteristics and situational factors. On the EPPP, know that mechanistic structures work best in stable environments, while organic structures are more effective in uncertain, rapidly changing environments",
      "id": "WDEV-0130"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "organizational-theories.html",
      "chapter_title": "Organizational Theories",
      "section": "Scientific Management (Frederick Taylor)",
      "passage_type": "example",
      "passage": "Example: Time-and-Motion Studies Taylor's famous pig-iron experiment at Bethlehem Steel demonstrated that by scientifically studying the optimal weight of shoveled loads and rest intervals, worker productivity could increase from 12.5 to 47.5 tons per day. Workers received a 60% pay increase while the company's costs per ton decreased",
      "id": "WDEV-0131"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "organizational-theories.html",
      "chapter_title": "Organizational Theories",
      "section": "Open Systems Model",
      "passage_type": "example",
      "passage": "Example: Equifinality in Organizations Two technology companies can achieve similar market success through very different strategies: one through innovation and first-mover advantage, and another through cost efficiency and market follower strategies. This illustrates equifinality -- there is no single \"best way\" to achieve organizational goals",
      "id": "WDEV-0132"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "organizational-theories.html",
      "chapter_title": "Organizational Theories",
      "section": "Introduction to Organizational Theories",
      "passage_type": "paragraph",
      "passage": "Organizational theories provide frameworks for understanding how organizations are structured, how they function, and how they can be improved. For the EPPP, you must understand the historical evolution of these theories, from classical approaches emphasizing efficiency and structure to modern perspectives that account for complexity, human factors, and environmental contingencies",
      "id": "WDEV-0133"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "organizational-theories.html",
      "chapter_title": "Organizational Theories",
      "section": "Introduction to Organizational Theories",
      "passage_type": "paragraph",
      "passage": "These theories form the foundation of industrial/organizational psychology and inform current practices in organizational design, management, and consulting",
      "id": "WDEV-0134"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "organizational-theories.html",
      "chapter_title": "Organizational Theories",
      "section": "Classical Organizational Theory",
      "passage_type": "paragraph",
      "passage": "Classical theories emerged in the early 20th century during the Industrial Revolution, when organizations were growing rapidly and managers sought systematic approaches to improve efficiency and productivity. These theories share an emphasis on rational structure , clear hierarchies, and standardized procedures",
      "id": "WDEV-0135"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "organizational-theories.html",
      "chapter_title": "Organizational Theories",
      "section": "Scientific Management (Frederick Taylor)",
      "passage_type": "paragraph",
      "passage": "Scientific management , developed by Frederick Winslow Taylor (1911), applied scientific methods to analyze and optimize work processes. Taylor believed there was \"one best way\" to perform any job, and that scientific study could identify it",
      "id": "WDEV-0136"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "organizational-theories.html",
      "chapter_title": "Organizational Theories",
      "section": "Scientific Management (Frederick Taylor)",
      "passage_type": "paragraph",
      "passage": "Taylor's approach was criticized for treating workers as interchangeable parts, ignoring social and psychological needs, and reducing worker autonomy. Nevertheless, his principles laid the groundwork for modern job analysis, performance standards, and incentive systems",
      "id": "WDEV-0137"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "organizational-theories.html",
      "chapter_title": "Organizational Theories",
      "section": "Bureaucratic Theory (Max Weber)",
      "passage_type": "paragraph",
      "passage": "Max Weber (1947) developed the theory of bureaucracy as an ideal organizational form characterized by rationality, predictability, and efficiency. Weber distinguished between three types of authority:",
      "id": "WDEV-0138"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "organizational-theories.html",
      "chapter_title": "Organizational Theories",
      "section": "Bureaucratic Theory (Max Weber)",
      "passage_type": "paragraph",
      "passage": "Weber acknowledged that bureaucracies could become rigid (\"iron cage\") and overly focused on rules at the expense of goals, a phenomenon later termed goal displacement",
      "id": "WDEV-0139"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "organizational-theories.html",
      "chapter_title": "Organizational Theories",
      "section": "Administrative Management (Henri Fayol)",
      "passage_type": "paragraph",
      "passage": "Henri Fayol (1916) approached organizational theory from the perspective of top management, identifying five basic functions of management and 14 principles of administration",
      "id": "WDEV-0140"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "organizational-theories.html",
      "chapter_title": "Organizational Theories",
      "section": "Administrative Management (Henri Fayol)",
      "passage_type": "paragraph",
      "passage": "Key Fayol principles include unity of command (each employee reports to one supervisor), scalar chain (clear line of authority), and span of control (limit on the number of subordinates one manager can effectively supervise)",
      "id": "WDEV-0141"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "organizational-theories.html",
      "chapter_title": "Organizational Theories",
      "section": "Human Relations Movement",
      "passage_type": "paragraph",
      "passage": "The human relations movement emerged as a reaction to the mechanistic view of workers in classical theory, emphasizing the importance of social factors, employee attitudes, and informal group dynamics in organizational effectiveness",
      "id": "WDEV-0142"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "organizational-theories.html",
      "chapter_title": "Organizational Theories",
      "section": "The Hawthorne Studies",
      "passage_type": "paragraph",
      "passage": "The Hawthorne studies (1924-1932), conducted at the Western Electric Hawthorne Works near Chicago, are among the most famous research projects in organizational psychology. Initially designed to examine the effects of physical working conditions on productivity, they yielded unexpected findings about social and psychological factors",
      "id": "WDEV-0143"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "organizational-theories.html",
      "chapter_title": "Organizational Theories",
      "section": "The Hawthorne Studies",
      "passage_type": "paragraph",
      "passage": "Elton Mayo and Fritz Roethlisberger, the principal researchers, concluded that social factors -- group norms, supervisory style, and employee attitudes -- were more powerful determinants of productivity than physical working conditions or economic incentives alone",
      "id": "WDEV-0144"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "organizational-theories.html",
      "chapter_title": "Organizational Theories",
      "section": "McGregor's Theory X and Theory Y",
      "passage_type": "paragraph",
      "passage": "Douglas McGregor (1960) proposed that managers hold implicit assumptions about human nature that profoundly influence their management style. He described two contrasting sets of assumptions:",
      "id": "WDEV-0145"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "organizational-theories.html",
      "chapter_title": "Organizational Theories",
      "section": "McGregor's Theory X and Theory Y",
      "passage_type": "paragraph",
      "passage": "McGregor argued that Theory Y assumptions were generally more accurate and that management practices based on Theory Y (participative management, delegation, enriched jobs) would lead to higher motivation and organizational effectiveness. His work significantly influenced the development of participative management and organizational development",
      "id": "WDEV-0146"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "organizational-theories.html",
      "chapter_title": "Organizational Theories",
      "section": "Systems Theory",
      "passage_type": "paragraph",
      "passage": "Systems theory views organizations as complex, interconnected systems that interact with their environment. Drawing on general systems theory (von Bertalanffy, 1968), this perspective emphasizes that organizations cannot be understood by examining their parts in isolation",
      "id": "WDEV-0147"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "organizational-theories.html",
      "chapter_title": "Organizational Theories",
      "section": "Open Systems Model",
      "passage_type": "paragraph",
      "passage": "Organizations are conceptualized as open systems that take in inputs from the environment, transform them through internal processes, and produce outputs that feed back into the environment",
      "id": "WDEV-0148"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "organizational-theories.html",
      "chapter_title": "Organizational Theories",
      "section": "Katz and Kahn's Social Systems Model",
      "passage_type": "paragraph",
      "passage": "Daniel Katz and Robert Kahn (1966, 1978) applied open systems theory specifically to organizations, identifying five key organizational subsystems:",
      "id": "WDEV-0149"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "organizational-theories.html",
      "chapter_title": "Organizational Theories",
      "section": "Contingency Theory",
      "passage_type": "paragraph",
      "passage": "Contingency theory rejects the idea of universal \"best practices\" in organizational design. Instead, it proposes that the optimal organizational structure depends on (is contingent upon) various situational factors, particularly the organization's environment, technology, and size",
      "id": "WDEV-0150"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "organizational-theories.html",
      "chapter_title": "Organizational Theories",
      "section": "Lawrence and Lorsch: Differentiation and Integration",
      "passage_type": "paragraph",
      "passage": "Paul Lawrence and Jay Lorsch (1967) found that effective organizations match their internal structure to environmental demands. As environments become more complex and uncertain, organizations require greater differentiation (specialized departments) and correspondingly greater integration (mechanisms to coordinate those departments)",
      "id": "WDEV-0151"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "organizational-theories.html",
      "chapter_title": "Organizational Theories",
      "section": "Woodward's Technology Typology",
      "passage_type": "paragraph",
      "passage": "Joan Woodward (1965) demonstrated that an organization's technology -- specifically, the complexity of its production process -- influences its optimal structure:",
      "id": "WDEV-0152"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "satisfaction-stress.html",
      "chapter_title": "Satisfaction & Stress",
      "section": "Organizational Commitment",
      "passage_type": "definition",
      "passage": "Three Components of Organizational Commitment Component Basis Reason for Staying Affective commitment Emotional attachment and identification \"I stay because I want to\" Continuance commitment Perceived costs of leaving (investments, lack of alternatives) \"I stay because I need to\" Normative commitment Sense of obligation and loyalty \"I stay because I ought to\"",
      "id": "WDEV-0153"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "satisfaction-stress.html",
      "chapter_title": "Satisfaction & Stress",
      "section": "Burnout",
      "passage_type": "definition",
      "passage": "Maslach's Three Dimensions of Burnout Emotional exhaustion: Feeling drained, depleted of emotional resources, and overwhelmed by work demands. This is considered the core and most prominent dimension. Depersonalization (cynicism): Developing negative, callous, or detached attitudes toward clients, patients, or coworkers. In human service professions, this manifests as treating people as objects. Reduced personal accomplishment (inefficacy): Feeling incompetent, unproductive, and lacking achievement in one's work with people",
      "id": "WDEV-0154"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "satisfaction-stress.html",
      "chapter_title": "Satisfaction & Stress",
      "section": "Karasek's Job Demand-Control Model",
      "passage_type": "definition",
      "passage": "Four Job Types in the Demand-Control Model Low Demands High Demands High Control Low-strain (relaxed) Active (challenging but manageable) Low Control Passive (boring, de-motivating) High-strain (most stressful) The high-strain condition (high demands, low control) is most detrimental to health and well-being. Later versions added social support as a third dimension -- iso-strain (high demands, low control, low social support) is the most harmful combination",
      "id": "WDEV-0155"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "satisfaction-stress.html",
      "chapter_title": "Satisfaction & Stress",
      "section": "Hackman and Oldham's Job Characteristics Model",
      "passage_type": "clinical_note",
      "passage": "EPPP Key Concept The Job Characteristics Model includes a moderator: Growth Need Strength (GNS) . The model predicts that the relationship between job characteristics and outcomes is strongest for individuals with high GNS -- those who have a strong desire for personal growth, learning, and challenge. Individuals with low GNS may not respond positively to enriched jobs",
      "id": "WDEV-0156"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "satisfaction-stress.html",
      "chapter_title": "Satisfaction & Stress",
      "section": "Organizational Citizenship Behavior (OCB)",
      "passage_type": "clinical_note",
      "passage": "EPPP Key Concept OCBs are important because they represent performance that is not captured by traditional job performance measures . For the EPPP, know Organ's five dimensions and that OCBs are most strongly predicted by job satisfaction and organizational justice (particularly procedural justice). Also note the distinction between OCB-I (behaviors directed toward individuals, like altruism and courtesy) and OCB-O (behaviors directed toward the organization, like conscientiousness, sportsmanship, and civic virtue)",
      "id": "WDEV-0157"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "satisfaction-stress.html",
      "chapter_title": "Satisfaction & Stress",
      "section": "Burnout",
      "passage_type": "clinical_note",
      "passage": "EPPP Key Concept Burnout is particularly prevalent among helping professionals (therapists, physicians, nurses, social workers, teachers). For the EPPP, know that emotional exhaustion is the most central component and develops first. Depersonalization is considered a coping response to exhaustion, and reduced personal accomplishment develops as a consequence. Burnout is distinct from depression, though they share features -- burnout is work-specific, while depression is more pervasive",
      "id": "WDEV-0158"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "satisfaction-stress.html",
      "chapter_title": "Satisfaction & Stress",
      "section": "Organizational Commitment",
      "passage_type": "example",
      "passage": "Example: Continuance Commitment A psychologist who has accumulated a generous pension, built a strong referral network, and lives close to her clinic may feel \"locked in\" despite dissatisfaction. Her years of investment and the perceived difficulty of starting over create high continuance commitment. She stays but may be disengaged -- illustrating why continuance commitment predicts retention but not performance",
      "id": "WDEV-0159"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "satisfaction-stress.html",
      "chapter_title": "Satisfaction & Stress",
      "section": "Introduction to Job Satisfaction and Occupational Stress",
      "passage_type": "paragraph",
      "passage": "Job satisfaction and occupational stress are among the most widely studied outcomes in I/O psychology. They influence employee well-being, performance, absenteeism, and turnover. The EPPP tests knowledge of the major theoretical frameworks, the construct of organizational commitment, and the burnout syndrome",
      "id": "WDEV-0160"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "satisfaction-stress.html",
      "chapter_title": "Satisfaction & Stress",
      "section": "Job Satisfaction",
      "passage_type": "paragraph",
      "passage": "Job satisfaction is an evaluative judgment about one's job that reflects cognitive and affective responses to job experiences. It can be assessed as overall (global) satisfaction or as satisfaction with specific facets (pay, supervision, coworkers, promotion, work itself)",
      "id": "WDEV-0161"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "satisfaction-stress.html",
      "chapter_title": "Satisfaction & Stress",
      "section": "Dispositional Approach",
      "passage_type": "paragraph",
      "passage": "The dispositional approach suggests that job satisfaction is partly determined by stable personality traits. Research shows that satisfaction levels remain moderately consistent across jobs and over time, suggesting a dispositional component",
      "id": "WDEV-0162"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "satisfaction-stress.html",
      "chapter_title": "Satisfaction & Stress",
      "section": "Locke's Value-Percept Theory",
      "passage_type": "paragraph",
      "passage": "Edwin Locke (1976) proposed that job satisfaction results from the perception that one's job fulfills important work values. Satisfaction = (V want - V have ) x V importance . Greater discrepancy between what is wanted and what is received leads to dissatisfaction, but only if the dimension is important to the individual",
      "id": "WDEV-0163"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "satisfaction-stress.html",
      "chapter_title": "Satisfaction & Stress",
      "section": "Hackman and Oldham's Job Characteristics Model",
      "passage_type": "paragraph",
      "passage": "The Job Characteristics Model (Hackman & Oldham, 1976) identifies five core job dimensions that produce critical psychological states leading to satisfaction and motivation:",
      "id": "WDEV-0164"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "satisfaction-stress.html",
      "chapter_title": "Satisfaction & Stress",
      "section": "Organizational Commitment",
      "passage_type": "paragraph",
      "passage": "Organizational commitment reflects an employee's psychological attachment to and identification with their organization. The most widely accepted model is Meyer and Allen's (1991) three-component model:",
      "id": "WDEV-0165"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "satisfaction-stress.html",
      "chapter_title": "Satisfaction & Stress",
      "section": "Organizational Commitment",
      "passage_type": "paragraph",
      "passage": "Research consistently shows that affective commitment has the strongest positive relationship with desirable outcomes (job performance, organizational citizenship behavior, attendance) and the strongest negative relationship with turnover. Continuance commitment has weaker or even negative relationships with performance, as employees may stay but not be highly motivated",
      "id": "WDEV-0166"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "satisfaction-stress.html",
      "chapter_title": "Satisfaction & Stress",
      "section": "Organizational Citizenship Behavior (OCB)",
      "passage_type": "paragraph",
      "passage": "Organizational citizenship behavior (OCB) , defined by Dennis Organ (1988), refers to individual behavior that is discretionary, not directly or explicitly recognized by the formal reward system, and that in the aggregate promotes the effective functioning of the organization. OCBs are the \"extra-role\" behaviors that go beyond formal job requirements",
      "id": "WDEV-0167"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "satisfaction-stress.html",
      "chapter_title": "Satisfaction & Stress",
      "section": "Organizational Citizenship Behavior (OCB)",
      "passage_type": "paragraph",
      "passage": "Research consistently shows that OCBs are positively predicted by affective commitment , job satisfaction, perceptions of fairness (organizational justice), and transformational leadership. OCBs contribute to organizational effectiveness by enhancing coworker productivity, reducing the need for maintenance functions, and improving coordination",
      "id": "WDEV-0168"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "satisfaction-stress.html",
      "chapter_title": "Satisfaction & Stress",
      "section": "Burnout",
      "passage_type": "paragraph",
      "passage": "Burnout is a psychological syndrome resulting from chronic workplace stress that has not been successfully managed. Christina Maslach's model (Maslach & Jackson, 1981) is the most widely cited framework",
      "id": "WDEV-0169"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "satisfaction-stress.html",
      "chapter_title": "Satisfaction & Stress",
      "section": "Burnout",
      "passage_type": "paragraph",
      "passage": "Burnout is measured by the Maslach Burnout Inventory (MBI) , which has versions for human services, educators, and general occupations. Risk factors include high workload, lack of control, insufficient reward, breakdown of community, absence of fairness, and value conflicts (Maslach & Leiter, 2008)",
      "id": "WDEV-0170"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "satisfaction-stress.html",
      "chapter_title": "Satisfaction & Stress",
      "section": "Karasek's Job Demand-Control Model",
      "passage_type": "paragraph",
      "passage": "Robert Karasek (1979) proposed that occupational stress results from the interaction of two factors: job demands and job control (decision latitude)",
      "id": "WDEV-0171"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "satisfaction-stress.html",
      "chapter_title": "Satisfaction & Stress",
      "section": "Effort-Reward Imbalance Model (Siegrist)",
      "passage_type": "paragraph",
      "passage": "Johannes Siegrist (1996) proposed that stress results from an imbalance between effort expended at work and rewards received (salary, esteem, career opportunities, job security). High effort combined with low reward produces distress, particularly for individuals high in overcommitment (excessive striving and need for approval)",
      "id": "WDEV-0172"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "satisfaction-stress.html",
      "chapter_title": "Satisfaction & Stress",
      "section": "Work-Life Balance",
      "passage_type": "paragraph",
      "passage": "Work-family conflict occurs when demands from work and family domains are mutually incompatible. Two directions of conflict are recognized:",
      "id": "WDEV-0173"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "satisfaction-stress.html",
      "chapter_title": "Satisfaction & Stress",
      "section": "Work-Life Balance",
      "passage_type": "paragraph",
      "passage": "Both directions are associated with decreased satisfaction, increased stress, and poorer mental health. Organizational interventions include flexible work arrangements, family leave policies, telework options, and supportive supervision",
      "id": "WDEV-0174"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "selection-evaluation.html",
      "chapter_title": "Selection Evaluation",
      "section": "The Brogden-Cronbach-Gleser Model",
      "passage_type": "definition",
      "passage": "Utility Analysis Formula The standard utility formula estimates the dollar gain per selectee per year: Utility = N x r x SD y x Z x - C N: Number of applicants selected r: Validity coefficient of the selection procedure SD y : Standard deviation of job performance in dollar terms (typically estimated as 40% of salary) Z x : Average standardized test score of those selected (depends on the selection ratio) C: Cost of testing per applicant",
      "id": "WDEV-0175"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "selection-evaluation.html",
      "chapter_title": "Selection Evaluation",
      "section": "Adverse Impact and the Four-Fifths Rule",
      "passage_type": "definition",
      "passage": "The Four-Fifths (80%) Rule The four-fifths rule , established in the Uniform Guidelines on Employee Selection Procedures (1978), provides a practical measure of adverse impact: If the selection rate for a protected group is less than 4/5 (80%) of the rate for the group with the highest selection rate, adverse impact is indicated. Formula: Selection rate of protected group / Selection rate of majority group < .80 = adverse impact",
      "id": "WDEV-0176"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "selection-evaluation.html",
      "chapter_title": "Selection Evaluation",
      "section": "Validity Generalization",
      "passage_type": "definition",
      "passage": "Key Implications of Validity Generalization If artifacts account for most variability in validity coefficients, a test validated in one setting can be assumed valid in similar settings without local validation -- called transportability General cognitive ability tests show validity that generalizes across nearly all jobs and settings VG challenges the traditional requirement for separate local validation studies for each organization and job True validities are often much higher than observed validities once statistical artifacts are corrected",
      "id": "WDEV-0177"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "selection-evaluation.html",
      "chapter_title": "Selection Evaluation",
      "section": "Banding",
      "passage_type": "definition",
      "passage": "Types of Banding Fixed bands: The score range is divided into predetermined, non-overlapping bands (e.g., 90-100, 80-89). Candidates within a band are treated as equivalent. Sliding bands: Bands are centered on the highest remaining score. After the top-scoring candidate is selected, the band shifts down. This approach is more controversial and has been both supported and criticized in legal contexts",
      "id": "WDEV-0178"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "selection-evaluation.html",
      "chapter_title": "Selection Evaluation",
      "section": "Adverse Impact and the Four-Fifths Rule",
      "passage_type": "clinical_note",
      "passage": "EPPP Key Concept The four-fifths rule is a guideline, not a strict legal standard. Courts also consider statistical significance tests and practical significance. If adverse impact is found, the burden shifts to the employer to demonstrate job-relatedness (validity). Even if validity is demonstrated, the plaintiff can still prevail by showing that an equally valid alternative with less adverse impact exists",
      "id": "WDEV-0179"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "selection-evaluation.html",
      "chapter_title": "Selection Evaluation",
      "section": "Differential Validity",
      "passage_type": "clinical_note",
      "passage": "EPPP Key Concept Research consistently shows that cognitive ability tests tend to slightly overpredict job performance for minority group members (i.e., the test underpredicts the true performance gap). This means that using a common regression line does not disadvantage minority applicants from a predictive standpoint, even though group mean score differences create adverse impact. The distinction between predictive bias (absent) and adverse impact (present) is critical for the EPPP",
      "id": "WDEV-0180"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "selection-evaluation.html",
      "chapter_title": "Selection Evaluation",
      "section": "The Brogden-Cronbach-Gleser Model",
      "passage_type": "example",
      "passage": "Key Determinant: The Selection Ratio The selection ratio is the number of positions divided by the number of applicants (n hired / N applicants). A low selection ratio (e.g., 10 positions for 100 applicants = .10) means the organization is more selective and the utility of a valid test is greater. A high selection ratio (e.g., 90 positions for 100 applicants = .90) means nearly everyone is hired regardless of test scores, reducing the test's practical value",
      "id": "WDEV-0181"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "selection-evaluation.html",
      "chapter_title": "Selection Evaluation",
      "section": "Adverse Impact and the Four-Fifths Rule",
      "passage_type": "example",
      "passage": "Example: Calculating Adverse Impact An employer tests 100 White applicants and hires 60 (60% selection rate). The same employer tests 50 Black applicants and hires 20 (40% selection rate). Adverse impact ratio = 40% / 60% = .667 (66.7%) Since .667 is less than .80, adverse impact is indicated. The employer would need to demonstrate the test is job-related and consistent with business necessity",
      "id": "WDEV-0182"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "selection-evaluation.html",
      "chapter_title": "Selection Evaluation",
      "section": "Introduction to Selection Evaluation",
      "passage_type": "paragraph",
      "passage": "Evaluating the effectiveness of selection systems involves examining their predictive accuracy, practical utility, fairness to different groups, and legal compliance. The EPPP tests knowledge of utility analysis, adverse impact assessment, validity generalization, and the legal/professional guidelines governing testing in employment settings",
      "id": "WDEV-0183"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "selection-evaluation.html",
      "chapter_title": "Selection Evaluation",
      "section": "Utility Analysis",
      "passage_type": "paragraph",
      "passage": "Utility analysis quantifies the economic value of using a particular selection procedure compared to random selection or an existing method. It translates validity coefficients into dollar values, helping organizations understand the return on investment from improved selection",
      "id": "WDEV-0184"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "selection-evaluation.html",
      "chapter_title": "Selection Evaluation",
      "section": "The Brogden-Cronbach-Gleser Model",
      "passage_type": "paragraph",
      "passage": "The Taylor-Russell tables provide an alternative approach, showing the proportion of successful employees expected when using a selection test, given the test's validity, the selection ratio, and the base rate of success (the proportion who would succeed without the test). Utility is greatest when the validity is high, the selection ratio is low, and the base rate is moderate (around .50)",
      "id": "WDEV-0185"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "selection-evaluation.html",
      "chapter_title": "Selection Evaluation",
      "section": "Adverse Impact and the Four-Fifths Rule",
      "passage_type": "paragraph",
      "passage": "Adverse impact occurs when a selection procedure results in a substantially different selection rate for members of a protected group compared to the group with the highest selection rate",
      "id": "WDEV-0186"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "selection-evaluation.html",
      "chapter_title": "Selection Evaluation",
      "section": "Validity Generalization",
      "passage_type": "paragraph",
      "passage": "Validity generalization (VG), developed by Schmidt and Hunter (1977), uses meta-analysis to demonstrate that much of the variability in validity coefficients across studies is due to statistical artifacts (sampling error, criterion unreliability, range restriction) rather than true situational differences",
      "id": "WDEV-0187"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "selection-evaluation.html",
      "chapter_title": "Selection Evaluation",
      "section": "Validity Generalization",
      "passage_type": "paragraph",
      "passage": "Validity generalization has been accepted by courts and the Principles for the Validation and Use of Personnel Selection Procedures (SIOP, 2003) as evidence supporting test use in situations where local validation is impractical",
      "id": "WDEV-0188"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "selection-evaluation.html",
      "chapter_title": "Selection Evaluation",
      "section": "Banding",
      "passage_type": "paragraph",
      "passage": "Banding is a method of interpreting test scores that groups scores within a specified range into a \"band\" and treats all scores within that band as equivalent. The rationale is that small score differences may not be meaningfully different given the test's measurement error",
      "id": "WDEV-0189"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "selection-evaluation.html",
      "chapter_title": "Selection Evaluation",
      "section": "Banding",
      "passage_type": "paragraph",
      "passage": "Within a band, employers may consider other factors, including diversity, for selection decisions. Banding is controversial: proponents argue it appropriately accounts for measurement error; critics argue it sacrifices predictive validity and may amount to quota-based selection",
      "id": "WDEV-0190"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "selection-evaluation.html",
      "chapter_title": "Selection Evaluation",
      "section": "Differential Validity",
      "passage_type": "paragraph",
      "passage": "Differential validity occurs when a test has different validity coefficients for different subgroups (e.g., the test predicts performance with r = .45 for White applicants but r = .25 for Black applicants). Research using large samples and meta-analyses has generally found minimal evidence of differential validity for cognitive ability tests",
      "id": "WDEV-0191"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "selection-evaluation.html",
      "chapter_title": "Selection Evaluation",
      "section": "Uniform Guidelines on Employee Selection Procedures",
      "passage_type": "paragraph",
      "passage": "The Uniform Guidelines (1978), adopted by the EEOC, Department of Labor, Department of Justice, and Civil Service Commission, provide the federal framework for evaluating selection procedures:",
      "id": "WDEV-0192"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "selection-techniques.html",
      "chapter_title": "Selection Techniques",
      "section": "Structured Interviews",
      "passage_type": "definition",
      "passage": "Types of Structured Interview Questions Behavioral (experience-based) questions: Ask candidates to describe specific past experiences relevant to job competencies (e.g., \"Tell me about a time when you had to manage a conflict between team members\"). Based on the premise that past behavior is the best predictor of future behavior. Situational questions: Present hypothetical job-related scenarios and ask candidates what they would do (e.g., \"What would you do if a client became verbally aggressive during a session?\"). Based on Locke's goal-setting theory -- intentions predict behavior",
      "id": "WDEV-0193"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "selection-techniques.html",
      "chapter_title": "Selection Techniques",
      "section": "Work Samples and Situational Judgment Tests",
      "passage_type": "definition",
      "passage": "Work Sample Tests Work sample tests require candidates to perform actual tasks representative of the job (e.g., a typing test for a clerical position, a coding exercise for a software developer). They have high content validity and criterion-related validity (r = .33-.54), generate positive applicant reactions, and show smaller racial group differences than cognitive ability tests",
      "id": "WDEV-0194"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "selection-techniques.html",
      "chapter_title": "Selection Techniques",
      "section": "Work Samples and Situational Judgment Tests",
      "passage_type": "definition",
      "passage": "Situational Judgment Tests (SJTs) Situational judgment tests present candidates with written or video scenarios depicting work situations and ask them to choose or rate response options. SJTs show moderate validity (r = .26-.34) and are useful because they measure a combination of cognitive ability, personality, and job knowledge. They show smaller racial group differences than traditional cognitive ability tests",
      "id": "WDEV-0195"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "selection-techniques.html",
      "chapter_title": "Selection Techniques",
      "section": "Legal Considerations in Selection",
      "passage_type": "definition",
      "passage": "Major Employment Laws Title VII of the Civil Rights Act (1964): Prohibits employment discrimination based on race, color, religion, sex, or national origin Age Discrimination in Employment Act (ADEA, 1967): Protects workers aged 40 and older Americans with Disabilities Act (ADA, 1990): Prohibits discrimination against qualified individuals with disabilities; requires reasonable accommodations; limits when medical examinations can be administered Civil Rights Act of 1991: Allows compensatory and punitive damages; prohibits race-norming of test scores",
      "id": "WDEV-0196"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "selection-techniques.html",
      "chapter_title": "Selection Techniques",
      "section": "Structured Interviews",
      "passage_type": "clinical_note",
      "passage": "EPPP Key Concept Meta-analyses (Huffcutt & Arthur, 1994) show that structured interviews have significantly higher validity (r = .44-.57) than unstructured interviews. Structuring the interview reduces bias, increases reliability, and improves legal defensibility. Both behavioral and situational questions have good validity, though behavioral questions may be slightly better for higher-complexity jobs",
      "id": "WDEV-0197"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "selection-techniques.html",
      "chapter_title": "Selection Techniques",
      "section": "Cognitive Ability Tests",
      "passage_type": "example",
      "passage": "The Validity-Diversity Dilemma While cognitive ability tests are the strongest single predictor of job performance, they also show the largest racial group differences (approximately 1 standard deviation between White and Black means). This creates a tension between maximizing prediction (validity) and minimizing adverse impact (diversity). Strategies to address this include using tests in combination with other predictors, using banding (discussed in Selection Evaluation), or using alternative predictors with less adverse impact",
      "id": "WDEV-0198"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "selection-techniques.html",
      "chapter_title": "Selection Techniques",
      "section": "Introduction to Personnel Selection",
      "passage_type": "paragraph",
      "passage": "Personnel selection refers to the process of choosing individuals for employment based on their potential to perform successfully. Effective selection systems are grounded in job analysis and employ validated assessment methods to predict future job performance",
      "id": "WDEV-0199"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "selection-techniques.html",
      "chapter_title": "Selection Techniques",
      "section": "Introduction to Personnel Selection",
      "passage_type": "paragraph",
      "passage": "The EPPP tests knowledge of various selection methods, their relative validity, and the legal framework governing their use. Understanding the strengths and limitations of each method is essential",
      "id": "WDEV-0200"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "selection-techniques.html",
      "chapter_title": "Selection Techniques",
      "section": "Employment Interviews",
      "passage_type": "paragraph",
      "passage": "Interviews are the most commonly used selection method, despite historically being among the least valid predictors when conducted in an unstructured format",
      "id": "WDEV-0201"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "selection-techniques.html",
      "chapter_title": "Selection Techniques",
      "section": "Unstructured Interviews",
      "passage_type": "paragraph",
      "passage": "Unstructured interviews lack standardized questions, scoring criteria, or systematic evaluation procedures. Interviewers ask different questions of different candidates, follow up on topics of personal interest, and rely on global impressions",
      "id": "WDEV-0202"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "selection-techniques.html",
      "chapter_title": "Selection Techniques",
      "section": "Unstructured Interviews",
      "passage_type": "paragraph",
      "passage": "Meta-analyses show unstructured interviews have relatively low validity (r = .20-.38) and are susceptible to numerous biases including first impression effects, similar-to-me bias, contrast effects, and non-verbal cue overweighting (McDaniel et al., 1994)",
      "id": "WDEV-0203"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "selection-techniques.html",
      "chapter_title": "Selection Techniques",
      "section": "Structured Interviews",
      "passage_type": "paragraph",
      "passage": "Structured interviews use predetermined, job-related questions asked consistently of all candidates, with standardized scoring rubrics. Research consistently demonstrates their superiority",
      "id": "WDEV-0204"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "selection-techniques.html",
      "chapter_title": "Selection Techniques",
      "section": "Assessment Centers",
      "passage_type": "paragraph",
      "passage": "Assessment centers are multi-method, multi-assessor evaluation processes that use simulations and exercises to evaluate candidates on job-relevant dimensions. They are most commonly used for managerial and leadership selection and development",
      "id": "WDEV-0205"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "selection-techniques.html",
      "chapter_title": "Selection Techniques",
      "section": "Assessment Centers",
      "passage_type": "paragraph",
      "passage": "Assessment centers show moderate criterion-related validity (r = .28-.37) for predicting managerial performance . However, they face challenges with construct validity -- factor analyses often reveal that ratings cluster by exercise rather than by dimension, suggesting assessors may evaluate exercise performance rather than the intended constructs",
      "id": "WDEV-0206"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "selection-techniques.html",
      "chapter_title": "Selection Techniques",
      "section": "Biodata",
      "passage_type": "paragraph",
      "passage": "Biographical data (biodata) uses systematically scored information about candidates' life history, experiences, and background to predict job performance. Items may cover education, work history, hobbies, interests, and attitudes",
      "id": "WDEV-0207"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "selection-techniques.html",
      "chapter_title": "Selection Techniques",
      "section": "Biodata",
      "passage_type": "paragraph",
      "passage": "Biodata has demonstrated good criterion-related validity (r = .30-.40) and is one of the best predictors of turnover. It is based on the behavioral consistency principle: past behavior and experiences predict future behavior. A weakness is that the reasons why specific biodata items predict performance are often unclear (lack of construct validity)",
      "id": "WDEV-0208"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "selection-techniques.html",
      "chapter_title": "Selection Techniques",
      "section": "Cognitive Ability Tests",
      "passage_type": "paragraph",
      "passage": "General cognitive ability (g) tests are among the strongest single predictors of job performance, with meta-analytic validity coefficients around r = .51 (Schmidt & Hunter, 1998). Cognitive ability predicts performance across virtually all jobs, with stronger predictive validity for more complex jobs",
      "id": "WDEV-0209"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "selection-techniques.html",
      "chapter_title": "Selection Techniques",
      "section": "Personality Tests in Selection",
      "passage_type": "paragraph",
      "passage": "The Big Five personality traits have been extensively studied as selection predictors. Barrick and Mount's (1991) meta-analysis found that:",
      "id": "WDEV-0210"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "selection-techniques.html",
      "chapter_title": "Selection Techniques",
      "section": "Personality Tests in Selection",
      "passage_type": "paragraph",
      "passage": "An important advantage of personality tests is that they show minimal racial group differences, thus producing less adverse impact than cognitive ability tests. Concerns include faking (socially desirable responding) and relatively modest validity coefficients compared to cognitive ability",
      "id": "WDEV-0211"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "training.html",
      "chapter_title": "Training",
      "section": "Task Analysis",
      "passage_type": "definition",
      "passage": "Steps in Task Analysis Identify the job and its component tasks (using job analysis data) Determine the KSAs required for each task Identify the performance standards and conditions under which tasks are performed Prioritize training content based on task importance, frequency, and difficulty",
      "id": "WDEV-0212"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "training.html",
      "chapter_title": "Training",
      "section": "Kirkpatrick's Training Evaluation Model",
      "passage_type": "definition",
      "passage": "Kirkpatrick's Four Levels Level What It Measures How It Is Measured 1. Reaction Trainees' satisfaction with and attitudes toward the training Post-training surveys, \"smile sheets,\" satisfaction ratings 2. Learning Knowledge, skills, or attitudes acquired during training Pre/post tests, skill demonstrations, written exams 3. Behavior Transfer of training to actual job performance Supervisor ratings, on-the-job observation, performance data 4. Results Organizational impact (productivity, quality, profits, turnover) Organizational records, ROI analysis, business metrics",
      "id": "WDEV-0213"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "training.html",
      "chapter_title": "Training",
      "section": "Factors Affecting Transfer",
      "passage_type": "definition",
      "passage": "Baldwin and Ford's (1988) Transfer Model Transfer of training depends on three categories of factors: Training design: Identical elements (Thorndike), general principles, stimulus variability, practice and overlearning, feedback Trainee characteristics: Ability, personality (self-efficacy, motivation to learn, locus of control), perceived utility of training Work environment: Supervisor support, peer support, opportunity to perform, organizational climate for transfer",
      "id": "WDEV-0214"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "training.html",
      "chapter_title": "Training",
      "section": "E-Learning and Technology-Based Training",
      "passage_type": "clinical_note",
      "passage": "EPPP Key Concept The most effective e-learning incorporates learner control, practice opportunities, and feedback -- consistent with principles from learning theory. Blended learning , which combines online and face-to-face components, often produces the best outcomes by leveraging the advantages of both approaches",
      "id": "WDEV-0215"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "training.html",
      "chapter_title": "Training",
      "section": "Kirkpatrick's Training Evaluation Model",
      "passage_type": "clinical_note",
      "passage": "EPPP Key Concept Most organizations evaluate only at Level 1 (reaction), even though higher levels provide more meaningful information. Importantly, the levels are not strongly correlated: positive reactions (Level 1) do not guarantee learning (Level 2), and learning does not guarantee behavioral change on the job (Level 3). The most critical and least measured level is Level 4 (results). A fifth level has been proposed -- return on investment (ROI) -- which calculates the monetary value of training results compared to training costs",
      "id": "WDEV-0216"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "training.html",
      "chapter_title": "Training",
      "section": "Person Analysis",
      "passage_type": "example",
      "passage": "Example: Three-Level Needs Assessment A hospital implements a new electronic health records system. Organizational analysis: Strategic goal of digitization requires staff retraining; budget allocated. Task analysis: Identifies specific EHR functions staff must perform (entering patient data, ordering labs, documenting notes). Person analysis: Performance data shows that nurses over 55 have the lowest proficiency on the new system and need the most intensive training",
      "id": "WDEV-0217"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "training.html",
      "chapter_title": "Training",
      "section": "Factors Affecting Transfer",
      "passage_type": "example",
      "passage": "Example: Enhancing Transfer A therapy training program maximizes transfer by: (1) using role-plays with realistic client scenarios (identical elements), (2) screening trainees for motivation and readiness (trainee characteristics), (3) arranging post-training supervision and case consultation (work environment support), and (4) requiring trainees to set specific goals for applying new techniques (relapse prevention)",
      "id": "WDEV-0218"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "training.html",
      "chapter_title": "Training",
      "section": "Introduction to Training and Development",
      "passage_type": "paragraph",
      "passage": "Training refers to the systematic acquisition of knowledge, skills, and attitudes that result in improved performance in a specific job or role. Effective training programs follow a systematic process: needs assessment, design and delivery, and evaluation",
      "id": "WDEV-0219"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "training.html",
      "chapter_title": "Training",
      "section": "Introduction to Training and Development",
      "passage_type": "paragraph",
      "passage": "For the EPPP, you must understand the three levels of needs assessment, the major training methods, Kirkpatrick's evaluation model, and the factors that influence transfer of training",
      "id": "WDEV-0220"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "training.html",
      "chapter_title": "Training",
      "section": "Training Needs Assessment",
      "passage_type": "paragraph",
      "passage": "A training needs assessment is the systematic process of determining what training is needed, who needs it, and what conditions are necessary for effective training. It involves three levels of analysis:",
      "id": "WDEV-0221"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "training.html",
      "chapter_title": "Training",
      "section": "Organizational Analysis",
      "passage_type": "paragraph",
      "passage": "Organizational analysis examines the broader context to determine where training is needed within the organization and whether conditions support training effectiveness. Key considerations include:",
      "id": "WDEV-0222"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "training.html",
      "chapter_title": "Training",
      "section": "Task Analysis",
      "passage_type": "paragraph",
      "passage": "Task analysis (also called operations analysis) identifies the specific tasks, knowledge, skills, and abilities (KSAs) required for successful job performance. It determines what the content of training should be",
      "id": "WDEV-0223"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "training.html",
      "chapter_title": "Training",
      "section": "Person Analysis",
      "passage_type": "paragraph",
      "passage": "Person analysis determines which specific employees need training and what kind of training they need. It identifies discrepancies between current and required performance levels",
      "id": "WDEV-0224"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "training.html",
      "chapter_title": "Training",
      "section": "E-Learning and Technology-Based Training",
      "passage_type": "paragraph",
      "passage": "E-learning encompasses training delivered via electronic media, including computer-based training, web-based courses, and mobile learning. Research shows e-learning is generally as effective as classroom instruction for knowledge acquisition, with advantages in cost-efficiency, flexibility, and standardization of content",
      "id": "WDEV-0225"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "training.html",
      "chapter_title": "Training",
      "section": "Kirkpatrick's Training Evaluation Model",
      "passage_type": "paragraph",
      "passage": "Donald Kirkpatrick (1959, 1994) developed the most widely used framework for evaluating training effectiveness. It consists of four levels, each building on the previous:",
      "id": "WDEV-0226"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "training.html",
      "chapter_title": "Training",
      "section": "Transfer of Training",
      "passage_type": "paragraph",
      "passage": "Transfer of training refers to the degree to which knowledge, skills, and abilities learned in training are applied on the job and maintained over time. Transfer is the ultimate goal of training",
      "id": "WDEV-0227"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "training.html",
      "chapter_title": "Training",
      "section": "Factors Affecting Transfer",
      "passage_type": "paragraph",
      "passage": "Identical elements theory (Thorndike & Woodworth, 1901) predicts that transfer is maximized when the training environment closely matches the job environment. This is the theoretical basis for simulation training and high-fidelity practice environments",
      "id": "WDEV-0228"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "training.html",
      "chapter_title": "Training",
      "section": "Factors Affecting Transfer",
      "passage_type": "paragraph",
      "passage": "Relapse prevention , adapted from Marlatt and Gordon's addiction model by Marx (1982), teaches trainees to anticipate situations where they might revert to old behaviors, develop coping strategies, and maintain new skills. This approach has been shown to improve long-term transfer",
      "id": "WDEV-0229"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "career-development.html",
      "chapter_title": "Career Development",
      "section": "Six Work Values in TWA",
      "passage_type": "paragraph",
      "passage": "Flexibility: The degree to which an individual can tolerate P-E discorrespondence before taking action -- a higher threshold for dissatisfaction",
      "id": "WDEV-0230"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "career-development.html",
      "chapter_title": "Career Development",
      "section": "Six Work Values in TWA",
      "passage_type": "paragraph",
      "passage": "Perseverance: The length of time an individual will continue to adjust to P-E discorrespondence before leaving the job",
      "id": "WDEV-0231"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "career-development.html",
      "chapter_title": "Career Development",
      "section": "Three SCCT Variables",
      "passage_type": "paragraph",
      "passage": "Interest development model: Self-efficacy and outcome expectations shape interests, which shape choice goals and actions",
      "id": "WDEV-0232"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "career-development.html",
      "chapter_title": "Career Development",
      "section": "Three SCCT Variables",
      "passage_type": "paragraph",
      "passage": "Choice model: Interests influence career choices, but choices are also constrained by contextual factors (barriers and supports)",
      "id": "WDEV-0233"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "career-development.html",
      "chapter_title": "Career Development",
      "section": "Three SCCT Variables",
      "passage_type": "paragraph",
      "passage": "Performance model: Ability and self-efficacy influence performance outcomes and persistence",
      "id": "WDEV-0234"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "career-development.html",
      "chapter_title": "Career Development",
      "section": "Krumboltz's Learning Theory of Career Counseling",
      "passage_type": "paragraph",
      "passage": "Genetic endowment and special abilities: Inherited qualities that set limits and provide opportunities",
      "id": "WDEV-0235"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "career-development.html",
      "chapter_title": "Career Development",
      "section": "Krumboltz's Learning Theory of Career Counseling",
      "passage_type": "paragraph",
      "passage": "Environmental conditions and events: Factors beyond individual control (job market, labor laws, natural events)",
      "id": "WDEV-0236"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "career-development.html",
      "chapter_title": "Career Development",
      "section": "Krumboltz's Learning Theory of Career Counseling",
      "passage_type": "paragraph",
      "passage": "Learning experiences: Both instrumental (direct outcomes of actions) and associative (observational learning, classical conditioning)",
      "id": "WDEV-0237"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "career-development.html",
      "chapter_title": "Career Development",
      "section": "Krumboltz's Learning Theory of Career Counseling",
      "passage_type": "paragraph",
      "passage": "Task approach skills: Cognitive and performance abilities that are applied to new tasks (work habits, problem-solving, values)",
      "id": "WDEV-0238"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "career-development.html",
      "chapter_title": "Career Development",
      "section": "Introduction to Career Development Theories",
      "passage_type": "paragraph",
      "passage": "These theories inform career counseling practice, vocational assessment, and organizational career management programs.",
      "id": "WDEV-0239"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "decision-making.html",
      "chapter_title": "Decision Making",
      "section": "Antecedent Conditions",
      "passage_type": "paragraph",
      "passage": "High group cohesiveness: Strong sense of group identity and desire to maintain harmony",
      "id": "WDEV-0240"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "decision-making.html",
      "chapter_title": "Decision Making",
      "section": "Antecedent Conditions",
      "passage_type": "paragraph",
      "passage": "Directive leadership: Leader who promotes their preferred solution early in discussions",
      "id": "WDEV-0241"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "decision-making.html",
      "chapter_title": "Decision Making",
      "section": "Antecedent Conditions",
      "passage_type": "paragraph",
      "passage": "Lack of methodical procedures: Absence of systematic norms for evaluating alternatives",
      "id": "WDEV-0242"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "decision-making.html",
      "chapter_title": "Decision Making",
      "section": "Preventing Groupthink",
      "passage_type": "paragraph",
      "passage": "Assign one member the role of devil's advocate to deliberately challenge proposals",
      "id": "WDEV-0243"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "decision-making.html",
      "chapter_title": "Decision Making",
      "section": "Preventing Groupthink",
      "passage_type": "paragraph",
      "passage": "Encourage each member to discuss the group's deliberations with trusted associates outside the group",
      "id": "WDEV-0244"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "decision-making.html",
      "chapter_title": "Decision Making",
      "section": "Preventing Groupthink",
      "passage_type": "paragraph",
      "passage": "Janis recommended several strategies to prevent groupthink:",
      "id": "WDEV-0245"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "decision-making.html",
      "chapter_title": "Decision Making",
      "section": "Five Decision-Making Styles",
      "passage_type": "paragraph",
      "passage": "The appropriate style depends on situational factors assessed through a series of diagnostic questions:",
      "id": "WDEV-0246"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "decision-making.html",
      "chapter_title": "Decision Making",
      "section": "Group Decision-Making Techniques",
      "passage_type": "paragraph",
      "passage": "Several structured techniques have been developed to improve group decision quality:",
      "id": "WDEV-0247"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "job-analysis.html",
      "chapter_title": "Job Analysis",
      "section": "O*NET and Modern Job Analysis",
      "passage_type": "paragraph",
      "passage": "Worker characteristics: Abilities, occupational interests, work values, work styles",
      "id": "WDEV-0248"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "job-analysis.html",
      "chapter_title": "Job Analysis",
      "section": "O*NET and Modern Job Analysis",
      "passage_type": "paragraph",
      "passage": "Occupational requirements: Generalized work activities, organizational context, work context",
      "id": "WDEV-0249"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "job-analysis.html",
      "chapter_title": "Job Analysis",
      "section": "KSAOs",
      "passage_type": "paragraph",
      "passage": "Job analysis identifies the KSAOs required for successful job performance:",
      "id": "WDEV-0250"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "job-analysis.html",
      "chapter_title": "Job Analysis",
      "section": "Job Descriptions and Job Specifications",
      "passage_type": "paragraph",
      "passage": "Job analysis produces two primary documents:",
      "id": "WDEV-0251"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "leadership.html",
      "chapter_title": "Leadership",
      "section": "University of Michigan Leadership Studies",
      "passage_type": "paragraph",
      "passage": "Production-oriented leaders: Emphasize technical aspects of work and view employees as means to accomplish tasks (similar to initiating structure)",
      "id": "WDEV-0252"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "leadership.html",
      "chapter_title": "Leadership",
      "section": "University of Michigan Leadership Studies",
      "passage_type": "paragraph",
      "passage": "Employee-oriented leaders: Emphasize interpersonal relationships, take a personal interest in employees' needs, and accept individual differences (similar to consideration)",
      "id": "WDEV-0253"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "leadership.html",
      "chapter_title": "Leadership",
      "section": "Transactional Leadership",
      "passage_type": "paragraph",
      "passage": "Contingent reward: Setting clear expectations and providing rewards when goals are met",
      "id": "WDEV-0254"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "leadership.html",
      "chapter_title": "Leadership",
      "section": "Transactional Leadership",
      "passage_type": "paragraph",
      "passage": "Management by exception (active): Monitoring performance and taking corrective action when standards are not met",
      "id": "WDEV-0255"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "leadership.html",
      "chapter_title": "Leadership",
      "section": "Transactional Leadership",
      "passage_type": "paragraph",
      "passage": "Management by exception (passive): Intervening only when problems become serious",
      "id": "WDEV-0256"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "leadership.html",
      "chapter_title": "Leadership",
      "section": "Transactional Leadership",
      "passage_type": "paragraph",
      "passage": "Laissez-faire: Abdicating responsibility and avoiding decisions (considered non-leadership)",
      "id": "WDEV-0257"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "leadership.html",
      "chapter_title": "Leadership",
      "section": "University of Michigan Leadership Studies",
      "passage_type": "paragraph",
      "passage": "Concurrently, researchers at the University of Michigan (Likert, 1961) identified two similar leadership styles:",
      "id": "WDEV-0258"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "motivation.html",
      "chapter_title": "Motivation",
      "section": "SDT Motivation Continuum",
      "passage_type": "paragraph",
      "passage": "SDT proposes three basic psychological needs that must be satisfied for optimal motivation and well-being:",
      "id": "WDEV-0259"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "org-change.html",
      "chapter_title": "Organizational Change",
      "section": "Lewin's Force Field Analysis",
      "passage_type": "paragraph",
      "passage": "Driving forces: Factors pushing toward change (competitive pressure, new technology, declining performance, leadership vision)",
      "id": "WDEV-0260"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "org-change.html",
      "chapter_title": "Organizational Change",
      "section": "Lewin's Force Field Analysis",
      "passage_type": "paragraph",
      "passage": "Restraining forces: Factors resisting change (habit, fear of the unknown, resource limitations, organizational inertia)",
      "id": "WDEV-0261"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "org-change.html",
      "chapter_title": "Organizational Change",
      "section": "Action Research",
      "passage_type": "paragraph",
      "passage": "Data gathering: Collecting information about the problem (surveys, interviews, observations)",
      "id": "WDEV-0262"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "organizational-theories.html",
      "chapter_title": "Organizational Theories",
      "section": "Bureaucratic Theory (Max Weber)",
      "passage_type": "paragraph",
      "passage": "Traditional authority: Based on established customs and traditions (e.g., hereditary monarchies)",
      "id": "WDEV-0263"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "organizational-theories.html",
      "chapter_title": "Organizational Theories",
      "section": "Bureaucratic Theory (Max Weber)",
      "passage_type": "paragraph",
      "passage": "Rational-legal authority: Based on formal rules and procedures -- the foundation of bureaucracy",
      "id": "WDEV-0264"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "organizational-theories.html",
      "chapter_title": "Organizational Theories",
      "section": "Katz and Kahn's Social Systems Model",
      "passage_type": "paragraph",
      "passage": "Adaptive subsystems: Sensing and responding to environmental changes (R&D, planning)",
      "id": "WDEV-0265"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "organizational-theories.html",
      "chapter_title": "Organizational Theories",
      "section": "Woodward's Technology Typology",
      "passage_type": "paragraph",
      "passage": "Unit/small-batch production: Custom products; organic structure with few management levels works best",
      "id": "WDEV-0266"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "organizational-theories.html",
      "chapter_title": "Organizational Theories",
      "section": "Woodward's Technology Typology",
      "passage_type": "paragraph",
      "passage": "Mass/large-batch production: Standardized products; mechanistic structure with clear hierarchies works best",
      "id": "WDEV-0267"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "organizational-theories.html",
      "chapter_title": "Organizational Theories",
      "section": "Woodward's Technology Typology",
      "passage_type": "paragraph",
      "passage": "Continuous process production: Automated, continuous flow; organic structure with high skill levels works best",
      "id": "WDEV-0268"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "organizational-theories.html",
      "chapter_title": "Organizational Theories",
      "section": "Burns and Stalker: Mechanistic vs. Organic Structures",
      "passage_type": "paragraph",
      "passage": "Tom Burns and G.M. Stalker (1961) identified two contrasting organizational forms suited to different environments:",
      "id": "WDEV-0269"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "satisfaction-stress.html",
      "chapter_title": "Satisfaction & Stress",
      "section": "Dispositional Approach",
      "passage_type": "paragraph",
      "passage": "Positive affectivity (PA): Individuals high in PA tend to experience more positive emotions and greater satisfaction across situations",
      "id": "WDEV-0270"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "satisfaction-stress.html",
      "chapter_title": "Satisfaction & Stress",
      "section": "Dispositional Approach",
      "passage_type": "paragraph",
      "passage": "Negative affectivity (NA): Individuals high in NA tend to experience more negative emotions and report lower satisfaction",
      "id": "WDEV-0271"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "satisfaction-stress.html",
      "chapter_title": "Satisfaction & Stress",
      "section": "Dispositional Approach",
      "passage_type": "paragraph",
      "passage": "Core self-evaluations (CSE): Judge et al. (1997) identified a higher-order trait comprising self-esteem, generalized self-efficacy, locus of control, and emotional stability that predicts job satisfaction",
      "id": "WDEV-0272"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "selection-evaluation.html",
      "chapter_title": "Selection Evaluation",
      "section": "Uniform Guidelines on Employee Selection Procedures",
      "passage_type": "paragraph",
      "passage": "Any procedure used to make employment decisions is a \"test\" subject to the Guidelines",
      "id": "WDEV-0273"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "selection-evaluation.html",
      "chapter_title": "Selection Evaluation",
      "section": "Uniform Guidelines on Employee Selection Procedures",
      "passage_type": "paragraph",
      "passage": "If adverse impact is demonstrated, the employer must show the procedure is valid (criterion-related, content, or construct validity)",
      "id": "WDEV-0274"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "selection-evaluation.html",
      "chapter_title": "Selection Evaluation",
      "section": "Uniform Guidelines on Employee Selection Procedures",
      "passage_type": "paragraph",
      "passage": "Content validity is acceptable only for selection procedures that directly sample job content",
      "id": "WDEV-0275"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "selection-evaluation.html",
      "chapter_title": "Selection Evaluation",
      "section": "Uniform Guidelines on Employee Selection Procedures",
      "passage_type": "paragraph",
      "passage": "Employers should use the procedure with the least adverse impact when alternatives exist",
      "id": "WDEV-0276"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "selection-evaluation.html",
      "chapter_title": "Selection Evaluation",
      "section": "Uniform Guidelines on Employee Selection Procedures",
      "passage_type": "paragraph",
      "passage": "The bottom-line concept: adverse impact is evaluated based on the overall selection process, not individual components (though this was somewhat limited by Connecticut v. Teal, 1982)",
      "id": "WDEV-0277"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "selection-evaluation.html",
      "chapter_title": "Selection Evaluation",
      "section": "Test Fairness Models",
      "passage_type": "paragraph",
      "passage": "Multiple definitions of test fairness exist, and they sometimes conflict:",
      "id": "WDEV-0278"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "selection-techniques.html",
      "chapter_title": "Selection Techniques",
      "section": "Legal Considerations in Selection",
      "passage_type": "paragraph",
      "passage": "Selection practices must comply with federal employment law. Key legislation includes:",
      "id": "WDEV-0279"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "selection-techniques.html",
      "chapter_title": "Selection Techniques",
      "section": "Comparative Validity of Selection Methods",
      "passage_type": "paragraph",
      "passage": "Schmidt and Hunter (1998) provided a landmark summary of the validity of different selection methods:",
      "id": "WDEV-0280"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "training.html",
      "chapter_title": "Training",
      "section": "Organizational Analysis",
      "passage_type": "paragraph",
      "passage": "Organizational climate and support for training (supervisor support, opportunity to practice)",
      "id": "WDEV-0281"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "training.html",
      "chapter_title": "Training",
      "section": "Organizational Analysis",
      "passage_type": "paragraph",
      "passage": "Environmental constraints or changes (new technology, regulations, restructuring)",
      "id": "WDEV-0282"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "training.html",
      "chapter_title": "Training",
      "section": "Simulation-Based Training",
      "passage_type": "paragraph",
      "passage": "Role playing: Trainees act out scenarios to practice interpersonal skills (conflict resolution, customer service, counseling)",
      "id": "WDEV-0283"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "training.html",
      "chapter_title": "Training",
      "section": "Simulation-Based Training",
      "passage_type": "paragraph",
      "passage": "Business simulations/games: Participants make decisions in a simulated business environment and see the consequences",
      "id": "WDEV-0284"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "training.html",
      "chapter_title": "Training",
      "section": "Simulation-Based Training",
      "passage_type": "paragraph",
      "passage": "Virtual reality/computer simulations: Technology-based recreations of work environments for high-fidelity practice (surgical simulators, flight simulators)",
      "id": "WDEV-0285"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "training.html",
      "chapter_title": "Training",
      "section": "Simulation-Based Training",
      "passage_type": "paragraph",
      "passage": "Case studies: Detailed analysis of real or hypothetical situations to develop analytical and decision-making skills",
      "id": "WDEV-0286"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "training.html",
      "chapter_title": "Training",
      "section": "Types of Transfer",
      "passage_type": "paragraph",
      "passage": "Negative transfer: Training interferes with job performance (e.g., learning to drive on the right after years of driving on the left)",
      "id": "WDEV-0287"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "training.html",
      "chapter_title": "Training",
      "section": "Types of Transfer",
      "passage_type": "paragraph",
      "passage": "Near transfer: Applying learned skills to situations very similar to the training context",
      "id": "WDEV-0288"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "training.html",
      "chapter_title": "Training",
      "section": "Types of Transfer",
      "passage_type": "paragraph",
      "passage": "Far transfer: Applying learned skills to situations quite different from the training context (more difficult to achieve)",
      "id": "WDEV-0289"
    },
    {
      "domain_code": "WDEV",
      "domain_name": "Workforce Development & Leadership",
      "chapter_file": "training.html",
      "chapter_title": "Training",
      "section": "Simulation-Based Training",
      "passage_type": "paragraph",
      "passage": "Simulation training creates realistic replicas of work situations for practice without real-world consequences:",
      "id": "WDEV-0290"
    }
  ]
}